{
  "posts": [
    {
      "thread": {
        "uuid": "cfa5ea29882b85b208ab1ab92a27a8bc12954501",
        "url": "http://omgili.com/ri/uBQNNiLKiWbpiReQSDYUbaSg37F4m3aR0kVmvkcmnLqBPRDyP2sl8dpiTsr1C8ivlKU97fcqESU-",
        "site_full": "hellogiggles.com",
        "site": "hellogiggles.com",
        "site_section": "http://hellogiggles.com",
        "site_categories": [
          "entertainment",
          "education"
        ],
        "section_title": "HelloGiggles",
        "title": "You can now find “Fantastic Beasts” on Google Maps and it is truly magical",
        "title_full": "You can now find “Fantastic Beasts” on Google Maps and it is truly magical",
        "published": "2016-11-06T20:50:07.348+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "blogs",
        "country": "US",
        "spam_score": 0.0,
        "main_image": null,
        "performance_score": 4,
        "domain_rank": 3916,
        "social": {
          "facebook": {
            "likes": 487,
            "comments": 0,
            "shares": 487
          },
          "gplus": {
            "shares": 3
          },
          "pinterest": {
            "shares": 3
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 1
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "cfa5ea29882b85b208ab1ab92a27a8bc12954501",
      "url": "http://omgili.com/ri/uBQNNiLKiWbpiReQSDYUbaSg37F4m3aR0kVmvkcmnLqBPRDyP2sl8dpiTsr1C8ivlKU97fcqESU-",
      "ord_in_thread": 0,
      "author": "Emily Baines",
      "published": "2016-11-06T20:50:07.348+02:00",
      "title": "You can now find “Fantastic Beasts” on Google Maps and it is truly magical",
      "text": "You can now find “Fantastic Beasts” on Google Maps and it is truly magical Well, let the squealing begin! Fantastic Beasts and Where To Find Them has teamed up with Google Maps to give us some insight into the wonderful world of the new series. So, for those of us who are tired of reading the delightful Pottermore and cannot wait for the release of the new movie, you can pull up distinct locations from the Fantastic Beasts universe and explore them in street view. Yes, the future is now!\nThe Magical Congress of the USA The Woolworth Building , which serves as the location of the Magical Congress of the United States of America (MACUSA) during Fantastic Beasts , has its own marker . And it is awesome .\nLocated just around the corner from City Hall, the MACUSA is accessible for witches and wizards to explore. (Poor Muggles!) Thanks to Google Maps, we can now see street views of two of the rooms at MACUSA. We get an inside peak at Tina’s cramped office space, located in a dimly lit room within MACUSA. She also has a sign that reads, “You don’t have to be MAGIC to work here. Actually, YOU DO!” behind her desk.\nGoogle Maps Google Maps The other room we have access to is the main hall that we’ve seen briefly in the trailers for Fantastic Beasts . MACUSA’s Magical Exposure Threat Level clock is visible and currently marked at “Severe Unexplained Activity.” Yikes .\nGoogle Maps Google Maps The Blind Pig So for those of us who want somewhere to relax, we can always head over to The Blind Pig, the “witch-friendly subterranean speakeasy” and bar of choice for wizards:\nGoogle Maps As reported by Daily Dot : \n“When you choose street view, you’re transported to the secret entrance that they use to enter the speakeasy, and clicking through will lead you to the bar where they chat with Gnarlak, a clever goblin played by Ron Perlman.” Google Maps Google Maps We’d love to visit this bar in real life!\nTina and Queenie Goldstein’s Apartment Fans can also explore Tina and Queenie Goldstein’s apartment to better understand their characters.\nGoogle Maps Certainly, these options are wonderful. Yet they can only satiate our hunger for Fantastic Beasts so much. The release can’t get here fast enough!\nThe post You can now find “Fantastic Beasts” on Google Maps and it is truly magical appeared first on HelloGiggles .",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [
          {
            "name": "blind pig",
            "sentiment": "none"
          },
          {
            "name": "queenie goldstein",
            "sentiment": "none"
          },
          {
            "name": "gnarlak",
            "sentiment": "none"
          },
          {
            "name": "ron perlman",
            "sentiment": "none"
          },
          {
            "name": "tina",
            "sentiment": "none"
          }
        ],
        "organizations": [
          {
            "name": "google",
            "sentiment": "positive"
          },
          {
            "name": "macusa",
            "sentiment": "none"
          },
          {
            "name": "woolworth building",
            "sentiment": "none"
          },
          {
            "name": "magical congress of the united states of america",
            "sentiment": "none"
          },
          {
            "name": "google maps google",
            "sentiment": "none"
          }
        ],
        "locations": [
          {
            "name": "macusa",
            "sentiment": "none"
          },
          {
            "name": "usa",
            "sentiment": "none"
          },
          {
            "name": "city hall",
            "sentiment": "none"
          }
        ]
      },
      "crawled": "2016-11-06T20:50:07.348+02:00"
    },
    {
      "thread": {
        "uuid": "6873fcb7e933780e9850cb94800c3119dbe61408",
        "url": "http://omgili.com/ri/2wGaacqxAptkyFj4CwJEV1mgC7dMLeD34s2f55XDa8ZK8eLPvChHrxyv5L0FBzeeIqLu_K97i4PNXRblYODiKg--",
        "site_full": "mashable.com",
        "site": "mashable.com",
        "site_section": "http://mashable.com/",
        "site_categories": [
          "business"
        ],
        "section_title": "Mashable",
        "title": "Google launches YouTube Kids app in India",
        "title_full": "Google launches YouTube Kids app in India",
        "published": "2016-11-09T12:10:24.618+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "blogs",
        "country": "US",
        "spam_score": 0.003,
        "main_image": "http://a.amz.mshcdn.com/media/ZgkyMDE2LzExLzA5LzE0L1lvdVR1YmVfS2lkc19ldmVudF9waG90b2dyYXBoXzIuMTJjZWEuanBnCnAJdGh1bWIJMTIwMHg2MzAKZQlqcGc/909fbee5/dc0/YouTube_Kids_event_photograph_2.jpg",
        "performance_score": 3,
        "domain_rank": 360,
        "social": {
          "facebook": {
            "likes": 305,
            "comments": 0,
            "shares": 305
          },
          "gplus": {
            "shares": 12
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 57
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "6873fcb7e933780e9850cb94800c3119dbe61408",
      "url": "http://omgili.com/ri/2wGaacqxAptkyFj4CwJEV1mgC7dMLeD34s2f55XDa8ZK8eLPvChHrxyv5L0FBzeeIqLu_K97i4PNXRblYODiKg--",
      "ord_in_thread": 0,
      "author": "Manish Singh",
      "published": "2016-11-09T12:10:24.618+02:00",
      "title": "Google launches YouTube Kids app in India",
      "text": "Indian parents with kids who love to spend time on YouTube can now take a sigh of relief.\nGoogle today launched YouTube Kids in India, a special app of the video portal with family-friendly content. The company said it has partnered with several YouTube creators in India for exclusive content for YouTube Kids app. The app is available on both iOS and Android . There's no web version of YouTube Kids.\nSEE ALSO: YouTube Kids debuts in Asia with Malaysia and the Philippines\nThe arrival of YouTube Kids in India comes one-and-a-half years after it was first launched in the United States. Over the years, parents worldwide have expressed concerns over the content YouTube offers and whether they are fit for children. YouTube Kids is company’s address to such concerns. The app is now available in over 20 nations.\nThere are already some very popular Indian YouTube channels that offer content aimed at kids. The most notable of them is 'ChuChuTV', the second most popular YouTube channel in India with over six billion total views. The channel offers colorful animations and songs for kids.\nIn addition to kids-friendly content, the YouTube Kids app is also designed to give parents better control over the things they want their kids to see, as well as a redesigned user interface with bigger thumbnails and buttons so that the app is easily accessible for kids.\nParents can also put a limit on the things their child is permitted to search on the app. They can also set a timer on how long they want their kids to use the app. In addition, the app also offers the ability to turn off background music and sound effects (so that people around the kid aren’t disturbed), and add a passcode to ensure that kids are not able to make changes to the settings.",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [
        "https://play.google.com/store/apps/details?id=com.google.android.apps.youtube.kids&hl=en",
        "https://itunes.apple.com/app/apple-store/id936971630?mt=8"
      ],
      "entities": {
        "persons": [],
        "organizations": [
          {
            "name": "google",
            "sentiment": "positive"
          },
          {
            "name": "youtube",
            "sentiment": "positive"
          },
          {
            "name": "youtube kids",
            "sentiment": "positive"
          },
          {
            "name": "youtube kids in india",
            "sentiment": "none"
          }
        ],
        "locations": [
          {
            "name": "india",
            "sentiment": "none"
          },
          {
            "name": "united states",
            "sentiment": "none"
          },
          {
            "name": "philippines",
            "sentiment": "none"
          },
          {
            "name": "malaysia",
            "sentiment": "none"
          },
          {
            "name": "asia",
            "sentiment": "none"
          }
        ]
      },
      "crawled": "2016-11-09T12:10:24.618+02:00"
    },
    {
      "thread": {
        "uuid": "e85540d67f90c6342b3d4bc392d4741a05889d18",
        "url": "http://omgili.com/ri/jHIAmI4hxg.aX6RsjGyewe2esD1hjPoJTC7ovKWQzkLDz_0c0r2S5DIMwEbZsqKoJu2JmGqlZ7E-",
        "site_full": "www.androidcentral.com",
        "site": "androidcentral.com",
        "site_section": "http://www.androidcentral.com/",
        "site_categories": [
          "news",
          "tech"
        ],
        "section_title": "Android Central - Android Forums, News, Reviews, Help and Android Wallpapers",
        "title": "Daydream View review: A fantastic step into the next generation of VR headsets",
        "title_full": "Daydream View review: A fantastic step into the next generation of VR headsets",
        "published": "2016-11-10T16:02:18.494+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "blogs",
        "country": "US",
        "spam_score": 0.0,
        "main_image": null,
        "performance_score": 1,
        "domain_rank": 1053,
        "social": {
          "facebook": {
            "likes": 181,
            "comments": 0,
            "shares": 181
          },
          "gplus": {
            "shares": 5
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "e85540d67f90c6342b3d4bc392d4741a05889d18",
      "url": "http://omgili.com/ri/jHIAmI4hxg.aX6RsjGyewe2esD1hjPoJTC7ovKWQzkLDz_0c0r2S5DIMwEbZsqKoJu2JmGqlZ7E-",
      "ord_in_thread": 0,
      "author": "Russell Holly",
      "published": "2016-11-10T16:02:18.494+02:00",
      "title": "Daydream View review: A fantastic step into the next generation of VR headsets",
      "text": "\nGoogle's new VR experience is a universe of possibility populated by a fistful of successful ideas.\nThe next stage of smartphone-based VR is here, but you're going to quickly notice a few things are needed for this to be as much fun as it could be.\nPros More comfortable than most VR headsets Daydream Controller is excellent High quality VR experiences Cons Basically no apps at launch Light bleed affects immersion \nA great fresh start Google Daydream View Full review The stewards of Android discovered a long time ago that a democratized platform will grow faster than one rigidly controlled and maintained. The Android OS never would have become the global power it is today had Google not made it something just about any hardware company could make something for. The same can be said for Chrome, Search, Gmail, and most of Google's other products. Make it something as many people as possible can enjoy on their terms — more or less — and growth will be incredible.\nA \"20% project\" announced almost as a forgotten footnote at the end of Google I/O 2014 is one of the more recent examples. A simple cardboard box with a rubber band and a pair of cheap plastic lenses offered anyone with a smartphone the ability to experience immersive photography and video in a way that hadn't been so widely available since the View-Master. Google Cardboard grew in popularity at an explosive rate, due in no small part to how many things could interact with the hardware and how readily available the software is across iOS, Android, and YouTube.\nAs cool as Cardboard is, it's not particularly easy to improve that experience without leaving behind a segment of the current user base. You can make apps that only work on high-end phones, or apps that work best when you aren't holding the cardboard box to your face with your hands, but you carve out a big chunk of users with every limitation. In order to reach a higher standard of VR content, a new platform needed to exist that focused only on delivering those high quality, high immersion experiences. Google is calling this upgraded experience Daydream, and the first headset built to deliver this new experience Daydream View .\nAbout this review I have been using Daydream View with a Google Pixel XL for six days. That Pixel XL, which was sent with the headset by Google, arrived running build NDE63U with a version of Google VR Services that has been updated three times during the review process.\n\nLike wearing sweatpants on your face Google Daydream View Hardware No two Google Cardboard headsets are exactly alike, but they all follow the same general layout. It's a design you can spot from across the room if you own one of these simple VR headsets, and Daydream View looks like a highly stylized version of one of those them. The phone slips into the front cavity, and a pair of lenses sit a couple inches from that space to warp the image on the screen to fit your vision. It's a familiar setup, one that works well for what Google has been trying to accomplish so far.\nAs you pick up and use this particular highly stylized Google Cardboard headset, it becomes clear this is much more sophisticated. Opening the front tray reveals the Daydream Controller, a small wireless controller with a wrist strap that gets used to control every aspect of the Daydream experience. Under that controller, which is nicely secured by an elastic strap, there's an NFC tag to launch Daydream as soon as you put the phone down. That move causes a notification to float up asking you to close the headset so Daydream can start.\nWhen you close the phone into Daydream view, it's perfectly centered against the lenses in the headset without you needing to move a thing. This happens thanks to the two black rubber nubs touching the phone display, which tells the apps you're about to use where the \"center\" is without your assistance. That's a big deal, and not only because it means jumping into Daydream is even more convenient any other mobile VR platform right now. This mechanism removes the one real adjustment Google Cardboard users have to do to ensure a clear image, something you'll never need to worry about on Daydream.\nThe thing that really sells Daydream View as a Gear VR competitor is that you don't have to use a Samsung phone.\nPutting the headset itself on is easy. There's a single strap, and you pull it onto your head and tighten the strap until you're comfortable. The strap adjustment sliders are convenient and work well for adults, but don't quite get small enough for many younger users. As you've seen in the photos, Daydream View is almost entirely fabric, including big plush pads for the forehead and sides. It's a quick, comfortable fit to be sure, but the winner of our Most Comfortable VR Headset award still goes to PlayStation VR for now . The pressure caused by tightening the headset all rests just above your eyebrows, and even with a loose fit you're going to feel that pressure after about an hour.\nThe spacing on the face hole for this headset is wide enough for you to be able to put just about any size prescription lenses inside without being too uncomfortable, which is fantastic. You may notice some initial discomfort when trying to get the headset into place, especially if your glasses are prone to pressing against your face already, but in most cases a quick adjustment will make this a smooth ride. What you get in exchange, unfortunately, is some significant light bleed on either side of the headset.\nIt all comes together to form a VR headset that feels an awful lot like a response to Samsung and Oculus.\nThe sides of the headset don't sit flush against your skin, so any amount of light from behind you will be visible as a reflection on the lens just in front of your display. Those reflections aren't great for establishing total immersion in what you're doing, but more importantly, rapidly adjusting focus between the reflection and the VR world can lead to headaches in a hurry.\nAll of this comes together to form a VR headset that feels an awful lot like a response to Samsung and Oculus. The Samsung Gear VR didn't really have any competition until now, and Google's offering sets you up with more input options with the Daydream controller, a nearly identical field a view, and a more compact and comfortable headset. The thing that really sells Daydream View as a Gear VR competitor is that you don't have to use a Samsung phone, and that eventually there will be more options than just the Google Pixel and Pixel XL supported in this headset. That has the potential to be a very big deal, assuming support comes at a fast enough pace.\n\nTotally contained, and damned impressive Google Daydream View Software Your days of crawling Google's seemingly endless Play Store for quality games that will work in your Cardboard viewer are, thankfully, behind you. Google has a standalone Daydream app for your phone, and its job is to manage your Daydream apps and offer a simple, separate place for your VR world. For the most part, Daydream in app form is a way to organize your VR apps and offer you a 2D way to access Daydream settings. If you want to set a different VR keyboard, this is the fastest way to do that. If you want to pair a new Daydream Controller, this is where you do that. It's fairly straightforward, which is exactly what it needed to be.\nIt's also the most visually compelling app Google has ever released.\n\nEvery listing in your Daydream library is interactive. Pause on a listing for a moment and the static image for the app or game turns into a window for you to peer through into the world contained within. This simple 360-degree image encourages you to move your phone around and peek into the world in order to see what you'll be doing with the headset on. It's not only a great way to distract yourself for a few minutes at a time, it's the perfect way to show off new VR apps to people who aren't sure about buying something untested. No other VR service offers a comparable setup right now, but this should be the default experience for buying VR apps and games.\nThe Daydream app is the perfect way to show off new VR experiences to people who aren't sure about buying something untested.\nWhen you aren't browsing in the Daydream app, you have the headset on your face and are getting the full VR experience. Google has built Daydream in much the same way Oculus has built Home, as a fully contained VR experience that lets you search through your library and purchase new apps without needing to take the headset off. This experience is built in a total 360-degree world unique to Daydream, and encourages users to stick around in the VR world for longer than a quick tour through any single app or game.\n\nDaydream's controller lends a lot to this experience. You hold the wand in the real world, and in the virtual one you see a laser pointer to interact with whatever you want. The accuracy of this controller is key, and something Google nailed out of the box. When you move left and right, up or down, and even spinning the controller around, you see that represented in the VR world. It's not a full travel system like HTC's Vive controllers, but it's the closest you'll get from a Bluetooth-connected accessory. Using the Daydream Controller to navigate everything feels noticeably more natural than a gamepad or touch pad on the side of the headset, and if your goal is to use the headset for extended periods of time that's a big deal.\nGoogle's software team worked very hard to minimize what's called the Screen Door Effect through software, especially in the primary menu and Play Store. The use of Material Design elements with bold primary colors makes it more difficult to spot the display lines on the Pixel XL, and throughout all of the text Google supplies everything is perfectly readable without a lot of harsh black lines from the display. Google's software partners didn't work quite as hard, so in several other apps the SDE is more noticeable. It's likely Google will offer up some UI guidelines to help reduce these experiences, but for now know that all of Google's apps follow this fairly well.\nSpeaking of third-party apps, it'd be really nice if Daydream had a few! At the time of review, the Daydream part of Google Play currently has ten whole apps, five of which are made by Google. Here's what you've got to work with:\nArts and Culture — Taking guided 360-degree tours of amazing places all around the world. Play Movies — Grab a seat in a theater in a glade, with the stars above you and your Play Movies library projected on a sheet in front of you. YouTube — Immerse yourself in the best of YouTube, with menus that fly in to your perspective at the press of a button. Photos — Take a look at any photos you've taken, including Cardboard Camera and Photosphere pictures. Street View — Stand in the middle of a street, and look around to see almost any place in the world. Star Chart VR — Take a look at the world, or any other world in our solar system with your futuristic laser pointer. WonderGlade — A theme park full of minigames all involving your motion controller. Mekorama VR — 360-degree puzzles where you move the whole world to get your character to the goal. WSJ VR — 360-degree stories with an impressive level of detail. Hunter's Gate — A classic dungeon crawler with a VR twist. While no doubt a diverse offering of incredibly well-made apps, it's possible to enjoy all of these apps in a single day and be ready for more. While no one expected Google to immediately compete with the massive list of Gear VR games that are available after years of competition-free existence, the lack of content is frustrating. We know Google has lots of support promised for the not-so-distant future, including names like HBO and Netflix as well as exclusives from CCP Games and the Wizarding World of Harry Potter, but for right now you get these ten apps.\nSpeaking of third-party apps, it'd be really nice if Daydream had a few!\nGoogle could have added support for the utterly massive list of Cardboard games that are available in the Play Store to flesh this list out, but it's important to note the difference in quality between Cardboard games and Daydream games. Daydream games are immersive, rich, and offer high resolution and high frame-rate gameplay or visuals. Cardboard apps are not nearly as capable, and don't support the basics of Daydream Controller interaction. For now, and quite possibly forever, these two Google-made VR experiences are totally different worlds.\nIt's fantastic to see Google nail software, however scarce the launch apps may be. Everything about the Daydream world is well executed, from the spatial audio to the way many of Google's apps are visually connected to the center \"house\" you start out in. It's a great first step, and hopefully that store gets full quickly.\n\nLots more of this, please! Google Daydream View Experience From the moment you put on these goggles that weirdly feel like sweatpants, you're in another world entirely. Pressing the activation button on your Controller causes the world around to go dark, followed by the sound of insects and flowing water. As the world gets a little brighter, the floating menu in front of you invites you to take part in a host of exciting experiences. Some of these are dedicated apps for games or immersive VR stories, but everything is a little different and there's something for everyone. As you turn around, the rest of the little house you are sitting in comes into focus. It's simple room with paths that lead to other apps and just enough fun randomness on the wall to encourage you to look around and soak it all in.\nDaydream View is a complete thought, which is something I don't get to say often enough when looking at new VR platforms. This isn't a way to soak up the existing VR content and act as a gatekeeper for those experiences, it's a standalone idea. Google, much like HTC and Valve, thinks motion controllers are the way forward. Waving your hand through the air and seeing it represented in VR is something special. Being able to swipe your thumb across the pad and quickly flick your wrist for real actions in Daydream is significantly more convenient and natural than any other control mechanism out there today.\n\nThis headset will eventually be supported by something other than Google's Pixel and Pixel XL, but what these phones offer initially is pretty great. There's undeniably a quality difference when looking at things through the lower-resolution (1080p) Pixel, and light bleed will be more pronounced with smaller phones that allow the bezel to be seen through the lenses, but the Pixel XL experience is great. Not once in upwards of 50 hours of use so far has the phone shown any signs of lagging or slowing down, and the games have been consistent across each play session. Your phone will be warm to the touch after a few minutes of active gameplay, but never hot enough to be painful even after hours of gameplay.\nDaydream View has the potential to be the best mobile VR headset you can buy.\nBattery is always a concern with smartphone-based VR, and Google promised to work hard on ensuring that experience was as good as it could be. On average, Daydream consumes 30% of battery for every hour of use, which is better than you'll get in any other smartphone-based VR system. That having been said, the lack of any face detection sensors like the ones on the front of the Gear VR means if you take the headset off and set it down to answer a knock at the door or rush into a meeting, Daydream will continue running without you.\nAt the end of the day, the biggest problem with Daydream View is that I've already run out of things to do with it. It's a fun system, but Google needs to step up the available content ASAP. Games are a big part of what comes next for this platform, but also watching 2D and 360-degree videos through the various apps that support your activity right now. For early adopters this is going to be a waiting game, and hopefully Google and their partners don't keep us waiting for long.\n\nIt'll probably be awesome eventually? Google Daydream View Bottom line This headset has the potential to be the best mobile VR headset you can buy, and maintain that title for quite some time. Google's efforts in implementing motion controls, controlling the software to an extent, and making sure the headset is comfortable enough to want to use for longer periods of time are great. The price is great s well, $79 is within striking distance of many higher end Google Cardboard headsets and undercuts Samsung's Gear VR by $20 on the shelf. Aside from the light bleed, the headset itself is well executed and the controller is genuinely fun to use while also being accurate.\nBut when does this stop being the cool thing early adopters get because they could or because it was free with their Pixel? The promise of Daydream lies in being able to offer something like View and know that many different phones will be able to use it to access whole worlds of content. None of that is true yet, and buying something because it might one day be what you want it to be is never a good idea.\nShould you buy it? Eventually If you're a Pixel XL owner and want something new, there's a lot to like in this headset. If you recently ditched a Note 7 for the Pixel and are hoping this experience rivals your Gear VR, Daydream View isn't going to fully measure up.\nSee at the Google Store \n",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [
          {
            "name": "hunter",
            "sentiment": "none"
          },
          {
            "name": "harry potter",
            "sentiment": "none"
          },
          {
            "name": "daydream",
            "sentiment": "none"
          }
        ],
        "organizations": [
          {
            "name": "google",
            "sentiment": "positive"
          },
          {
            "name": "google cardboard",
            "sentiment": "none"
          },
          {
            "name": "sde",
            "sentiment": "none"
          },
          {
            "name": "valve",
            "sentiment": "none"
          },
          {
            "name": "hbo",
            "sentiment": "none"
          },
          {
            "name": "google store",
            "sentiment": "none"
          },
          {
            "name": "google pixel",
            "sentiment": "none"
          },
          {
            "name": "google daydream view full",
            "sentiment": "none"
          },
          {
            "name": "daydream view",
            "sentiment": "none"
          },
          {
            "name": "cardboard camera",
            "sentiment": "none"
          },
          {
            "name": "pixel",
            "sentiment": "none"
          },
          {
            "name": "youtube",
            "sentiment": "none"
          },
          {
            "name": "google daydream view bottom",
            "sentiment": "none"
          },
          {
            "name": "ccp",
            "sentiment": "none"
          },
          {
            "name": "netflix",
            "sentiment": "none"
          },
          {
            "name": "htc",
            "sentiment": "none"
          },
          {
            "name": "samsung",
            "sentiment": "none"
          }
        ],
        "locations": []
      },
      "crawled": "2016-11-10T16:02:18.494+02:00"
    },
    {
      "thread": {
        "uuid": "f3987975d3a1e45a48af6c7c73c9fed852824001",
        "url": "http://omgili.com/ri/jHIAmI4hxg8v3BmVd24meuL1ei1Bo_4W6vZZ6OBl9yEP.KlnxfLrTL7Lhdgkpbef9r4aOMERxeoNWqlv4ng4ZA--",
        "site_full": "www.businessinsider.com",
        "site": "businessinsider.com",
        "site_section": "http://www.businessinsider.com/sai/rss",
        "site_categories": [
          "news"
        ],
        "section_title": "Tech Insider",
        "title": "This new $400 phone is as strong as the Google Pixel — for $250 less",
        "title_full": "This new $400 phone is as strong as the Google Pixel — for $250 less",
        "published": "2016-11-10T16:09:24.580+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "blogs",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "http://static1.businessinsider.com/image/58235522691e882a4e8b4f95-1190-625/this-new-400-phone-is-as-strong-as-the-google-pixel--for-250-less.jpg",
        "performance_score": 2,
        "domain_rank": 283,
        "social": {
          "facebook": {
            "likes": 224,
            "comments": 0,
            "shares": 224
          },
          "gplus": {
            "shares": 2
          },
          "pinterest": {
            "shares": 1
          },
          "linkedin": {
            "shares": 3
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "f3987975d3a1e45a48af6c7c73c9fed852824001",
      "url": "http://omgili.com/ri/jHIAmI4hxg8v3BmVd24meuL1ei1Bo_4W6vZZ6OBl9yEP.KlnxfLrTL7Lhdgkpbef9r4aOMERxeoNWqlv4ng4ZA--",
      "ord_in_thread": 0,
      "author": "Jeff Dunn",
      "published": "2016-11-10T16:09:24.580+02:00",
      "title": "This new $400 phone is as strong as the Google Pixel — for $250 less",
      "text": "print \nThe LeEco LePro 3. Business Insider/Jeff Dunn The best thing to happen to smartphones this year has nothing to do with dual cameras or Google hardware .\nInstead, it’s the increasingly heated competition in the price tier just below the iPhone 7s , Galaxy S7s , and Google Pixels of the world. Specs and features that were once exclusive to phones that cost close to $700 are now freely available in devices that cost $300 less. \nA handful of Chinese companies have led the charge. You won’t find the $400 OnePlus 3 , ZTE Axon 7 , or Huawei Honor 8 on a carrier store shelf, but in terms of pure horsepower, there’s very little separating them from the higher-priced flagships you see on TV. They look nice, too. \nNow, you can add another to the list. The LeEco LePro 3 is the first phone to hit the US from Chinese (not French!) tech conglomerate LeEco, and makes it even harder for every company not named Apple, Samsung, or Google to sell a phone for more than $400. \nIt’s also not going to be the hit LeEco wants — and possibly needs . Let’s take a closer look. Let's start with what's good about the LeEco LePro 3. For one, it's fast and powerful. Hollis Johnson \nThe LePro 3 is among the strongest phones in the world, full stop. It runs on Qualcomm’s latest Snapdragon 821 processor, with 4GB of RAM and 64GB of storage. The 821 chip isn’t a big leap over its predecessor, but it’s clocked high enough here to make the phone consistently quick and fluid. \nWe’ve long passed the point of diminishing returns when it comes to comfortable smartphone performance, but even with that in mind, the LePro 3 handled anything I threw at it with ease. Games ran smoothly, apps loaded quickly, and multitasking was a snap. \nThe back got a little toasty after playing a new, graphics-heavy game like “Deus Ex Go,” but all told this is a powerhouse. \nBenchmark testing mostly backed this up. The LePro 3 scored a 4,339 in Geekbench 4, which measures overall system performance. That was higher than both the Google Pixel (4,146) and OnePlus 3 (4,015). \nOn a graphics test like 3DMark’s Sling Shot, it got a 2,585, again higher than the Pixel (2,518) and OnePlus (2,469). \nAre these huge differences? No. But the point is you get high-end power at a midrange price. Its build is smooth, sturdy, and solid. Hollis Johnson \nThe LePro 3 is better designed than the Google Pixel. It’s got a chilly coat of brushed aluminum on its back, and a smooth layer of glass on its front. Both feel great. On both sides, its top and bottom are near-perfectly symmetrical. Nothing about it is loose or cheap — all the buttons are responsive and easy to reach, and though it’s a bit on the hefty side, that helps it feel like something substantial. \nThe LePro 3 is big, and thus not easily usable with one hand, but it’s not wasteful. While the Pixel and the iPhone have uselessly large bezels, the LePro 3 keeps things relatively slim. More importantly, it actually makes use of that bottom bezel, putting a trio of capacitive buttons there instead of chewing up room on screen. Those buttons are in the wrong order — the back button is on the right instead of the left — but it’s a net positive. \nAs far as features go, there’s a fast charging USB-C port on its bottom, decent-but-not-great dual speakers on its front, an IR blaster on its top (if you ever feel like using it as a TV remote), and a large fingerprint scanner on its back. That scanner isn’t as fast as what’s on other devices, but it’s in a comfortable spot, and it works well enough. \nThe caveat? It looks like a carbon copy of the OnePlus 3. In general, there’s little that’s visually distinct about it. But in my two weeks of testing, everyone else who got a hold of it thought it felt nice. I agree. Battery life is good. Hollis Johnson \nInside that aluminum frame is a 4,070mAh battery. That’s really big. Common wisdom would suggest a battery that large might bring a couple days of battery life — especially without a super high-resolution display — but LePro 3 isn’t that efficient. \nStill, it’s good: I got around 9-10 hours of juice with an average mix of web browsing, video viewing, and sporadic game playing. It just needs the extra weight to get there. \nThe display is pleasant. Hollis Johnson \nThis is a 5.5-inch screen with a 1080p resolution. That means it’s not as sharp as the 2560x1440 resolution panels available elsewhere, but any difference is barely noticeable. \nMore significantly, this is an LED display, not the more vibrant and colorful OLED kind that’s on the Pixel or Galaxy S7. Nevertheless, its colors are relatively accurate, it doesn’t wash out at an angle, and the whole thing can get very bright. It’s not the best, but it shouldn’t bring many complaints. Now onto what's bad about the LePro 3. Above all else, LeEco's Android skin is baffling. What EUI's recent apps and quick settings menu looks like. Business Insider/Yu Han \nMuch like Huawei, LeEco slathers Google’s “stock” Android — here version 6.0.1 Marshmallow, not the latest 7.0 Nougat — with a ton of modifications. And once again, that skin, called \"EUI,\" hogs a lot of memory, while making few obvious changes for the better. \nFor starters, there’s no app drawer. Instead, like iOS, you have to clutter your home screen with folders, or stuff apps onto other screens altogether. Swiping down on the home screen presents your notifications, but not quick settings for WiFi, Bluetooth, and so on. \nInstead, those are stuffed on a separate screen with your open tabs, which you access by hitting the recents button. Visually, the icons for LeEco’s stock apps are flatter and rounder than those from Google, which creates more disconnect. It goes on and on. \nThe biggest offenders, though, are LeEco’s video apps. A taste of the Le video app. Business Insider/Yu Han \nSince LeEco wants the LePro 3 to be just one part of a larger ecosystem of apps and devices, it preloads three different services: You can swipe right on the homescreen to get a Flipboard-like “LeView” feed, open the “Le” app, or click the “Live” button that is permanently attached to the home screen. Each one works in various ways, and looks fine, but are there whether you want them or not. \nThat could be forgivable if the videos themselves were any good, but they’re really, really not. Here are a few things that were promoted to me during my time with the LePro 3: \"The Pink Panther 2, Chairman of the Board\" (featuring Carrot Top), \"Snake Eater II: The Drug Buster\" (featuring Lorenzo Lamas), and a video about Rihanna’s style at the VMAs over the years. \nI’m cherry picking, yes, but it really doesn’t get much better. LeEco has one significant content partner in Lionsgate. Will they get more? Given its reported cash crunch, I can’t say. There’s no headphone jack, for no reason. Hollis Johnson \nThe iPhone 7 has been out for two months now, and the world seems to have gotten over its headphone jack hysteria . That’s good. The decision still makes no sense, though. Wireless headphones sound worse and cost more. Most people do not buy them because of that. \nApple taking the jack away at least has some merit — a handful of Lightning headphones already exist. Very few USB-C headphones do, though. LeEco packs a pair of EarPods-aping earbuds in the box, but they’re nothing worthwhile. More likely is you’ll use the included dongle. Have fun keeping track of that. There’s also no water resistance, or a microSD slot. Hollis Johnson \nAs with the Pixel, you’ll want to keep the LePro 3 away from pools and faucets. There’s also no way to expand the storage. Those omissions are a little more excusable with the LePro 3, since it’s cheaper and roomier by default, but especially when it comes to water resistance, they’re things it really ought to have if it wants to be considered a leading phone in 2016. The camera is okay, but nothing special. A sample shot with the LePro 3's camera. Note that I had to compress the file for the Web — but you get the idea. Business Insider/Jeff Dunn \nMore and more, the thing that separates the good phones from the great ones is the camera. The iPhone 7’s, Galaxy S7’s, and Pixel’s are great. The OnePlus 3’s is good. The LePro 3’s 16-megapixel shooter is fine. It’s not terribly slow, and in the right light, it’s capable of some pretty shots, like the one above. Any phone worth its salt can nail an easy setup, though. When things get more challenging, particularly at night, the LePro 3 struggles with the lack of light and fudges up details. So you get stuff like this: Business Insider/Jeff Dunn \nAgain, for $400, it’s not bad. But its rivals do a better job with detail, richness, shadows, and speed. You’re also never going to find this thing. Jia Yueting, co-founder and head of LeEco. REUTERS/Jason Lee \nI mean, you can . It’s right there on LeEco’s ecommerce site . Go ask your friends if they plan on visiting LeMall.com, though, and chances are you’ll get some blank stares. That the phone doesn’t support CDMA networks (i.e., Verizon and Sprint) is rough, too. \nIf you want it, you’ll have to buy unlocked, and bring it to a GSM carrier like T-Mobile or AT&T. Time and again, the vast majority of Americans have proven they don't do that. So, should I buy it? Hollis Johnson \nIt’s a testament to just how good midrange phones have become that I can’t recommend the LePro 3 outright. Two years ago, it would’ve been a revelation. It’s got the fastest Snapdragon chip on the market! For $400! \nBut as smartphones have become commoditized, fast hardware has become less and less special. What a high-end phone needs now is clean, cohesive software, and a stellar camera. In both of those cases, the OnePlus 3 is better, while remaining close enough in almost every other aspect. \nTry as LeEco might to make itself a thing, the LePro 3 isn’t that different than any other phone from a Chinese manufacturer going after the US. For now, the OnePlus is still the pick at $400.",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [
          {
            "name": "jia yueting",
            "sentiment": "none"
          },
          {
            "name": "lorenzo lamas",
            "sentiment": "none"
          },
          {
            "name": "dunn",
            "sentiment": "none"
          },
          {
            "name": "carrot top",
            "sentiment": "none"
          },
          {
            "name": "reuters/jason lee",
            "sentiment": "none"
          },
          {
            "name": "hollis johnson",
            "sentiment": "none"
          },
          {
            "name": "rihanna",
            "sentiment": "none"
          }
        ],
        "organizations": [
          {
            "name": "google",
            "sentiment": "positive"
          },
          {
            "name": "zte axon",
            "sentiment": "none"
          },
          {
            "name": "verizon",
            "sentiment": "none"
          },
          {
            "name": "google pixel",
            "sentiment": "none"
          },
          {
            "name": "leeco",
            "sentiment": "none"
          },
          {
            "name": "apple",
            "sentiment": "none"
          },
          {
            "name": "eui",
            "sentiment": "none"
          },
          {
            "name": "t-mobile",
            "sentiment": "none"
          },
          {
            "name": "at&t",
            "sentiment": "none"
          },
          {
            "name": "huawei",
            "sentiment": "none"
          },
          {
            "name": "vmas",
            "sentiment": "none"
          },
          {
            "name": "geekbench",
            "sentiment": "none"
          },
          {
            "name": "sprint",
            "sentiment": "none"
          },
          {
            "name": "samsung",
            "sentiment": "none"
          },
          {
            "name": "qualcomm",
            "sentiment": "none"
          }
        ],
        "locations": [
          {
            "name": "us",
            "sentiment": "none"
          },
          {
            "name": "lionsgate",
            "sentiment": "none"
          }
        ]
      },
      "crawled": "2016-11-10T16:09:24.580+02:00"
    },
    {
      "thread": {
        "uuid": "e74697fdb376e702bf2aa79f0f12fe24f286490f",
        "url": "http://omgili.com/ri/jHIAmI4hxg.aX6RsjGyewe2esD1hjPoJwlIc6X0Lo1r6LuQn1H4SZcVg5dFEFN3hqXaGjCFtohI-",
        "site_full": "www.androidcentral.com",
        "site": "androidcentral.com",
        "site_section": "http://www.androidcentral.com/",
        "site_categories": [
          "news",
          "tech"
        ],
        "section_title": "Android Central - Android Forums, News, Reviews, Help and Android Wallpapers",
        "title": "Best Calendar Apps for Android",
        "title_full": "Best Calendar Apps for Android",
        "published": "2016-11-11T23:12:17.518+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "blogs",
        "country": "US",
        "spam_score": 0.0,
        "main_image": null,
        "performance_score": 7,
        "domain_rank": 1053,
        "social": {
          "facebook": {
            "likes": 728,
            "comments": 0,
            "shares": 728
          },
          "gplus": {
            "shares": 118
          },
          "pinterest": {
            "shares": 2
          },
          "linkedin": {
            "shares": 9
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "e74697fdb376e702bf2aa79f0f12fe24f286490f",
      "url": "http://omgili.com/ri/jHIAmI4hxg.aX6RsjGyewe2esD1hjPoJwlIc6X0Lo1r6LuQn1H4SZcVg5dFEFN3hqXaGjCFtohI-",
      "ord_in_thread": 0,
      "author": "Marc Lagace",
      "published": "2016-11-11T23:12:17.518+02:00",
      "title": "Best Calendar Apps for Android",
      "text": "\nFor simplicity, power and the best integration with various calendar sources, Google Calendar is the way to go.\nBest overall Google Calendar \nSee on Google Play \nGoogle's own calendar app has been refined over the years to a point where it's both elegant and functional. And it's not just for Google stored calendars, either, with support for \"all calendars on your phone, including Exchange.\"\nSome of the nifty features on hand include a schedule view with photos and maps of places you'll be heading to, smart suggestions on places, people and the ability to create calendar events based on reservations for things like flights and restaurants that appear in your Gmail inbox.\nIf it didn't already come pre-loaded on your phone, you can get it for free.\nBottom Line : If you're looking for a calendar that covers all the bases then Google Calendar is a top pick.\nOne More Thing : Google Calendar also jives well with Google Assistant, making it an especially good choice if you've got a Pixel or Pixel XL.\nWhy Google Calendar is the best Sometimes stock is more than enough. Google's calendar app is more than capable to handle all your scheduling needs, while keeping things simple and clean.\nWith the power of Google behind it, this app is smart enough to suggest titles, contacts and places as you type in your event information. It will also automatically scan your Gmail and add reservations for flights, restaurants and more if you allow permission for it. Essentially, if you've enjoyed using other Google products and apps, you'll be more than happy with everything that Google has included here.\nBest for email integration Microsoft Outlook \nSee on Google Play \nNot the first app you might think of when looking for a calendar, but the truth is that Microsoft Outlook on Android is really good. It combines your email, including Gmail, and calendars, including Google, inside one app so you can manage both in one hit.\nMicrosoft recently acquired the hugely popular Sunrise Calendar, and it has been fold into its Outlook apps. That combination of Sunrise smarts and Outlook power has produced something worth checking out.\nBottom-line : Microsoft Outlook is a good option if you want to access your email and calendar all in one place.\nOne more thing : Event icons are just one of the features that the Sunrise team has brought into the fold. Try typing \"coffee\" or \"lunch\" the next time you create an event and just see what happens in your agenda view.\nBest design SolCalendar \nSee on Google Play \nSolCalendar is described as a \"life management tool\" and it's not far from the truth. Besides a whole bunch of different calendars, Sol will pull in weather reports, sync with Google Tasks, supports Google Maps and Foursquare integrations, Lunar Calendars and more.\nAnd it's all wrapped up into an elegant and intuitive user experience that also boasts some fancy looking home screen widgets, too.\nBottom-line : SolCalendar features a beautiful design and is considered one of the best alternatives to Google Calendar.\nOne more thing : Use stickers to add some fun flair to your calendar.\nBest overall Google Calendar \nSee on Google Play \nGoogle's own calendar app has been refined over the years to a point where it's both elegant and functional. And it's not just for Google stored calendars, either, with support for \"all calendars on your phone, including Exchange.\"\nSome of the nifty features on hand include a schedule view with photos and maps of places you'll be heading to, smart suggestions on places, people and the ability to create calendar events based on reservations for things like flights and restaurants that appear in your Gmail inbox.\nIf it didn't already come pre-loaded on your phone, you can get it for free.\nBottom Line : If you're looking for a calendar that covers all the bases then Google Calendar is a top pick.\nOne More Thing : Google Calendar also jives well with Google Assistant, making it an especially good choice if you've got a Pixel or Pixel XL.\n",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [],
        "organizations": [
          {
            "name": "google",
            "sentiment": "positive"
          },
          {
            "name": "google tasks",
            "sentiment": "none"
          },
          {
            "name": "microsoft",
            "sentiment": "none"
          },
          {
            "name": "google calendar",
            "sentiment": "none"
          }
        ],
        "locations": []
      },
      "crawled": "2016-11-11T23:12:17.518+02:00"
    },
    {
      "thread": {
        "uuid": "90ca4f191b2dd8e583a7a07d0e4b9dc57eeb2f36",
        "url": "http://omgili.com/ri/jHIAmI4hxg8w7niuyAyflFlwVidy6u4LWc7pOgkaVR23fNs16W9cpT_he7oy7VoCaqCb_3py.TvN3alCpwU9hjQ86iIJktUUHyE9dXpyQHtf2LjdbFd6e_dY_cJrUHOXaQQvCEqQeZD9z2dZMBHX9vHGn1beZKb06TWeQVbDz7mxkOPWKskYLw--",
        "site_full": "www.bostonglobe.com",
        "site": "bostonglobe.com",
        "site_section": "http://www.bostonglobe.com/",
        "site_categories": [
          "news"
        ],
        "section_title": "The Boston Globe",
        "title": "Trump describes Clinton as ‘very strong and very smart’",
        "title_full": "Trump describes Clinton as ‘very strong and very smart’ - The Boston Globe",
        "published": "2016-11-11T02:00:00.000+02:00",
        "replies_count": 11,
        "participants_count": 9,
        "site_type": "news",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "http://www.bostonglobe.com/rf/image_585w/Boston/2011-2020/2016/11/12/BostonGlobe.com/National/Images/accd3043078e4a95a21aac41a89c0213-53b534d0a8a341cb80d677f21b2c7475-0.jpg",
        "performance_score": 1,
        "domain_rank": 2402,
        "social": {
          "facebook": {
            "likes": 144,
            "comments": 0,
            "shares": 144
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "90ca4f191b2dd8e583a7a07d0e4b9dc57eeb2f36",
      "url": "http://omgili.com/ri/jHIAmI4hxg8w7niuyAyflFlwVidy6u4LWc7pOgkaVR23fNs16W9cpT_he7oy7VoCaqCb_3py.TvN3alCpwU9hjQ86iIJktUUHyE9dXpyQHtf2LjdbFd6e_dY_cJrUHOXaQQvCEqQeZD9z2dZMBHX9vHGn1beZKb06TWeQVbDz7mxkOPWKskYLw--",
      "ord_in_thread": 0,
      "author": "bostonglobe",
      "published": "2016-11-11T02:00:00.000+02:00",
      "title": "Trump describes Clinton as ‘very strong and very smart’",
      "text": " Google+\nAP Photo/Molly Riley\nPresident-elect Donald Trump, accompanied by his wife Melania, speaks to the media on Capitol Hill on Thursday.\nBy Danny McDonald Globe Staff November 12, 2016\nPresident-elect Donald Trump said he is open to keeping aspects of President Obama’s signature health care program, and referred to Hillary Clinton as “very strong and very smart,” in a preview of a “60 Minutes” interview that is scheduled to air Sunday.\nIn the clip, Trump spoke about receiving the concession call from Clinton. After one of the most contentious presidential campaigns in recent memory, Trump had nothing but kind words for his Democratic rival.\nAdvertisement\n“She couldn’t have been nicer,” he said of their phone conversation. “She just said, ‘Congratulations, Donald, well done.’ ”\nThe president-elect also received a congratulatory call from Bill Clinton. Trump, who had barbed and personal criticism for the former president during the campaign, said he now would be open to calling him for advice.\nGet Breaking News in your inbox: Sign Up Thank you for signing up! Sign up for more newsletters here “He couldn’t have been more gracious,” Trump said. “He said it was an amazing run. One of the most amazing he’s ever seen.”\nTrump also said his health care plan would ensure that people with preexisting medical conditions would still receive coverage. He also indicated “children living with their parents for an extended period” would continue to be covered under his plan.\n“It adds cost, but it’s very much something we’re going to try and keep,” he told CBS’s Lesley Stahl.\nAdvertisement\nHe denied that there would be a period under his administration where millions would be without health insurance, saying he planned to repeal and replace the Affordable Care Act simultaneously.\n“It’ll be great health care for much less money,” he said.\nWatch the full “60 Minutes” preview clip here:\nDanny McDonald can be reached at daniel.mcdonald@globe.com . Follow him on Twitter @dmc_bos",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [
        "http://twitter.com/intent/tweet?text=Trump",
        "http://www.linkedin.com/shareArticle?mini=true&url=http%3A%2F%2Fwww.bostonglobe.com%2Fnews%2Fnation%2F2016%2F11%2F11%2Ftrump-describes-clinton-very-strong-and-very-smart%2FJuPv6WEqikCnITg6LlnRzL%2Fstory.html%3Fevent%3Devent25&title=Trump",
        "http://www.facebook.com/sharer.php?u=http%3A%2F%2Fwww.bostonglobe.com%2Fnews%2Fnation%2F2016%2F11%2F11%2Ftrump-describes-clinton-very-strong-and-very-smart%2FJuPv6WEqikCnITg6LlnRzL%2Fstory.html%3Fevent%3Devent25%3Fevent%3Devent25&tTrump",
        "http://www.facebook.com/sharer.php?u=http%3A%2F%2Fwww.bostonglobe.com%2Fnews%2Fnation%2F2016%2F11%2F11%2Ftrump-describes-clinton-very-strong-and-very-smart%2FJuPv6WEqikCnITg6LlnRzL%2Fstory.html%3Fevent%3Devent25&t=Trump",
        "https://plus.google.com/share?url=http%3A%2F%2Fwww.bostonglobe.com%2Fnews%2Fnation%2F2016%2F11%2F11%2Ftrump-describes-clinton-very-strong-and-very-smart%2FJuPv6WEqikCnITg6LlnRzL%2Fstory.html%3Fevent%3Devent25%26s_campaign%3dsm_gp%26hl=en-US",
        "http://twitter.com/dmc_bos",
        "http://www.cbsnews.com/common/video/cbsnews_video.swf",
        "http://www.cbsnews.com/videos/donald-trump-shifts-position-on-obamacare-in-60-minutes-interview"
      ],
      "entities": {
        "persons": [
          {
            "name": "donald trump",
            "sentiment": "positive"
          },
          {
            "name": "clinton",
            "sentiment": "positive"
          },
          {
            "name": "melania",
            "sentiment": "positive"
          },
          {
            "name": "riley",
            "sentiment": "positive"
          },
          {
            "name": "trump",
            "sentiment": "positive"
          },
          {
            "name": "lesley stahl",
            "sentiment": "none"
          },
          {
            "name": "hillary clinton",
            "sentiment": "none"
          },
          {
            "name": "donald",
            "sentiment": "none"
          },
          {
            "name": "danny mcdonald",
            "sentiment": "none"
          },
          {
            "name": "bill clinton",
            "sentiment": "none"
          },
          {
            "name": "obama",
            "sentiment": "none"
          },
          {
            "name": "danny",
            "sentiment": "none"
          }
        ],
        "organizations": [
          {
            "name": "google",
            "sentiment": "positive"
          },
          {
            "name": "mcdonald globe",
            "sentiment": "none"
          },
          {
            "name": "cbs",
            "sentiment": "none"
          }
        ],
        "locations": [
          {
            "name": "capitol hill",
            "sentiment": "none"
          }
        ]
      },
      "crawled": "2016-11-12T09:29:39.620+02:00"
    },
    {
      "thread": {
        "uuid": "efeee7aadd47b8281a14a2fa00a6432d130a13f8",
        "url": "http://omgili.com/ri/jHIAmI4hxg.aX6RsjGyewe2esD1hjPoJWUXFNz2VnL05mvGrZSC.f..RwL7F695CChCNITOZxIEVvsnjB1ZRV6cqLLQPlA_ccdmOemJDXG4moNCFX7ngew--",
        "site_full": "www.androidcentral.com",
        "site": "androidcentral.com",
        "site_section": "http://www.androidcentral.com/",
        "site_categories": [
          "news",
          "tech"
        ],
        "section_title": "Android Central - Android Forums, News, Reviews, Help and Android Wallpapers",
        "title": "Android Central 314: OK Google, Home is a good start",
        "title_full": "Android Central 314: OK Google, Home is a good start",
        "published": "2016-11-13T18:00:24.407+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "blogs",
        "country": "US",
        "spam_score": 0.0,
        "main_image": null,
        "performance_score": 1,
        "domain_rank": 1053,
        "social": {
          "facebook": {
            "likes": 113,
            "comments": 0,
            "shares": 113
          },
          "gplus": {
            "shares": 8
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "efeee7aadd47b8281a14a2fa00a6432d130a13f8",
      "url": "http://omgili.com/ri/jHIAmI4hxg.aX6RsjGyewe2esD1hjPoJWUXFNz2VnL05mvGrZSC.f..RwL7F695CChCNITOZxIEVvsnjB1ZRV6cqLLQPlA_ccdmOemJDXG4moNCFX7ngew--",
      "ord_in_thread": 0,
      "author": "Daniel Bader",
      "published": "2016-11-13T18:00:24.407+02:00",
      "title": "Android Central 314: OK Google, Home is a good start",
      "text": "In this episode, Alex, Andrew, Jerry and Daniel talk about the post-Pixel releases of the year: Google Home , Chromecast Ultra , Daydream , and the new (and improved) Android Auto ! There's so much to like, but many of the feature feel like half-measures.\nAlso, Nougat is on the verge of getting released broadly, other than the Pixel and a couple recent phones you won't find it beyond beta.\nFinally, the Mate 9 is coming soon, but did Huawei do enough to make EMUI usable? Oh, and the HTC Bolt — a Sprint exclusive, but also a good indication of HTC's carrier-focused future.\nPodcast MP3 URL:  http://traffic.libsyn.com/androidcentral/androidcentral314.mp3 ",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [
          {
            "name": "andrew",
            "sentiment": "positive"
          },
          {
            "name": "daniel",
            "sentiment": "positive"
          },
          {
            "name": "jerry",
            "sentiment": "positive"
          },
          {
            "name": "alex",
            "sentiment": "positive"
          }
        ],
        "organizations": [
          {
            "name": "google",
            "sentiment": "positive"
          },
          {
            "name": "huawei",
            "sentiment": "none"
          },
          {
            "name": "sprint",
            "sentiment": "none"
          },
          {
            "name": "htc",
            "sentiment": "none"
          }
        ],
        "locations": []
      },
      "crawled": "2016-11-13T18:00:24.407+02:00"
    },
    {
      "thread": {
        "uuid": "ad3352e461bddb9980b61f77ac6736bf17a00d49",
        "url": "http://omgili.com/ri/.wHSUbtEfZRRQZhcsRBp_oZNt94t8VAyHy7ElD7LO_NUY0Pryd.CkKRPLLxpEtquOI9Z5AFWlXA-",
        "site_full": "dribbble.com",
        "site": "dribbble.com",
        "site_section": "http://feeds.feedburner.com/webdesignernews",
        "site_categories": [
          "business"
        ],
        "section_title": "WebdesignerNews",
        "title": "Google redesign concept",
        "title_full": "Google redesign concept",
        "published": "2016-11-13T23:25:21.001+02:00",
        "replies_count": 0,
        "participants_count": 0,
        "site_type": "blogs",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "https://d13yacurqjgara.cloudfront.net/users/156946/screenshots/3087160/google_redesign7.png",
        "performance_score": 1,
        "domain_rank": 1758,
        "social": {
          "facebook": {
            "likes": 167,
            "comments": 0,
            "shares": 167
          },
          "gplus": {
            "shares": 1
          },
          "pinterest": {
            "shares": 20
          },
          "linkedin": {
            "shares": 21
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "ad3352e461bddb9980b61f77ac6736bf17a00d49",
      "url": "http://omgili.com/ri/.wHSUbtEfZRRQZhcsRBp_oZNt94t8VAyHy7ElD7LO_NUY0Pryd.CkKRPLLxpEtquOI9Z5AFWlXA-",
      "ord_in_thread": 0,
      "author": "",
      "published": "2016-11-13T23:25:21.001+02:00",
      "title": "Google redesign concept",
      "text": "Hello everyone, this is something I did just for fun. don't forget to check the real pixels and let me know your thought. \nHope you like it. Press \"L\" on your keyboard if you do, and follow me if you don't want to miss some upcoming work.",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [],
        "organizations": [
          {
            "name": "google",
            "sentiment": "positive"
          }
        ],
        "locations": []
      },
      "crawled": "2016-11-13T23:25:21.001+02:00"
    },
    {
      "thread": {
        "uuid": "f1afc9f4feade74cf6be25c4f4a9e7904fa60a46",
        "url": "http://omgili.com/ri/snFTpiOKdJWKdIMIpzFquLBqypSJeWvj9m9CujkMCVVd6u62ENRVqjNi3Pezb4UzhHzp829ck1yZ_ySLCaB5AAWghSDZ1aHLY6dq5r7Y18o-",
        "site_full": "nypost.com",
        "site": "nypost.com",
        "site_section": "http://feeds.feedburner.com/google/CGSe",
        "site_categories": [
          "news"
        ],
        "section_title": "google news - Google News",
        "title": "Google's new music service knows how you feel - New York Post",
        "title_full": "Google's new music service knows how you feel - New York Post",
        "published": "2016-11-14T08:12:11.461+02:00",
        "replies_count": 0,
        "participants_count": 0,
        "site_type": "news",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "http://thenypost.files.wordpress.com/2015/08/file_britain_usa_google_alphabet.jpg?quality=90&amp;strip=all&amp;w=1200",
        "performance_score": 1,
        "domain_rank": 709,
        "social": {
          "facebook": {
            "likes": 161,
            "comments": 0,
            "shares": 161
          },
          "gplus": {
            "shares": 22
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 136
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "f1afc9f4feade74cf6be25c4f4a9e7904fa60a46",
      "url": "http://omgili.com/ri/snFTpiOKdJWKdIMIpzFquLBqypSJeWvj9m9CujkMCVVd6u62ENRVqjNi3Pezb4UzhHzp829ck1yZ_ySLCaB5AAWghSDZ1aHLY6dq5r7Y18o-",
      "ord_in_thread": 0,
      "author": "",
      "published": "2016-11-14T08:12:11.461+02:00",
      "title": "Google's new music service knows how you feel - New York Post",
      "text": "In a funk about the election results? \nThere may be an app to cure your blues. \nBeginning on Monday, streaming music service Google Play Music will relaunch with an unparalleled scare-the-pants-off-you artificial intelligence function that can deliver playlists based on your location, what you are doing — or what mood you are in. \nThanks to its hold on your e-mail, calendars, maps, traffic app and even the motion sensor on your phone, Google can deliver music to get you ready to work out at the gym, ease into a vacation and even pick you up if you’ve been complaining about being blue. \n“Google understands the kind of place you’re at, so home means something different from the gym, a bar, a park or an airport,” Elias Roman, product manager at Google Play Music, told The Post. \n“We understand activity so with device sensors we understand differences between driving, running and biking and weather that drives what we do and what we want to feel like,” said Roman, who sold intelligent streaming service Songza to Google in 2014. \nThe relaunched streaming service, with its spooky smart AI, is aimed at “making people feel how they want to feel.” \nIn addition, Google Play Music understands what is called characteristic popularity — which means it knows what the people in your city are listening to and can serve up similar music. \nIf it sounds too intrusive, Google points out that you have to opt in to the suped-up features. \nPlay Music is free with advertising or is $9.99 per month for ad-free service and the ability to play music offline. \nIt also includes access to Google’s other paid music service YouTube Red, for video exclusives. Share this:",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [
          {
            "name": "elias roman",
            "sentiment": "none"
          }
        ],
        "organizations": [
          {
            "name": "google",
            "sentiment": "positive"
          },
          {
            "name": "youtube red",
            "sentiment": "none"
          },
          {
            "name": "post",
            "sentiment": "none"
          }
        ],
        "locations": [
          {
            "name": "new york",
            "sentiment": "none"
          }
        ]
      },
      "crawled": "2016-11-14T08:12:11.461+02:00"
    },
    {
      "thread": {
        "uuid": "fb2a7ff8eb8a3e485c151b103f774e170bf711fe",
        "url": "http://omgili.com/ri/jHIAmI4hxg8i33GP88oLA8k7FhyHXp4nvELxhmASeA3BDPULmISpxRKXcwZnpn1GOT4MswZ9lIvgFX9x5gmXka14S9V8CxMUWnqmzchrxmYLEvvYnUsYRw--",
        "site_full": "www.xda-developers.com",
        "site": "xda-developers.com",
        "site_section": "http://www.xda-developers.com",
        "site_categories": [
          "tech"
        ],
        "section_title": "xda-developers",
        "title": "Google Brings Machine Learning to Google Play Music",
        "title_full": "Google Brings Machine Learning to Google Play Music",
        "published": "2016-11-14T17:34:34.593+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "blogs",
        "country": "US",
        "spam_score": 0.0,
        "main_image": null,
        "performance_score": 3,
        "domain_rank": 544,
        "social": {
          "facebook": {
            "likes": 339,
            "comments": 0,
            "shares": 339
          },
          "gplus": {
            "shares": 2
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 2
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "fb2a7ff8eb8a3e485c151b103f774e170bf711fe",
      "url": "http://omgili.com/ri/jHIAmI4hxg8i33GP88oLA8k7FhyHXp4nvELxhmASeA3BDPULmISpxRKXcwZnpn1GOT4MswZ9lIvgFX9x5gmXka14S9V8CxMUWnqmzchrxmYLEvvYnUsYRw--",
      "ord_in_thread": 0,
      "author": "Doug Lynch",
      "published": "2016-11-14T17:34:34.593+02:00",
      "title": "Google Brings Machine Learning to Google Play Music",
      "text": "Google has just announced a brand new update to their music streaming service, Google Play Music. The new design and features will begin rolling out to Android, iOS and the web starting this week, and Google says it will be made available to 62 countries around the world.\nAs with most of these app updates though, it will be rolled out gradually to users. So, you can either wait patiently for the update to be pushed to your device, or you can sideload the update when it becomes available.\nThe first thing you’ll notice about this update is its new design. Google wanted to make the application easier to use so it redesigned the home page. So as soon as you launch the Google Play Music application, you’ll be greeted with some personalized suggestions about what it thinks you want to listen to based on what you like. The more you use the service, and the more you tell it what you like and dislike, the more useful this home screen will become.\nPresenting you with music you like isn’t enough for Google though, they wanted to take it a step further. So they have integrated the company’s machine learning technology into the service. This means that it will use other pieces of information (if you agree to it) about you to offer some music. For instance, it can offer you a workout playlist when it detects you are at the gym. Or it can offer you a specific genre that it knows you like to listen to while you’re at work.\nAlso, if you subscribe to the Google Play Music service (by itself or via YouTube Red), then it can prepare an offline playlist based on what you were listening to, just in case you lose connection to the internet.\nSource: The Keyword \n",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [],
        "organizations": [
          {
            "name": "google",
            "sentiment": "positive"
          },
          {
            "name": "google play music google",
            "sentiment": "positive"
          },
          {
            "name": "youtube red",
            "sentiment": "none"
          }
        ],
        "locations": []
      },
      "crawled": "2016-11-14T17:34:34.593+02:00"
    },
    {
      "thread": {
        "uuid": "04f1c738b088d9bb38dbaa1df221eef8a3305002",
        "url": "http://omgili.com/ri/jHIAmI4hxg.aX6RsjGyewXaF650x_J7FQ3_xTZytttT1JyN1F4JPBYSY2T2MjEHkpazGqtX9i8GOJ23b85WAQBr88OqiHfe1aNHQUfF38Zt9HkUcC_CaoA--",
        "site_full": "www.androidauthority.com",
        "site": "androidauthority.com",
        "site_section": "http://www.androidauthority.com",
        "site_categories": [
          "news",
          "tech"
        ],
        "section_title": "Android Authority",
        "title": "Google reveals RAISR: an image enhancement tech which uses machine learning",
        "title_full": "Google reveals RAISR: an image enhancement tech which uses machine learning",
        "published": "2016-11-15T13:05:09.170+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "blogs",
        "country": "US",
        "spam_score": 0.0,
        "main_image": null,
        "performance_score": 5,
        "domain_rank": 1848,
        "social": {
          "facebook": {
            "likes": 533,
            "comments": 0,
            "shares": 533
          },
          "gplus": {
            "shares": 26
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 5
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "04f1c738b088d9bb38dbaa1df221eef8a3305002",
      "url": "http://omgili.com/ri/jHIAmI4hxg.aX6RsjGyewXaF650x_J7FQ3_xTZytttT1JyN1F4JPBYSY2T2MjEHkpazGqtX9i8GOJ23b85WAQBr88OqiHfe1aNHQUfF38Zt9HkUcC_CaoA--",
      "ord_in_thread": 0,
      "author": "Scott Adam Gordon",
      "published": "2016-11-15T13:05:09.170+02:00",
      "title": "Google reveals RAISR: an image enhancement tech which uses machine learning",
      "text": "\nGoogle has shared details on a new image enhancement technique it has developed called RAISR. RAISR, or rapid and accurate image super-resolution, incorporates machine learning to produce high-quality versions of low-quality images. \nGoogle Research Scientist Peyman Milanfar explained the technology on the Google research blog and how it differs from existing methods image enhancement methods. While Upsampling, a common way to increase the quality of low-resolution images, relies on fixed values – applying the same effect to every image, RAISR uses a non-linear approach. \nWith RAISR, the team employs “machine learning and train on pairs of images, one low quality, one high, to find filters that, when applied to selectively to each pixel of the low-res image, will recreate details that are of comparable quality to the original,” said Milanfar. \nSee also: Google Photos now allows you to create animations offline 4 days ago Essentially, RAISR uses high-quality images as a benchmark for which its algorithm can identify ways to adjust a low-resolution image. See its effect in the photos below (RAISR’s image enhancement is applied to the bottom one.) \n\nThere’s no indication of how Google might use the technology commercially but Milanfar says that it can be run “on a typical mobile device in real-time.” It seems possible that RAISR could be integrated into Google’s Camera app or an upcoming smartphone. ",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [
          {
            "name": "raisr",
            "sentiment": "positive"
          },
          {
            "name": "peyman milanfar",
            "sentiment": "none"
          },
          {
            "name": "milanfar",
            "sentiment": "none"
          }
        ],
        "organizations": [
          {
            "name": "google",
            "sentiment": "positive"
          },
          {
            "name": "google photos",
            "sentiment": "none"
          },
          {
            "name": "google research scientist",
            "sentiment": "none"
          }
        ],
        "locations": []
      },
      "crawled": "2016-11-15T13:05:09.170+02:00"
    },
    {
      "thread": {
        "uuid": "7b0cd105b2d9fc3bfa860f404136533c8ec208b4",
        "url": "http://omgili.com/ri/jHIAmI4hxg.aX6RsjGyewU2dHfAOSphA._WLPLe80.cXgFsGsfQf.5i4mCBCPonW9H88RpeFH4BicoPg.u_QnoofhiX15eh8WH8jrMupv8RlQpgDfdRYdgvxtL2cZahXXnpQr8tuqEMCKlLYhZpAdg--",
        "site_full": "www.androidpolice.com",
        "site": "androidpolice.com",
        "site_section": "http://feeds.feedburner.com/AndroidPolice",
        "site_categories": [
          "news",
          "entertainment",
          "tech"
        ],
        "section_title": "Android Police – Android News, Apps, Games, Phones, Tablets",
        "title": "Google introduces Neural Machine Translation to Google Translate",
        "title_full": "Google introduces Neural Machine Translation to Google Translate",
        "published": "2016-11-16T00:36:40.530+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "blogs",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "http://www.androidpolice.com/wp-content/uploads/2016/11/nexus2cee_NMT_Blog_900px.width-900-728x441.png",
        "performance_score": 5,
        "domain_rank": 4359,
        "social": {
          "facebook": {
            "likes": 544,
            "comments": 0,
            "shares": 544
          },
          "gplus": {
            "shares": 80
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 3
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "7b0cd105b2d9fc3bfa860f404136533c8ec208b4",
      "url": "http://omgili.com/ri/jHIAmI4hxg.aX6RsjGyewU2dHfAOSphA._WLPLe80.cXgFsGsfQf.5i4mCBCPonW9H88RpeFH4BicoPg.u_QnoofhiX15eh8WH8jrMupv8RlQpgDfdRYdgvxtL2cZahXXnpQr8tuqEMCKlLYhZpAdg--",
      "ord_in_thread": 0,
      "author": "Jordan Palmer",
      "published": "2016-11-16T00:36:40.530+02:00",
      "title": "Google introduces Neural Machine Translation to Google Translate",
      "text": "News \nLanguage is a beautiful thing. Yet, for some, there are large barriers to speaking with natives in other countries. Google Translate has made some strides in overcoming those obstacles in recent years and has always been useful to me as I learn other languages. It's because it is more than just a simple dictionary. So the news announced today that Translate is becoming more powerful and useful with what Google calls Neural Machine Translation is exciting. \nUsually, translated sentences are not always perfect, but they get close enough to be understandable for the native speaker. The reason for the weirdness is that Translate would look at pieces of the sentences, instead of the whole statement, and go from there. When we speak to each other, context is extremely important. With this new technique from Google, the Neural system will analyze the entire sentence to find the broader context so as to provide the best and most relevant translation. From here, it adapts to sound more like a person speaking with proper grammar. \nEight languages are supported right now: English, French, German, Spanish, Portuguese, Chinese, Japanese, Korean, and Turkish. The plan is to implement all remaining forms of communication that you can find in Translate. As a hobbyist linguist, I am quite excited by this news and hope that it expands to the other languages very soon. Source:",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [],
        "organizations": [
          {
            "name": "google",
            "sentiment": "positive"
          },
          {
            "name": "google translate news  language",
            "sentiment": "neutral"
          },
          {
            "name": "neural machine translation",
            "sentiment": "none"
          }
        ],
        "locations": []
      },
      "crawled": "2016-11-16T00:36:40.530+02:00"
    },
    {
      "thread": {
        "uuid": "1e48b58bf6f71593bf76c4ae7cdcd1f7f8f0aedf",
        "url": "http://omgili.com/ri/jHIAmI4hxg.dVl4quv6k4HuQsJyCZPJI2HrlTCM8RkJb0MmjKVC2.e2muaZtsIXetxWPm8z4nzY7rTsUPmROsCf8gaydVifYhxC4ubzpGrLqiGbiUOVwYH8dXokiMciOL5Q7ogp84nY-",
        "site_full": "www.droid-life.com",
        "site": "droid-life.com",
        "site_section": "http://droid-life.com//rss",
        "site_categories": [
          "news",
          "tech"
        ],
        "section_title": "Droid Life",
        "title": "Google Translate Becomes a Neural Machine Translation Boss, Which is Good",
        "title_full": "Google Translate Becomes a Neural Machine Translation Boss, Which is Good | Droid Life",
        "published": "2016-11-15T02:00:00.000+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "blogs",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "http://www.droid-life.com/wp-content/uploads/2016/11/NeuralLearning_Translate_Blog_hires.width-1000.jpg",
        "performance_score": 3,
        "domain_rank": 8301,
        "social": {
          "facebook": {
            "likes": 309,
            "comments": 0,
            "shares": 309
          },
          "gplus": {
            "shares": 18
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 2
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "1e48b58bf6f71593bf76c4ae7cdcd1f7f8f0aedf",
      "url": "http://omgili.com/ri/jHIAmI4hxg.dVl4quv6k4HuQsJyCZPJI2HrlTCM8RkJb0MmjKVC2.e2muaZtsIXetxWPm8z4nzY7rTsUPmROsCf8gaydVifYhxC4ubzpGrLqiGbiUOVwYH8dXokiMciOL5Q7ogp84nY-",
      "ord_in_thread": 0,
      "author": "Kellex",
      "published": "2016-11-15T02:00:00.000+02:00",
      "title": "Google Translate Becomes a Neural Machine Translation Boss, Which is Good",
      "text": "  Google announced a big update to its <a href=\"/tag/google-translate\"><strong>Translate</strong></a> service today that involves Neural Machine Translation. That sounds like some future AI, machine learning science, secretive robotic madness, and it may very well be, but it also means Google Translate is going to get a whole lot better everywhere you use it. <span id=\"more-193736\"></span>\nGoogle explains Neural Machine Translation as a system that “translates whole sentences at a time, rather than just piece by piece.” In other words, Google Translate will use this technology to “help it figure out the most relevant translation, which it then rearranges and adjusts to be more like a human speaking with proper grammar.” Instead of getting a translation that is almost as impossible to read as the language you didn’t needed to translate, the translation should return in a much more natural format for you.\nThat make sense? Take a look at the image above and I’m guessing it will.\nGoogle is calling this improvement the single biggest leap that Translate has “seen in the last ten years combined.” Yep, it’s a big one.\nTo start, Google Translate will Neural Machine Translation to work to and from English and French, German, Spanish, Portuguese, Chinese, Japanese, Korean, and Turkish. Those languages make up for more than 35% of Translate queries, so we’re off to a good start. Google did mention that the goal, as you probably guessed, is to make this magic happen for all 103 supported languages.\nNeural Machine Translation will be available in in the Translate app and website.\n<h6 style=\"text-align: right;\">Via: <a href=\"https://blog.google/products/translate/found-translation-more-accurate-fluent-sentences-google-translate/\" target=\"_blank\">Google</a></h6> </div>",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [],
        "organizations": [
          {
            "name": "google",
            "sentiment": "positive"
          },
          {
            "name": "google translate",
            "sentiment": "none"
          },
          {
            "name": "neural machine translation",
            "sentiment": "none"
          }
        ],
        "locations": []
      },
      "crawled": "2016-11-16T01:50:09.586+02:00"
    },
    {
      "thread": {
        "uuid": "06df572832cf68ab705f6b7de865de2428d9f7b9",
        "url": "http://omgili.com/ri/jHIAmI4hxg.aX6RsjGyewXaF650x_J7FQ3_xTZytttTx7TLDeaDdW9u9nrw55v0cFDur4wxz0kvpXtG_p9HiIbazce1KikGo",
        "site_full": "www.androidauthority.com",
        "site": "androidauthority.com",
        "site_section": "http://www.androidauthority.com",
        "site_categories": [
          "news",
          "tech"
        ],
        "section_title": "Android Authority",
        "title": "Google Allo adds background themes and Smart Smiley feature",
        "title_full": "Google Allo adds background themes and Smart Smiley feature",
        "published": "2016-11-16T19:31:16.157+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "blogs",
        "country": "US",
        "spam_score": 0.0,
        "main_image": null,
        "performance_score": 9,
        "domain_rank": 1848,
        "social": {
          "facebook": {
            "likes": 962,
            "comments": 0,
            "shares": 962
          },
          "gplus": {
            "shares": 15
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "06df572832cf68ab705f6b7de865de2428d9f7b9",
      "url": "http://omgili.com/ri/jHIAmI4hxg.aX6RsjGyewXaF650x_J7FQ3_xTZytttTx7TLDeaDdW9u9nrw55v0cFDur4wxz0kvpXtG_p9HiIbazce1KikGo",
      "ord_in_thread": 0,
      "author": "John Callaham",
      "published": "2016-11-16T19:31:16.157+02:00",
      "title": "Google Allo adds background themes and Smart Smiley feature",
      "text": "\nThe recently launched Google Allo messaging app continues to add new features via updates from the Play Store. The latest version includes a new option that was hinted at a couple of weeks ago in a leak: background themes.\nSee also: Google Allo: Everything you need to know September 21, 2016 Basically, Allo users now have the option to switch from a basic background for their text chats to a variety of different and colorful designs. While this is just a visual change, it certainly will help make chatting more interesting compared to a plain white background.\nGoogle is also adding what the company calls the Smart Smiley button to Allo with this update. The company says that people use less than 3 percent of the emojis that are currently available for chats. The Smart Smiley button is designed to change that. Users can just press on the button while they are typing a message to a friend, and a list of relevant emoji and stickers will appear that can be placed inside the message. Those choices will change based on both the words and sentiment for each text message, and Smart Smiley can even offer suggestions for emojis before you start typing based on the current conversation.\nFinally, Google Allo users can add official stickers based on the upcoming movie “Fantastic Beasts and Where to Find Them”. The film, set in the universe of Harry Potter, debuts in movie theaters on Friday, Nov. 18. What do you think of the new background themes, the Smart Smiley button and the Fantastic Beasts stickers that have been added to Google Allo?\nGet it at Google Play ",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [
          {
            "name": "smiley",
            "sentiment": "none"
          },
          {
            "name": "harry potter",
            "sentiment": "none"
          }
        ],
        "organizations": [
          {
            "name": "google",
            "sentiment": "positive"
          },
          {
            "name": "google allo",
            "sentiment": "positive"
          },
          {
            "name": "smart smiley",
            "sentiment": "none"
          }
        ],
        "locations": []
      },
      "crawled": "2016-11-16T19:31:16.157+02:00"
    },
    {
      "thread": {
        "uuid": "eeb14827c2db35c6ec3c2ca06657f7400f4836c8",
        "url": "http://omgili.com/ri/.wHSUbtEfZQPbtVHNHUoAthDSnAErtdkq52gWYho5eAhE.hZ0Xp8JVeQLTIA0DZiiVpYFAGy5xo-",
        "site_full": "www.cnet.com",
        "site": "cnet.com",
        "site_section": "",
        "site_categories": [
          "news"
        ],
        "section_title": "",
        "title": "Google Earth in VR is a beautiful reminder of how small we are (hands-on) - CNET",
        "title_full": "Google Earth in VR is a beautiful reminder of how small we are (hands-on) - CNET",
        "published": "2016-11-16T07:00:00.000+02:00",
        "replies_count": 0,
        "participants_count": 0,
        "site_type": "news",
        "country": "US",
        "spam_score": 0.001,
        "main_image": "https://cnet3.cbsistatic.com/img/rFKkxmfa7KrW-gTeN1FLMT0VgJo=/670x503/2016/11/16/9d2e5a4a-72a7-42d9-9307-a54f5025864c/earthvrmanhattan-1.png",
        "performance_score": 1,
        "domain_rank": 164,
        "social": {
          "facebook": {
            "likes": 158,
            "comments": 0,
            "shares": 158
          },
          "gplus": {
            "shares": 14
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "eeb14827c2db35c6ec3c2ca06657f7400f4836c8",
      "url": "http://omgili.com/ri/.wHSUbtEfZQPbtVHNHUoAthDSnAErtdkq52gWYho5eAhE.hZ0Xp8JVeQLTIA0DZiiVpYFAGy5xo-",
      "ord_in_thread": 0,
      "author": "Sean Hollister",
      "published": "2016-11-16T07:00:00.000+02:00",
      "title": "Google Earth in VR is a beautiful reminder of how small we are (hands-on) - CNET",
      "text": "\n\"I'm like Godzilla!\" my wife exclaimed, stomping around the room. \n\"Ooh, I'm in Italy!\" she told me, as Florence's famous cathedral appeared in front of her. \n\"That's where my mom's from, and that's where my dad's from,\" she pointed with her wand, as she zoomed across a small portion of the Philippines. \nI'd never seen her quite so interested in virtual reality . \nToday, Google Earth is coming to VR . It's a free download for the HTC Vive headset, and it's a heck of a lot more than just a topographic globe. You can get close enough to fly through cities like Superman, retrace the steps you took during your last vacation, even get an aerial 3D view of your own neighborhood, then grab the sun right out of the sky , spin it around, to see how things look at different times of day or night. \nAnd even though you're flying, you'll probably never feel sick. It's extremely comfortable, which Google engineering lead Dominik Kaeser chalks up to how Google Earth VR makes sure your feet always feel like they're touching the ground. \nGoogle Earth VR. Photo by Google \nHow good it looks depends on how much data Google has collected, though. Google Earth VR hasn't created the world from scratch -- it's using the same blend of satellite, aerial and Street View images as the original Google Earth, just now in a far more immersive experience with way better controls. (Just press the clearly labeled buttons -- you can see the labels in VR! -- and point where you want to go.) \nUnfortunately, that means that just like regular Google Earth, there are plenty of places that don't look so hot. Example: London is an architectural 3D marvel in Google Earth, well worth your time, but just 20 miles west, Windsor Castle is just a hill with some rocks painted on top. \nThis doesn't look much different in Google Earth VR. Photo by Screenshot by Sean Hollister/CNET \nWhile my hometown of San Jose, CA and my alma mater UC Santa Barbara are recognizable (if rough) 3D, like an old The Sims video game, even the capital of the Philippines is a flat 2D image right now. \"It's kind of lame,\" says my wife. Perhaps because of that, Google includes a number of suggested destinations and premade tours filled with highlights. \nUC Santa Barbara, as seen in Google Earth VR. Photo by Screenshot by Sean Hollister/CNET \nThere's also no search feature yet -- though I'm almost glad, because one of the most stunning things about zooming through Earth VR is the sheer sense of scale. My wife and I didn't appreciate just how huge Tokyo and Paris are, just how much we must have missed in person, until we struggled to find the places we'd been. When you do find something beautiful outside of a big city, there's a real sense of discovery that comes along with it. \nLike many of Google's coolest things, Google Earth VR started as a 20 percent project, and it's been slowly moving forward ever since the first Oculus Rift development kit came out in 2013. Kaeser says it's a Vive-exclusive to start, though they're also looking at other platforms (like Google's Daydream ) as well. \nNext, says Product Manager Mike Podwal, is more data, more tie-ins to other Google products, more layers on top. He says Google wants this to be \"a really rich geospacial way to learn about the world.\" We spitball about how awesome it would be if you could see, say, the impact of climate change, population density, or even just changes in your own neighborhood using VR. \nFor now, Google Earth VR is neat, and it's free. You can download it from the Steam Store . Virtual Reality Apps Wearable Tech Virtual Reality Google HTC CNET Review ",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [
          {
            "name": "kaeser",
            "sentiment": "none"
          },
          {
            "name": "mike podwal",
            "sentiment": "none"
          },
          {
            "name": "dominik kaeser",
            "sentiment": "none"
          },
          {
            "name": "superman",
            "sentiment": "none"
          },
          {
            "name": "sean hollister/cnet",
            "sentiment": "none"
          }
        ],
        "organizations": [
          {
            "name": "google",
            "sentiment": "positive"
          },
          {
            "name": "cnet",
            "sentiment": "positive"
          },
          {
            "name": "google earth",
            "sentiment": "none"
          },
          {
            "name": "google earth vr",
            "sentiment": "none"
          },
          {
            "name": "uc santa barbara",
            "sentiment": "none"
          }
        ],
        "locations": [
          {
            "name": "italy",
            "sentiment": "none"
          },
          {
            "name": "earth vr",
            "sentiment": "none"
          },
          {
            "name": "philippines",
            "sentiment": "none"
          },
          {
            "name": "florence",
            "sentiment": "none"
          },
          {
            "name": "google earth",
            "sentiment": "none"
          },
          {
            "name": "san jose",
            "sentiment": "none"
          },
          {
            "name": "windsor castle",
            "sentiment": "none"
          },
          {
            "name": "tokyo",
            "sentiment": "none"
          },
          {
            "name": "paris",
            "sentiment": "none"
          },
          {
            "name": "london",
            "sentiment": "none"
          }
        ]
      },
      "crawled": "2016-11-17T08:26:29.853+02:00"
    },
    {
      "thread": {
        "uuid": "88e88fae7f9c0f2dc7e3c744092f02d6e0a7951e",
        "url": "http://omgili.com/ri/jHIAmI4hxg.aX6RsjGyewe2esD1hjPoJKKqx1qejIZx3PCWb0W73SAtjDvnKI6iPQIbE9vjWrqByoPJ4t_wdj7mDm9zg32ydm_M.7X_wYCktYOsQ.k46sRemt4QN4I9IVNdcWCuMewo-",
        "site_full": "www.androidcentral.com",
        "site": "androidcentral.com",
        "site_section": "http://feeds.feedburner.com/androidcentral",
        "site_categories": [
          "news",
          "tech"
        ],
        "section_title": "Android Central - Android Forums, News, Reviews, Help and Android Wallpapers",
        "title": "4K movies start trickling into Google Play Movies ahead of official rollout",
        "title_full": "4K movies start trickling into Google Play Movies ahead of official rollout | Android Central",
        "published": "2016-11-18T16:59:00.000+02:00",
        "replies_count": 17,
        "participants_count": 9,
        "site_type": "blogs",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "https://www.androidcentral.com/sites/androidcentral.com/files/styles/large/public/article_images/2016/10/google-play-movies-4k.jpg?itok=Mky_wCp5",
        "performance_score": 8,
        "domain_rank": 1053,
        "social": {
          "facebook": {
            "likes": 821,
            "comments": 0,
            "shares": 821
          },
          "gplus": {
            "shares": 28
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "88e88fae7f9c0f2dc7e3c744092f02d6e0a7951e",
      "url": "http://omgili.com/ri/jHIAmI4hxg.aX6RsjGyewe2esD1hjPoJKKqx1qejIZx3PCWb0W73SAtjDvnKI6iPQIbE9vjWrqByoPJ4t_wdj7mDm9zg32ydm_M.7X_wYCktYOsQ.k46sRemt4QN4I9IVNdcWCuMewo-",
      "ord_in_thread": 0,
      "author": "Ara Wagoner",
      "published": "2016-11-18T16:59:00.000+02:00",
      "title": "4K movies start trickling into Google Play Movies ahead of official rollout",
      "text": "We want to escape into the movies, and that means we need images as vivid, crisp, and clean as we can get them.\n\nWhile 4K offerings for your fancy new TV and your Chromecast Ultra might be slim right now, soon we may have a real selection of 4K content as Google Play Movies starts slipping 4K content into its store. Right now, a few lucky users are able to see some 4K movies but don't go rushing for a concession stand just yet.\nSome enterprising Redditors are seeing 4K content available in the store, but the list of films available isn't even enough for an all-day movie marathon, consisting of films like Star Trek Beyond and Zoolander . In order to see the UHD films (maybe), you have to browse for the films in Google Play Movies rather than in the the Google Play store, and even then, it might not let you purchase them.\nWhen the lucky users contacted Google support, they were allegedly told the feature isn't rolled out yet. Lucky them for getting to see it at all, though, and for sharing it with the rest of us. During Google's Chromecast Ultra announcements, 4K was slated to roll out in November, so hopefully we'll all see this soon, as November's halfway over already. While we may not all have 4K TVs yet, it's nice to see 4K content starting to trickle into Google Play Movies. And when Disney releases Moana in 4K, I will be there, popcorn in hand.\nChromecast \nChromecast and Chromecast Audio review Chromecast Ultra vs Roku Chromecast vs Chromecast Ultra: Which should you buy? Join the discussion in our forums Chromecast:\nGoogle Best Buy \nChromecast Audio:\nGoogle Best Buy \nChromecast Ultra:\nGoogle Best Buy \n ",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [
          {
            "name": "moana",
            "sentiment": "none"
          },
          {
            "name": "roku chromecast",
            "sentiment": "none"
          },
          {
            "name": "chromecast ultra",
            "sentiment": "none"
          },
          {
            "name": "chromecast  chromecast",
            "sentiment": "none"
          }
        ],
        "organizations": [
          {
            "name": "google",
            "sentiment": "positive"
          },
          {
            "name": "disney",
            "sentiment": "none"
          },
          {
            "name": "chromecast audio",
            "sentiment": "none"
          }
        ],
        "locations": []
      },
      "crawled": "2016-11-18T18:23:06.763+02:00"
    },
    {
      "thread": {
        "uuid": "4ffa425001ccdb7b4624be5126dac149b79b7bb0",
        "url": "http://omgili.com/ri/jHIAmI4hxg.aX6RsjGyewXaF650x_J7FQ3_xTZytttQXDhF2Y8Z0E7ZJtE_ToRU6I96ADn_jnEzX9hXytOiZGg--",
        "site_full": "www.androidauthority.com",
        "site": "androidauthority.com",
        "site_section": "http://www.androidauthority.com",
        "site_categories": [
          "news",
          "tech"
        ],
        "section_title": "Android Authority",
        "title": "Nest app now works with Android TVs to show home camera feeds",
        "title_full": "Nest app now works with Android TVs to show home camera feeds",
        "published": "2016-11-19T17:13:07.970+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "blogs",
        "country": "US",
        "spam_score": 0.0,
        "main_image": null,
        "performance_score": 3,
        "domain_rank": 1848,
        "social": {
          "facebook": {
            "likes": 352,
            "comments": 0,
            "shares": 352
          },
          "gplus": {
            "shares": 7
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 2
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "4ffa425001ccdb7b4624be5126dac149b79b7bb0",
      "url": "http://omgili.com/ri/jHIAmI4hxg.aX6RsjGyewXaF650x_J7FQ3_xTZytttQXDhF2Y8Z0E7ZJtE_ToRU6I96ADn_jnEzX9hXytOiZGg--",
      "ord_in_thread": 0,
      "author": "John Callaham",
      "published": "2016-11-19T17:13:07.970+02:00",
      "title": "Nest app now works with Android TVs to show home camera feeds",
      "text": "\nThe Nest connected home hardware company, owned by Google’s parent company Alphabet, is making an effort to link to more of its big brother’s products. The Nest app for Android now allows people who own its camera products to view their feeds on the big screen, assuming it runs Android TV .\nSee also: Nest’s first outdoor security camera is weatherproof and can see in the dark July 14, 2016 That means if you own either the indoor or the recently released outdoor camera from the company, the Nest app can now work with Android TV so you can see who is at the door while you are watching the football game. The app also allows users to view previously recorded video from the cam on their Android TV in case they need to check on something later.\nIn addition, the new update to the app allows customers with a Nest Aware subscription to create an “instaclip” of any video feed or recording from their cameras. The app itself figures out where to begin and end the clip with a special algorithm. If you want to pick where the clip begins and ends, there’s the option to do that as well. After it’s made, it can be shared with others.\nThe app update also lets smartphone users view any camera video in full screen without having to rotate the phone by simply tapping the down arrow icon below the camera window. Finally, the new Nest app lets users edit their device notifications settings from the Home settings menu.\nIf you own these camera products, will you get some extra use from them with this update?\nGet it at Google Play ",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [],
        "organizations": [
          {
            "name": "google",
            "sentiment": "positive"
          },
          {
            "name": "alphabet",
            "sentiment": "positive"
          },
          {
            "name": "android tv",
            "sentiment": "none"
          }
        ],
        "locations": []
      },
      "crawled": "2016-11-19T17:13:07.970+02:00"
    },
    {
      "thread": {
        "uuid": "f3da9168360e28958e55a3f6fef59fe9ad4775f2",
        "url": "http://omgili.com/ri/jHIAmI4hxg8w7niuyAyflFlwVidy6u4LS9kvx0qq_IL81iJXSIfx8VJJy2Xpa.AHeLyu1fq9lP22AgPB3niACowwOjx7KJsFNqMiRatVCsKZ3NbItpqYpEnDgCVUpK8ql4NkMja12PPcEeOXJ7_s.tZCHXYStMfWTj.XWolJDgq_mmqRKGimD6B4bavnpxTogduZtKdTO3hz9GETXawVtA--",
        "site_full": "www.bostonglobe.com",
        "site": "bostonglobe.com",
        "site_section": "http://www.bostonglobe.com/",
        "site_categories": [
          "news"
        ],
        "section_title": "The Boston Globe",
        "title": "The trumpet summons us again: Reflecting on Trump’s election and issuing a call to action",
        "title_full": "The trumpet summons us again: Reflecting on Trump’s election and issuing a call to action - The Boston Globe",
        "published": "2016-11-17T02:00:00.000+02:00",
        "replies_count": 55,
        "participants_count": 38,
        "site_type": "news",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "http://www.bostonglobe.com/rf/image_585w/Boston/2011-2020/2016/11/17/BostonGlobe.com/EditorialOpinion/Images/1120ivanforweb.jpg",
        "performance_score": 4,
        "domain_rank": 2402,
        "social": {
          "facebook": {
            "likes": 454,
            "comments": 0,
            "shares": 454
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "f3da9168360e28958e55a3f6fef59fe9ad4775f2",
      "url": "http://omgili.com/ri/jHIAmI4hxg8w7niuyAyflFlwVidy6u4LS9kvx0qq_IL81iJXSIfx8VJJy2Xpa.AHeLyu1fq9lP22AgPB3niACowwOjx7KJsFNqMiRatVCsKZ3NbItpqYpEnDgCVUpK8ql4NkMja12PPcEeOXJ7_s.tZCHXYStMfWTj.XWolJDgq_mmqRKGimD6B4bavnpxTogduZtKdTO3hz9GETXawVtA--",
      "ord_in_thread": 0,
      "author": "bostonglobe",
      "published": "2016-11-17T02:00:00.000+02:00",
      "title": "The trumpet summons us again: Reflecting on Trump’s election and issuing a call to action",
      "text": " Google+\nIvan Canu for The Boston Globe\nBy Laurence H. Tribe November 17, 2016\nI remember well how I felt as dawn broke the morning after Barack Obama’s election as president in 2008. My hopes were boundless, my expectations unrealistic. That President Obama did not succeed in mobilizing the deeply transformative political dynamic I dared to anticipate is no doubt true, especially in light of this year’s election results. But looking back, I remain enormously proud of my former student and chief research assistant. Obama achieved great things both domestically and globally, all in the face of deeper recalcitrance and obstruction than most of us had imagined possible.\nI spent a bit over a year in the Obama administration, launching a new initiative to enhance access to justice for the poor and middle class. After returning to Harvard, I continued to assist when I could, even though I didn’t hesitate to criticize the president when I thought he had given up too soon on important efforts and especially when I thought he had lost his legal moorings. But his election eight years ago was a ray of sunshine after a bleak eight years under President George W. Bush.\nAdvertisement\nThe contrast with how I felt the morning after this election could not have been starker. The electoral vote victory of Donald Trump, a bigoted and ill-informed bully who called forth the worst impulses in many of his followers, and who inspired the emergence of the vilest elements of our society, including unabashed KKK racists and neo-Nazis, felt then and continues to feel utterly devastating. It was an outcome I never ruled out as inconceivable but also never came to regard as genuinely plausible — even when FBI Director James Comey irresponsibly reversed the pro-Hillary Clinton momentum 11 days before the election, only to say “never mind” just a week later, two days before the election. His 11th-hour clarification, whatever its purpose, clearly came too late to undo the mess he had gratuitously created.\nI believed, even after that FBI fiasco, that this uniquely qualified, talented, and dedicated woman would soon become Madame President. I knew what Clinton’s victory would mean to my two granddaughters — and to my two grandsons as well. I knew what it would mean to many of my students. I knew what a victory for Clinton, and — I dared to hope — a Democratic takeover of the Senate, would mean for the Supreme Court, and for the Constitution and the rule of law as I understood them. And, at a gut level, I knew what those victories would mean for millions of decent, law-abiding (even if undocumented) individuals, including innocent immigrant children and families who had just begun to emerge from the shadows.\nGet Today's Headlines in your inbox: The day's top stories delivered every morning Sign I especially looked forward to the opportunities a victory would give Clinton to prove herself trustworthy, to plug the holes that remained in the Obama legacy with respect to health care and jobs, and to advance a fundamentally progressive agenda. And, most important, I knew that a Clinton administration would fend off the terrible and unjustifiable harms that her opponent’s apparent agenda threatened to inflict on the many poor and middle-class people Obama’s programs had helped to protect from the ravages of a slow economic recovery and from the slings and arrows of racism, misogyny, homophobia, and Islamophobia.\nWellesley, Babson students gather for peaceful rally About 200 hundred students from Wellesley, Democrat Hillary Clinton’s alma mater, and between 40 and 50 students from Babson joined together for the peaceful rally.\nHillary Clinton makes first public speech since concession\nNone of that was to be. In the few hours between 8 o’clock in the evening of Nov. 8 and the start of the next day, the glimmer of possible catastrophe turned rapidly into a feeling of foreboding and then a sense of impending doom.\nA few hours of fitful sleep ended with a rude awakening. It had really happened.\nAdvertisement\nIn the days since, I’ve struggled with what to make of it all. Clinton had won the nationwide popular vote by a wide margin, making the weird and increasingly unjustifiable Electoral College the villain of the piece for the second time this century.\nA fervent believer in democracy and in the American experiment, I couldn’t just dismiss the votes of over 60 million of my fellow citizens — not a majority, but damn close. I couldn’t bring myself to say, as some are saying, that nearly half the voting electorate had displayed raw hatred of the “other” or at least a disgusting willingness to tolerate vicious scapegoating and mistreatment of women, people of color, immigrants, Jews, Muslims, members of the LGBT community, veterans who had been captured and tortured, people with disabilities, and other often marginalized groups — all in exchange for the promise of better times to come for themselves and their families.\nIt was especially painful to imagine that so many Americans, when envisioning “better times,” may well have been thinking not just of their fair share of the economic pie but of a nation of pervasively white, straight, and male privilege — a nation I could hardly recognize as my own.\nEven if the aspirations tempting most of Trump’s followers were less retrograde and repressive but were overwhelmingly economic, it remained hard to think of so many Americans eagerly embracing what seemed to me the empty promises of a self-proclaimed billionaire whom many Republicans, as well as nearly all Democrats, rightly called a con man, an immature and ignorant blowhard whose admiration for tyrants like Vladimir Putin and whose business entanglements with Putin-linked oligarchs and cyber-warriors might well have motivated Russia’s grotesque manipulation of the American presidential election.\nIn trying to empathize with Trump’s supporters, I’ve been moved by the thoughtful observations of people like J.D. Vance (“Hillbilly Elegy”) and Michael Moore holding coastal elites (and folks like me, for sure) responsible for our blind failure to appreciate, and to address convincingly, the economic travails of people all over the country, especially noncollege whites living in rural communities or in ravaged, formerly thriving, industrial areas, all left behind by technological and cultural change. Of people who were struggling mightily to care for their families and who were more than ready to vote for someone they could see as not beholden to Wall Street or to other self-important elites who looked down on them.\nAnd yet I remain deeply perplexed by how to empathize with those whose needs, priorities, and attitudes differ dramatically from my own without becoming complicit in the evil that those other priorities and values might yield.\nI do know that I must use all my legal skills to fight that evil if and when it occurs, and to prepare to fight it on the premise that it might occur with little or no notice. I must work tirelessly with other lawyers and with my students — without pay, of course — in planning legal and political strategies to defend the vulnerable from Trump-authored or Trump-inspired violations of their fundamental rights, whether those violations take the form of outright discrimination and subordination or subtle, systemic infringements.\nWe must take what feels like this dark hour to shine light on abuse and to deploy all our knowledge and ability to combat it. We must be proactive and not just proceed from a defensive crouch. I have told my students that it does no good just to feel devastated, as many (of course not all) of them do. Now it is our turn to give back in as full a measure as we can. Let’s accept the challenge and run with it.\nLaurence H. Tribe @tribelaw is the Carl M. Loeb University professor and professor of constitutional law at Harvard Law School. Follow him on Twitter @tribelaw .",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [
        "http://www.facebook.com/sharer.php?u=http%3A%2F%2Fwww.bostonglobe.com%2Fopinion%2F2016%2F11%2F17%2Fthe-trumpet-summons-again-reflecting-trump-election-and-issuing-call-action%2FplVdwgaFw9WpOJgLcj50GK%2Fstory.html%3Fevent%3Devent25%3Fevent%3Devent25&tThe",
        "http://www.linkedin.com/shareArticle?mini=true&url=http%3A%2F%2Fwww.bostonglobe.com%2Fopinion%2F2016%2F11%2F17%2Fthe-trumpet-summons-again-reflecting-trump-election-and-issuing-call-action%2FplVdwgaFw9WpOJgLcj50GK%2Fstory.html%3Fevent%3Devent25&title=The",
        "http://twitter.com/intent/tweet?text=The",
        "http://www.facebook.com/sharer.php?u=http%3A%2F%2Fwww.bostonglobe.com%2Fopinion%2F2016%2F11%2F17%2Fthe-trumpet-summons-again-reflecting-trump-election-and-issuing-call-action%2FplVdwgaFw9WpOJgLcj50GK%2Fstory.html%3Fevent%3Devent25&t=The",
        "http://twitter.com/tribelaw",
        "https://plus.google.com/share?url=http%3A%2F%2Fwww.bostonglobe.com%2Fopinion%2F2016%2F11%2F17%2Fthe-trumpet-summons-again-reflecting-trump-election-and-issuing-call-action%2FplVdwgaFw9WpOJgLcj50GK%2Fstory.html%3Fevent%3Devent25%26s_campaign%3dsm_gp%26hl=en-US"
      ],
      "entities": {
        "persons": [
          {
            "name": "ivan canu",
            "sentiment": "positive"
          },
          {
            "name": "trump",
            "sentiment": "positive"
          },
          {
            "name": "laurence h. tribe",
            "sentiment": "positive"
          },
          {
            "name": "hillary clinton",
            "sentiment": "none"
          },
          {
            "name": "clinton",
            "sentiment": "none"
          },
          {
            "name": "michael moore",
            "sentiment": "none"
          },
          {
            "name": "james comey",
            "sentiment": "none"
          },
          {
            "name": "donald trump",
            "sentiment": "none"
          },
          {
            "name": "barack obama",
            "sentiment": "none"
          },
          {
            "name": "george w. bush",
            "sentiment": "none"
          },
          {
            "name": "j.d. vance",
            "sentiment": "none"
          },
          {
            "name": "babson",
            "sentiment": "none"
          },
          {
            "name": "vladimir putin",
            "sentiment": "none"
          },
          {
            "name": "obama",
            "sentiment": "none"
          },
          {
            "name": "laurence h. tribe @tribelaw",
            "sentiment": "none"
          }
        ],
        "organizations": [
          {
            "name": "google",
            "sentiment": "positive"
          },
          {
            "name": "boston globe",
            "sentiment": "positive"
          },
          {
            "name": "harvard law school",
            "sentiment": "none"
          },
          {
            "name": "senate",
            "sentiment": "none"
          },
          {
            "name": "fbi",
            "sentiment": "none"
          },
          {
            "name": "kkk",
            "sentiment": "none"
          },
          {
            "name": "carl m. loeb university",
            "sentiment": "none"
          },
          {
            "name": "trump",
            "sentiment": "none"
          },
          {
            "name": "harvard",
            "sentiment": "none"
          },
          {
            "name": "democratic",
            "sentiment": "none"
          },
          {
            "name": "electoral college",
            "sentiment": "none"
          },
          {
            "name": "supreme court",
            "sentiment": "none"
          }
        ],
        "locations": [
          {
            "name": "wellesley",
            "sentiment": "none"
          },
          {
            "name": "russia",
            "sentiment": "none"
          }
        ]
      },
      "crawled": "2016-11-20T00:10:17.823+02:00"
    },
    {
      "thread": {
        "uuid": "6a0d2f3afea896618580356a2272daea1446c2cf",
        "url": "http://omgili.com/ri/jHIAmI4hxg.a0ERDGN194XDzDOfi07qDbgt95xEbFOAAPWK2f0OqslXhDH5ZqqHFldJ_m7GNeuLt98fIO_rVB1uYJl_g6H6Mo2LNLshimZ0Wq_EFzEmd8DNTHJ9lu9QfP5EWdv9dzUw-",
        "site_full": "www.theverge.com",
        "site": "theverge.com",
        "site_section": "http://www.theverge.com/rss/frontpage",
        "site_categories": [
          "news",
          "entertainment"
        ],
        "section_title": "The Verge -  All Posts",
        "title": "Google will tell you how crowded your favorite bar is in real time",
        "title_full": "Google will tell you how crowded your favorite bar is in real time - The Verge",
        "published": "2016-11-21T20:36:00.000+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "news",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "https://cdn0.vox-cdn.com/thumbor/kLS2yJuQHqcnm6fBpRYK8m8urHQ=/0x218:3000x1789/fit-in/1200x630/cdn3.vox-cdn.com/uploads/chorus_asset/file/7511413/754781.jpg",
        "performance_score": 9,
        "domain_rank": 496,
        "social": {
          "facebook": {
            "likes": 985,
            "comments": 0,
            "shares": 985
          },
          "gplus": {
            "shares": 22
          },
          "pinterest": {
            "shares": 3
          },
          "linkedin": {
            "shares": 136
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 1
          }
        }
      },
      "uuid": "6a0d2f3afea896618580356a2272daea1446c2cf",
      "url": "http://omgili.com/ri/jHIAmI4hxg.a0ERDGN194XDzDOfi07qDbgt95xEbFOAAPWK2f0OqslXhDH5ZqqHFldJ_m7GNeuLt98fIO_rVB1uYJl_g6H6Mo2LNLshimZ0Wq_EFzEmd8DNTHJ9lu9QfP5EWdv9dzUw-",
      "ord_in_thread": 0,
      "author": "Ashley Carman",
      "published": "2016-11-21T20:36:00.000+02:00",
      "title": "Google will tell you how crowded your favorite bar is in real time",
      "text": "Google’s popular times feature gives you an idea of how crowded a place typically gets throughout the day. It’s not complex given that you can probably assume a restaurant is busy during peak dinner hours and is quieter around 4PM. That makes sense. Now the company is launching a similar feature that will tell you how crowded a place is in real time. The company relies on aggregated, anonymized location history data, just like it does for popular times.\nAlong with that real-time feature, Google will also clarify how long people typically stay in one place, so you can plan your day around that. It’ll also update retail hours to reflect holiday adjustments. All this information is available in Maps and search. Now I’m wondering if Google will tell me how long the Snapchat Spectacles line is in New York because really that’s the only information I want right now.\n\nGoogle",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [],
        "organizations": [
          {
            "name": "google",
            "sentiment": "positive"
          }
        ],
        "locations": [
          {
            "name": "new york",
            "sentiment": "none"
          }
        ]
      },
      "crawled": "2016-11-21T20:51:06.753+02:00"
    },
    {
      "thread": {
        "uuid": "144e3ecee94f6c2c14f66df3a0a28e91f75c436f",
        "url": "http://omgili.com/ri/jHIAmI4hxg8v3BmVd24meuL1ei1Bo_4Wp0ZSkR.CSUa98CN4vnKIUZd8t_HlKWwHkJPTwV34G6op2MnENB_oZP9jH3viQ3lrrxkD.3i7XcQ-",
        "site_full": "www.businessinsider.com",
        "site": "businessinsider.com",
        "site_section": "",
        "site_categories": [
          "news"
        ],
        "section_title": "",
        "title": "7 places on Google Maps that you are blocked from seeing - Business Insider",
        "title_full": "7 places on Google Maps that you are blocked from seeing - Business Insider",
        "published": "2016-11-21T21:09:56.112+02:00",
        "replies_count": 0,
        "participants_count": 0,
        "site_type": "news",
        "country": "US",
        "spam_score": 0.1,
        "main_image": "http://static4.businessinsider.com/image/582cb818ba6eb6b1018b4ae2-1190-625/7-places-you-cant-find-on-google-maps.jpg",
        "performance_score": 6,
        "domain_rank": 283,
        "social": {
          "facebook": {
            "likes": 679,
            "comments": 0,
            "shares": 679
          },
          "gplus": {
            "shares": 2
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 89
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "144e3ecee94f6c2c14f66df3a0a28e91f75c436f",
      "url": "http://omgili.com/ri/jHIAmI4hxg8v3BmVd24meuL1ei1Bo_4Wp0ZSkR.CSUa98CN4vnKIUZd8t_HlKWwHkJPTwV34G6op2MnENB_oZP9jH3viQ3lrrxkD.3i7XcQ-",
      "ord_in_thread": 0,
      "author": "Darren Weaver",
      "published": "2016-11-21T21:09:56.112+02:00",
      "title": "7 places on Google Maps that you are blocked from seeing - Business Insider",
      "text": "embed \nGoogle Maps is one of the most amazing pieces of technology to come out of Silicon Valley. You can explore the entire world without ever leaving the comfort of your living room. However, there are a few places on Earth that Google won't let you see. \nFollow Tech Insider: On Facebook Most Popular ",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [
          {
            "name": "yo",
            "sentiment": "neutral"
          }
        ],
        "organizations": [
          {
            "name": "google maps",
            "sentiment": "positive"
          },
          {
            "name": "google",
            "sentiment": "positive"
          }
        ],
        "locations": [
          {
            "name": "silicon valley",
            "sentiment": "none"
          }
        ]
      },
      "crawled": "2016-11-21T21:09:56.112+02:00"
    },
    {
      "thread": {
        "uuid": "1fb025e29571aed15b1b430ea28d85a5ddf04caf",
        "url": "http://omgili.com/ri/7aBdisT0NOpG0wY0hoke2Mclls6SHX1z6k35QMIP0kw50lImM8F5xG2e3qIBN98uLZeT1GfNQ.CuItC1hitjBMRv3Y_WeH82omcU1oSZq5Io83CVle6c5g--",
        "site_full": "searchengineland.com",
        "site": "searchengineland.com",
        "site_section": "http://searchengineland.com",
        "site_categories": [
          "business"
        ],
        "section_title": "Search Engine Land: News & Info About SEO, PPC, SEM, Search Engines & Search Marketing",
        "title": "Google Maps adds a live view for popular times at venues",
        "title_full": "Google Maps adds a live view for popular times at venues",
        "published": "2016-11-21T22:15:20.758+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "blogs",
        "country": "US",
        "spam_score": 0.0,
        "main_image": null,
        "performance_score": 1,
        "domain_rank": 2041,
        "social": {
          "facebook": {
            "likes": 170,
            "comments": 0,
            "shares": 170
          },
          "gplus": {
            "shares": 51
          },
          "pinterest": {
            "shares": 6
          },
          "linkedin": {
            "shares": 163
          },
          "stumbledupon": {
            "shares": 179
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "1fb025e29571aed15b1b430ea28d85a5ddf04caf",
      "url": "http://omgili.com/ri/7aBdisT0NOpG0wY0hoke2Mclls6SHX1z6k35QMIP0kw50lImM8F5xG2e3qIBN98uLZeT1GfNQ.CuItC1hitjBMRv3Y_WeH82omcU1oSZq5Io83CVle6c5g--",
      "ord_in_thread": 0,
      "author": "Barry Schwartz",
      "published": "2016-11-21T22:15:20.758+02:00",
      "title": "Google Maps adds a live view for popular times at venues",
      "text": "Google Maps makes the popular times feature work in the now, with a real-time view. The post Google Maps adds a live view for popular times at venues appeared first on Search Engine Land.\n\nPlease visit Search Engine Land for the full article. ",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [],
        "organizations": [
          {
            "name": "google maps",
            "sentiment": "positive"
          },
          {
            "name": "google",
            "sentiment": "positive"
          }
        ],
        "locations": []
      },
      "crawled": "2016-11-21T22:15:20.758+02:00"
    },
    {
      "thread": {
        "uuid": "1a80a43f2991ee78a9bf7496435a605df582f2cd",
        "url": "http://omgili.com/ri/7aBdisT0NOpG0wY0hoke2Mclls6SHX1z6k35QMIP0kzADQ7dV6CAXwMmhXKXuZ2FGGPlYuZwH1l7dhMCRdge1xa59.cpVSQPyj5zQwlSN9vjNa.zriV5gzpcVCpDMxch",
        "site_full": "searchengineland.com",
        "site": "searchengineland.com",
        "site_section": "http://searchengineland.com",
        "site_categories": [
          "business"
        ],
        "section_title": "Search Engine Land: News & Info About SEO, PPC, SEM, Search Engines & Search Marketing",
        "title": "Google adds Store Visits data to AdWords distance & location reports ahead of Black Friday",
        "title_full": "Google adds Store Visits data to AdWords distance & location reports ahead of Black Friday",
        "published": "2016-11-22T13:04:16.296+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "blogs",
        "country": "US",
        "spam_score": 0.0,
        "main_image": null,
        "performance_score": 1,
        "domain_rank": 2041,
        "social": {
          "facebook": {
            "likes": 182,
            "comments": 0,
            "shares": 182
          },
          "gplus": {
            "shares": 57
          },
          "pinterest": {
            "shares": 4
          },
          "linkedin": {
            "shares": 320
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "1a80a43f2991ee78a9bf7496435a605df582f2cd",
      "url": "http://omgili.com/ri/7aBdisT0NOpG0wY0hoke2Mclls6SHX1z6k35QMIP0kzADQ7dV6CAXwMmhXKXuZ2FGGPlYuZwH1l7dhMCRdge1xa59.cpVSQPyj5zQwlSN9vjNa.zriV5gzpcVCpDMxch",
      "ord_in_thread": 0,
      "author": "Ginny Marvin",
      "published": "2016-11-22T13:04:16.296+02:00",
      "title": "Google adds Store Visits data to AdWords distance & location reports ahead of Black Friday",
      "text": "The company also released a compilation of insights on Black Friday mobile and in-store shopping behaviors. The post Google adds Store Visits data to AdWords distance & location reports ahead of Black Friday appeared first on Search Engine Land.\n\nPlease visit Search Engine Land for the full article. ",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [],
        "organizations": [
          {
            "name": "google",
            "sentiment": "positive"
          }
        ],
        "locations": []
      },
      "crawled": "2016-11-22T13:04:16.296+02:00"
    },
    {
      "thread": {
        "uuid": "83b5b7f54a6bf56fad756f894819c0c218c6625d",
        "url": "http://omgili.com/ri/_0JOtn.4SCptBHmsOYT_aHiL2INmhYiA9Ll41H8MS1YKZ0wlY7UI3KDY8d13hYfDaDSvlPCpsxPTXJTEzMKUdw--",
        "site_full": "blog.hubspot.com",
        "site": "hubspot.com",
        "site_section": "http://blog.hubspot.com/CMS/UI/Modules/BizBlogger/rss.aspx?tabid=6307&moduleid=8441&maxcount=25&tag=Advertising",
        "site_categories": [
          "business"
        ],
        "section_title": "HubSpot Marketing Blog",
        "title": "8 Interesting Things You Probably Didn't Know About Google's Algorithm",
        "title_full": "8 Interesting Things You Probably Didn't Know About Google's Algorithm",
        "published": "2016-11-22T13:00:00.000+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "blogs",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "http://cdn2.hubspot.net/hubfs/53/Fun_Facts_Algorithm.png#keepProtocol",
        "performance_score": 1,
        "domain_rank": 1006,
        "social": {
          "facebook": {
            "likes": 158,
            "comments": 0,
            "shares": 158
          },
          "gplus": {
            "shares": 44
          },
          "pinterest": {
            "shares": 10
          },
          "linkedin": {
            "shares": 193
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "83b5b7f54a6bf56fad756f894819c0c218c6625d",
      "url": "http://omgili.com/ri/_0JOtn.4SCptBHmsOYT_aHiL2INmhYiA9Ll41H8MS1YKZ0wlY7UI3KDY8d13hYfDaDSvlPCpsxPTXJTEzMKUdw--",
      "ord_in_thread": 0,
      "author": "Amanda Zantal-Wiener",
      "published": "2016-11-22T13:00:00.000+02:00",
      "title": "8 Interesting Things You Probably Didn't Know About Google's Algorithm",
      "text": "It’s not often that you see the word “fun” and “algorithm” in the same sentence. (Okay, fine. Maybe you do, if you’re a marketing nerd like I am.) But think about this: Google has really been around for over two decades. With a history like that, there's got to be at least some compelling trivia, right?\nBelieve it or not, algorithms are really cool. I mean, they get us our search results, after all.But how does Google's algorithm work? And how has it evolved over the course of so many years? \nWe thought you might ask that, so we put together some fun facts about Google's algorithm, and how it's shaped the way we search today.\nWhat the Heck Is an Algorithm, Anyway? To quote Google itself, “Algorithms are the computer processes and formulas that take your questions and turn them into answers.” They cut through its estimated “trillions” of web pages in existence to find the information you’re looking for.\nThink about that for a second. “Trillions.” One trillion, numerically, looks like this:\n1,000,000,000,000 \nImagine if there were no algorithms, and we had to somehow sift through that amount of information ourselves. Luckily, Google has developed an algorithm that can read -- at a pace few of us can begin to fathom -- different signals from these pages that indicate how likely they are to answer your search query.\nBut it’s not just about the words on the page. Algorithms can also read how recent the content is, how likely it is to be spam, and how it pertains to your location.\nAs marketers, all of this stuff matters. Where and how your pages rank in Google can make or break your organic search traffic, so it’s important to understand how the algorithm works and how to ethically optimize for it. What’s more, it’s crucial to be adaptable -- the Google algorithm has changed a lot over the years , and will continue to do so as it becomes even more user-friendly.\n8 Fun Facts About Google's Algorithm 1) Google’s overall algorithm has had one name since 2013: Hummingbird. \nSource: Search Engine Land \nIf you do keep up with the changes to Google’s algorithm, you’ve probably seen some colorful names assigned to them -- Panda, Penguin, and Pigeon to name a few.\nHowever, those names have only been assigned to updates made to the overall algorithm itself -- which today is called Hummingbird . It was formally announced in September 2013 and created to make search results more “precise and fast” like the bird itself, according to Search Engine Land [SEL].\nSEL has one of the best analogies we’ve seen to describe the algorithm at-large -- Hummingbird is a “recipe” with hundreds of “ingredients.” These ingredients are the different pieces that help the algorithm determine the quality of those trillions of pages, and how well any one of them might answer your search.\n2) Google makes changes to its algorithm roughly 500 times per year. \nSource: pyxle \nSEO community Moz states that Google makes between 500-600 changes to its algorithm annually , most of which are so minor that the public doesn’t usually hear about them.\nEven without those minor changes, however, Moz has recorded no less than 140 updates to the Google algorithm since 2000.\nBecause the list was fairly dense, I enlisted the help of a colleague to count the items accurately. In splitting it up into two sections -- the eight years before and after 2008, respectively -- we noticed something interesting. The first eight years only listed 25 updates of note, whereas the latter had 115.\nSo why have there been so many more updates in the recent years? It could have something to do with the massive increase in users. But it could also be about changes to the way we search. For one, we’re searching on our phones a lot more -- 51% percent of digital media is consumed via mobile -- which has led to more than one crackdown by Google on pages that aren’t optimized for such platforms.  \nWe’re also starting to see an uptick in voice search . And while there currently aren’t precise formulas to plan or rank for those kinds of searches, we imagine that Google will start changing its algorithm for them -- after all, it’s seen a 3400% increase in voice queries since 2008 .\nLike we said -- understanding the algorithm requires agility. It’s only going to continue to change, so in order to maintain good search standing, marketers should learn to adapt.\n3) One of the original goals was to cut through spammy content from advertisers. \nSource: Stanford InfoLab \nGoogle’s “ history in depth ” dates back roughly 20 years -- in 1997, co-founders Larry Page and Sergey Brin were working on their first search engine, which they then called BackRub.\nThen, in 1998, the pair published a paper at Stanford titled “ The Anatomy of a Large-Scale Hypertextual Web Search Engine .” That’s where we see one of the first mentions of PageRank, which is the technology that Google continues to use to help rank search results.\nBut there’s one thing in the admittedly dense text that really stood out. At the time of writing the paper, Page and Brin noted, “the predominant business model for commercial search engines is advertising. The goals of the advertising business model do not always correspond to providing quality search to users.”\nWe can’t help but geek out over the fact that Google remains loyal to that thesis. When I previously interviewed my colleague  Marcus Andrews  about the algorithm, he told me, \"Google is very focused on the user.\"\nIn fact, you could say that’s why Google has continued to make so many changes to the algorithm. It’s finding new ways to get the best content to users.\nJust have a look at the search engine's “ Steps to a Google-friendly site ” -- one of the first things listed is to “provide high-quality content on your pages.” Eighteen years later, Google is working toward the original vision of its founders.\n4) PageRank was named after Google co-founder Larry Page. \nSource: Stanford InfoLab \nWhen the name “PageRank” is assigned to the technology that helps Google rank pages, it seems fairly intuitive. But it was actually named after one of Google’s co-founders, Larry Page, whose young mug can be found to the right in the image above.\nPageRank itself has quite a history. While its technology was in many ways beneficial, it was also very confusing, even to some expert SEOs. That's why SEL published the in depth article, “ What Is Google PageRank? ” -- very few people understood it.\nGoogle says that PageRank is what “ looks at links between pages to determine their relevance .” But SEL says it’s more like a voting system, in which inbound links to a given page count as votes toward its authority. So, the more votes, the more authority. The clincher? Anyone could view a site's PageRank.\nIn spring of 2016, Google announced that while it would still be using PageRank technology to internally adjust its algorithm, the public would no longer be able to able to view any of its data. For some, that was happy news, according to SEL and its “ retrospective on how [PageRank] ruined the web .” Apparently, PageRank's emphasis on being linked to created a lot of annoying, borderline spammy behavior -- like links becoming available for purchase.\nToday, the technology for ranking has become more discerning, thanks in large part to MozRank, which is a “ link popularity score .” To learn more about using MozRank for SEO and tracking competition, check out our HubSpot Academy guide here .\n5) There's a Google Dance -- but it's not what it sounds like. \nSource: Search Engine Land \nOur inner marketing nerds wish that \"The Google\" was actually a physical dance move. In actuality, though, Google Dance was actually the name applied to the sudden changes to its rankings, back when the algorithm used to majorly change every month . \nMarketing Land credits forum WebmasterWorld for originating the term, and also for assigning different geographically-inspired names to each dance, like \"Boston\" in February 2003 and \"Florida\" later that year. But Florida, it seems, was the last dance -- or the last salient one, anyway . That's when Google stopped making major updates to its algorithm every month, and instead started making the general under-the-radar adjustments it does today. \nBut to keep track of these changes, especially the minor ones, it can help to keep an eye on the MozCast Google Weather Report . It assigns a temperature that indicates how much the algorithm has changed since the previous day -- the higher and stormier the conditions, the greater the shift to Google's rankings. \nDon't be sad -- earlier this year, Google hosted an event at the SMX West conference called \"Google Dance\" to celebrate \" an annual gathering for search marketers .\"   \n6) There isn't *really* a reason behind the names for updates. \nSource: Wade Creative Network \nI would really love to think that there's an adorable story behind assigning the name \"Penguin\" to an algorithm update. But  according to Moz , there isn't really a formal naming method. \nSimilar to the names for Google's \"dance moves,\" WebmasterWorld users also named most of the other updates -- \"Boston,\" because it was announced at SES Boston, and others in the same way that hurricanes are named, though it's rumored that \"Dominic\" came from a Boston pizza place .  \nMoz also reports that some of the self-named algorithm updates, like \"Caffeine,\" \"Panda\" and \"Vince\" came from Google itself, and that the latter two were named after Google engineers.   \n7) Algorithms are also getting smarter for image searches. \nSource: Forbes \nRecently, Google announced the debut of the Pixel, its newest smartphone. Among its brag-worthy features? “ The highest rated smartphone camera. Ever. ”\n\nPart of what makes the camera so great are its “its world-class software algorithms,” said Google camera product lead,",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [
          {
            "name": "marcus andrews",
            "sentiment": "none"
          },
          {
            "name": "sergey brin",
            "sentiment": "none"
          },
          {
            "name": "vince",
            "sentiment": "none"
          },
          {
            "name": "brin",
            "sentiment": "none"
          },
          {
            "name": "moz",
            "sentiment": "none"
          },
          {
            "name": "larry page",
            "sentiment": "none"
          },
          {
            "name": "dominic",
            "sentiment": "none"
          },
          {
            "name": "pigeon",
            "sentiment": "none"
          }
        ],
        "organizations": [
          {
            "name": "google",
            "sentiment": "positive"
          },
          {
            "name": "forbes  recently",
            "sentiment": "none"
          },
          {
            "name": "stanford",
            "sentiment": "none"
          },
          {
            "name": "stanford infolab  google",
            "sentiment": "none"
          },
          {
            "name": "wade creative network",
            "sentiment": "none"
          },
          {
            "name": "pagerank",
            "sentiment": "none"
          },
          {
            "name": "sel",
            "sentiment": "none"
          },
          {
            "name": "google dance",
            "sentiment": "none"
          },
          {
            "name": "hubspot academy",
            "sentiment": "none"
          }
        ],
        "locations": [
          {
            "name": "ses boston",
            "sentiment": "none"
          },
          {
            "name": "boston",
            "sentiment": "none"
          },
          {
            "name": "florida",
            "sentiment": "none"
          },
          {
            "name": "penguin",
            "sentiment": "none"
          }
        ]
      },
      "crawled": "2016-11-22T13:20:02.134+02:00"
    },
    {
      "thread": {
        "uuid": "3f688446fe9d147754945ef96a9a0dc4f2d98dda",
        "url": "http://omgili.com/ri/2wGaacqxAptkyFj4CwJEV1mgC7dMLeD3tdzxKkvHZSmS02DsGFEeNsk0qx6QWard7cqOHQmTvoMBjpmkf5nzxxd3e4Bcwwnjupny8WCnft4-",
        "site_full": "mashable.com",
        "site": "mashable.com",
        "site_section": "http://mashable.com/",
        "site_categories": [
          "business"
        ],
        "section_title": "Mashable",
        "title": "Google predicts the most popular gifts this year",
        "title_full": "Google predicts the most popular gifts this year",
        "published": "2016-11-22T13:25:10.593+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "blogs",
        "country": "US",
        "spam_score": 0.186,
        "main_image": "http://a.amz.mshcdn.com/media/ZgkyMDE2LzExLzIyL2FkL0FQXzg3MTkwMjYyMjAwOS40MjIxOS5qcGcKcAl0aHVtYgkxMjAweDYzMAplCWpwZw/4ba79b39/049/AP_871902622009.jpg",
        "performance_score": 2,
        "domain_rank": 360,
        "social": {
          "facebook": {
            "likes": 256,
            "comments": 0,
            "shares": 256
          },
          "gplus": {
            "shares": 18
          },
          "pinterest": {
            "shares": 3
          },
          "linkedin": {
            "shares": 466
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "3f688446fe9d147754945ef96a9a0dc4f2d98dda",
      "url": "http://omgili.com/ri/2wGaacqxAptkyFj4CwJEV1mgC7dMLeD3tdzxKkvHZSmS02DsGFEeNsk0qx6QWard7cqOHQmTvoMBjpmkf5nzxxd3e4Bcwwnjupny8WCnft4-",
      "ord_in_thread": 0,
      "author": "Karissa Bell",
      "published": "2016-11-22T13:25:10.593+02:00",
      "title": "Google predicts the most popular gifts this year",
      "text": "Still not sure what to put at the top of your shopping list this year? Google might be able to help.\nThe company has released its predictions for what will be this season's most sought after toys and gifts and — surprise, surprise — the top results may be more than a little difficult to find.\nSEE ALSO: Amazon just killed Black Friday\nThe company used search data for the first two weeks of November to come up with its predictions and the top items may not be much of a surprise.\nTopping the list is Hatchimals , toy creatures that \"hatch\" out of an egg after you buy them. Unfortunately, you might be out of luck if you were hoping to get one in time for Santa. The toy, which typically retails for around $60, is already so popular many retailers have sold out, according to the company's website, and resellers are reportedly selling the toys for as much as $200-$300.\nNext up is another item that has already proved difficult to get: the Nintendo Entertainment System Classic Edition . The $60 mini-console is already in short supply, according to Nintendo.\nOther toys on the list may prove a bit easier to get: Baby Alive and Trolls come in at #3 and #4, respectively, and Sony's PS4 Pro (#6) may prove to be an easier find than Nintendo's throwback console.\nIf tech toys are what you're looking for, DJi's Phantom 3 and Phantom 4 drones will also be in high demand, according to Google, as will the new robot companion Cozmo also makes an appearance.\nRounding out the list are Pokémon, Num Noms and RC Cars.\nBONUS: This is how America's biggest online shopping day came to be",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [
        "http://content.jwplatform.com/thumbs/iOwLb7xX.jpg",
        "http://www.hatchimals.com/#",
        "http://content.jwplatform.com/manifests/iOwLb7xX.m3u8",
        "http://time.com/money/4578370/hatchimals-ebay-craigslist-amazon/",
        "http://www.numnoms.com/"
      ],
      "entities": {
        "persons": [
          {
            "name": "pokémon",
            "sentiment": "none"
          },
          {
            "name": "hatchimals",
            "sentiment": "none"
          },
          {
            "name": "cozmo",
            "sentiment": "none"
          }
        ],
        "organizations": [
          {
            "name": "google",
            "sentiment": "positive"
          },
          {
            "name": "sony",
            "sentiment": "none"
          },
          {
            "name": "nintendo",
            "sentiment": "none"
          },
          {
            "name": "amazon",
            "sentiment": "none"
          },
          {
            "name": "num noms",
            "sentiment": "none"
          }
        ],
        "locations": [
          {
            "name": "america",
            "sentiment": "none"
          },
          {
            "name": "santa",
            "sentiment": "none"
          }
        ]
      },
      "crawled": "2016-11-22T13:25:10.593+02:00"
    },
    {
      "thread": {
        "uuid": "284cc3d3634e52bb1d373338a13847ee916ae2d4",
        "url": "http://omgili.com/ri/jHIAmI4hxg8v3BmVd24meuL1ei1Bo_4WrNYRmTLEw2JYf2GlEG9kx9xYlqQRkAiKDbQjow0CKdmSqpPfVgcu9nh3ty6OmeBuIvwddtZ_.hU-",
        "site_full": "www.businessinsider.com",
        "site": "businessinsider.com",
        "site_section": "http://www.businessinsider.com/sai",
        "site_categories": [
          "news"
        ],
        "section_title": "Tech Insider - Business Insider",
        "title": "Google launches Good Fest music festival",
        "title_full": "Google launches Good Fest music festival - Business Insider",
        "published": "2016-11-22T19:21:14.999+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "blogs",
        "country": "US",
        "spam_score": 0.843,
        "main_image": "http://static2.businessinsider.com/image/58347b39e02ba734008b5cfa-1190-625/google-is-launching-a-music-festival-called-good-fest.jpg",
        "performance_score": 1,
        "domain_rank": 283,
        "social": {
          "facebook": {
            "likes": 118,
            "comments": 0,
            "shares": 118
          },
          "gplus": {
            "shares": 3
          },
          "pinterest": {
            "shares": 1
          },
          "linkedin": {
            "shares": 18
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "284cc3d3634e52bb1d373338a13847ee916ae2d4",
      "url": "http://omgili.com/ri/jHIAmI4hxg8v3BmVd24meuL1ei1Bo_4WrNYRmTLEw2JYf2GlEG9kx9xYlqQRkAiKDbQjow0CKdmSqpPfVgcu9nh3ty6OmeBuIvwddtZ_.hU-",
      "ord_in_thread": 0,
      "author": "Lara O'Reilly",
      "published": "2016-11-22T19:21:14.999+02:00",
      "title": "Google launches Good Fest music festival",
      "text": "Good Fest is described as a \"livestream festival for good.\" GoodHQ\nGoogle is launching a music festival called Good Fest later this month, which it is describing as a \"a first-of-its-kind livestream festival for good,\" according to the event's website.\nThe first concert will see English indie band Glass Animals perform at BAM Cafe in New York City on November 29. A further five shows will follow across four different cities in the US, all livestreamed on YouTube.\nThe concerts will raise money for non-profits through ticket sales and online donations. 100% of the ticket sales for the Glass Animals gig , for example, will go to DonorsChoose.org.\nThe Good Fest website describes the event as \"a celebration of progress, positivity, and the power of people to push the world forward.\"\nGoogle is using the event to promote its new Pixel smartphone, which will be used to record backstage footage and will be heavily referenced at the events and their promotional material.\nGood Fest has been launched in partnership with Good Media, a company that produces its own website and quarterly magazine and forms media partnerships designed to create social impact. Essence, Google's digital agency, is also helping produce and promote the event.\nWhile the Good Fest website makes no reference to the current political climate, the timing of the launch is likely not coincidental.\nFuture events as part of the festival are being billed as played for \"humanity,\" \"earth,\"equality,\" and \"love.\" Upcoming concerts will include artists such as Gogol Bordello and D.R.A.M.\nGoogle was not immediately available to comment.\nNOW WATCH: Scientists have discovered why American honey bees are turning into zombies Loading video... More: Google Good",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [
        "https://goodfest.good.is/",
        "https://www.eventbrite.com/e/goodfest-glass-animals-and-preservation-hall-at-bam-cafe-tickets-29533446333"
      ],
      "entities": {
        "persons": [],
        "organizations": [
          {
            "name": "google",
            "sentiment": "positive"
          },
          {
            "name": "gogol bordello",
            "sentiment": "none"
          },
          {
            "name": "youtube",
            "sentiment": "none"
          }
        ],
        "locations": [
          {
            "name": "new york city",
            "sentiment": "none"
          },
          {
            "name": "us",
            "sentiment": "none"
          },
          {
            "name": "bam cafe",
            "sentiment": "none"
          }
        ]
      },
      "crawled": "2016-11-22T19:21:14.999+02:00"
    },
    {
      "thread": {
        "uuid": "841cf3331666d8f308c511e1dafd8becc4df94f7",
        "url": "http://omgili.com/ri/jHIAmI4hxg8v3BmVd24meuL1ei1Bo_4WrNYRmTLEw2L.wqxgUpjGH.2.PFGC0h9GexKWzvwSAV5zbyKkuU0S94G0ma5e_J3ZxG3avMDJYCnvOVq7FmC1Gw--",
        "site_full": "www.businessinsider.com",
        "site": "businessinsider.com",
        "site_section": "http://feedproxy.google.com/typepad/alleyinsider/silicon_alley_insider",
        "site_categories": [
          "news"
        ],
        "section_title": "Tech Insider",
        "title": "There's an incredibly detailed Google map of everywhere you've been",
        "title_full": "There's an incredibly detailed Google map of everywhere you've been",
        "published": "2016-11-22T20:24:51.728+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "blogs",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "http://static1.businessinsider.com/image/57d02f208ceb95f85878a3cf-1190-625/theres-an-incredibly-detailed-google-map-of-everywhere-youve-been.jpg",
        "performance_score": 2,
        "domain_rank": 283,
        "social": {
          "facebook": {
            "likes": 215,
            "comments": 0,
            "shares": 215
          },
          "gplus": {
            "shares": 2
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 30
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "841cf3331666d8f308c511e1dafd8becc4df94f7",
      "url": "http://omgili.com/ri/jHIAmI4hxg8v3BmVd24meuL1ei1Bo_4WrNYRmTLEw2L.wqxgUpjGH.2.PFGC0h9GexKWzvwSAV5zbyKkuU0S94G0ma5e_J3ZxG3avMDJYCnvOVq7FmC1Gw--",
      "ord_in_thread": 0,
      "author": "Chris Snyder",
      "published": "2016-11-22T20:24:51.728+02:00",
      "title": "There's an incredibly detailed Google map of everywhere you've been",
      "text": "embed \nThere's a setting in your Google account, which — when turned on — creates a record of everywhere you go and when you went there. It's intended to make your Google Maps experience more useful, like providing a faster commute to work or home. In 2015, the company also started rolling out another feature called \"Timeline,\" which lets you easily view this information on a private, customizable map of your every move. Here's how to access it and turn it off in case it creeps you out. \nFollow Tech Insider: On Facebook Most Popular",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [],
        "organizations": [
          {
            "name": "google",
            "sentiment": "positive"
          }
        ],
        "locations": []
      },
      "crawled": "2016-11-22T20:24:51.728+02:00"
    },
    {
      "thread": {
        "uuid": "9c6423545c8ca463fdd8db76e6e73326f2a775e5",
        "url": "http://omgili.com/ri/jHIAmI4hxg8w7niuyAyflFlwVidy6u4L.xntkqQp8Ryck93L5Atz.0Jw29TmoQFpMfkxNXsgmqLciWSRYHri0S5GR.WuFXFA14VlB0xG7q6MmRH0mwYGHfflEjwqPQha5Ml3p2hx2DG2wBf.k.qvtahbTpkbAnTF",
        "site_full": "www.bostonglobe.com",
        "site": "bostonglobe.com",
        "site_section": "http://www.bostonglobe.com/",
        "site_categories": [
          "news"
        ],
        "section_title": "The Boston Globe",
        "title": "‘Manchester by the Sea’ is a place that we all know well",
        "title_full": "‘Manchester by the Sea’ is a place that we all know well - The Boston Globe",
        "published": "2016-11-22T02:00:00.000+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "news",
        "country": "US",
        "spam_score": 0.071,
        "main_image": "http://www.bostonglobe.com/rf/image_585w/Boston/2011-2020/2016/11/16/BostonGlobe.com/Arts/Images/MBTS_2711_Credit_ClaireFolger,CourtesyofAmazonStudiosandRoadsideAttractions1467243361-1741.jpg",
        "performance_score": 5,
        "domain_rank": 2402,
        "social": {
          "facebook": {
            "likes": 588,
            "comments": 0,
            "shares": 588
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "9c6423545c8ca463fdd8db76e6e73326f2a775e5",
      "url": "http://omgili.com/ri/jHIAmI4hxg8w7niuyAyflFlwVidy6u4L.xntkqQp8Ryck93L5Atz.0Jw29TmoQFpMfkxNXsgmqLciWSRYHri0S5GR.WuFXFA14VlB0xG7q6MmRH0mwYGHfflEjwqPQha5Ml3p2hx2DG2wBf.k.qvtahbTpkbAnTF",
      "ord_in_thread": 0,
      "author": "",
      "published": "2016-11-22T02:00:00.000+02:00",
      "title": "‘Manchester by the Sea’ is a place that we all know well",
      "text": " Google+\nClaire Folger/Amazon Studios and Roadside Attractions\nCasey Affleck in “Manchester by the Sea.”\nBy Ty Burr Globe staff November 23, 2016\nNothing destroys an audience’s appreciation of a small good movie like advance praise. At this time of the year, we’re hyped to expect award-winning productions, big messages, and sweeping emotions, and if the film in question comes with four-star reviews and nouns like “masterpiece,” it had better play along or people will want a refund. By contrast, a handmade human tragedy about the kind of people you see at the supermarket needs to sneak up on you if it’s to work its magic. Even if it’s a masterpiece.\nSo I won’t tell you that I’ve seen “Manchester by the Sea” twice now and both times felt haunted for weeks. I won’t tell you it made me cry, because if you see it and you don’t cry you’ll probably think more about that than about the movie, and that’s not fair. I won’t tell you that it’s a ghost story about a man who’s still alive, or that it’s profanely funny about the way that men in New England traditionally profess their love for one another, i.e. with bitter sarcasm and foul language.\nAdvertisement\nI won’t tell you that Casey Affleck comes finally and fully out of his brother’s shadow and into his own as Lee Chandler, an apartment janitor on the South Shore who’s fleeing from what happened to him on the North. That Lee gets called back home when his older brother Joe (Kyle Chandler) dies of a bad heart, leaving behind a fishing boat with engine problems and a lanky, mouthy 16-year-old son, Patrick (newcomer Lucas Hedges). That when they see he’s back in town, people nudge and point and say “ That’s Lee Chandler?” “The very one.” And that, about midway through, “Manchester by the Sea” tells us the particulars of Lee’s past as if disgorging a terrible family secret, so that you suddenly understand why he prefers to sit miles away in Quincy bars, ignoring the women who hit on him while picking fights with the men.\nI won’t bother you with how the movie stands as a soul-satisfying comeback for its maker, playwright-turned-writer-director Kenneth Lonergan, who staked a claim on a brilliant career a decade and a half ago with “You Can Count on Me,” the film that made stars of Laura Linney and Mark Ruffalo, only to see his 2005 follow-up, “Margaret,” sit on the shelf for six years before its studio released a butchered cut. (A three-hour director’s edition of “Margaret” is available on DVD and Amazon Video; earlier this year a poll of international film critics named that version one of the 100 best films of the 21st century.)\nGet The Weekender in your inbox: The Globe's top picks for what to see and do each weekend, in Boston and beyond. Sign Up Thank you for signing up! Sign up for more newsletters here I needn’t explain that Lonergan and his cast get the look and sound of people in these parts without seeming to try very hard; that even if you believe there are no real townies in the town of Manchester-by-the-Sea, this movie convinces you there should be; that no one leans hard on the accents except poor Tate Donovan as the nephew’s hockey coach (excuse me, “ hahkey coach”); that all the small parts are cast with people who look like they really live here, whether it’s the lapsed preppie small-town estate lawyer played by Josh Hamilton or Hedges as the nephew, a kid who has two girlfriends, a truly awful garage band (“We are... Stentorian”), and no patience for his sullen, withdrawn uncle.\nI could say, but I won’t, that we’ve all seen too many movies in which a lost soul comes out of his shell and rejoins the human race after he inherits a kid from a dead relative. I won’t say that everyone here is more interested in how that might play out if the lost soul was just too damned lost. I could say that Affleck’s Lee Chandler, terse, distant, and sardonic, reminds me, and may remind you, of childhood friends who’ve lost their way and never come back; that the sadness of “Manchester by the Sea” is the kind of sadness that makes you feel more alive, rather than less, to the preciousness of things.\nI could talk about the lovely classical score that is Lonergan’s one false move, in that it matches the movie’s chilly scenes of winter but not the emotional reality of the characters’ lives, not really. But I could also talk about a meeting of Lee and his ex-wife, played by Michelle Williams, that threatens to turn on the suds but instead lets two people who once loved each other acknowledge what they’ve lost. I could talk about Gretchen Mol as the nephew’s mother, another damaged soul climbing back from the bottle one frightened step at a time. And I could talk about the scene late in the film in which Lee exhales in the hush of a nighttime kitchen, looks his fate in the eye, and you realize that you’re looking at a hero, a Sisyphus of the North Shore, and also at a broken man.\nAdvertisement\nIf I do tell you all this, forget I ever did. Just remember you heard somewhere that “Manchester by the Sea” is an experience worth having, not for the magnificence of its impact or the far-flung grandeur of its settings but for the way it illuminates with quiet, unyielding grace how you and I and our neighbors get by, and sometimes how we don’t.\n★ ★ ★ ★\nMANCHESTER BY THE SEA\nWritten and directed by Kenneth Lonergan. Starring Casey Affleck, Lucas Hedges, Michelle Williams, Kyle Chandler. At Kendall Square, Coolidge Corner, West Newton. 137 minutes. R (language throughout, some sexual content).\nTy Burr can be reached ty_burr@globe.com .",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [
        "https://plus.google.com/share?url=http%3A%2F%2Fwww.bostonglobe.com%2Farts%2F2016%2F11%2F22%2Fmanchester-sea-place-that-all-know-well%2FZcAhliBtsc91ZkCtmNf1NK%2Fstory.html%3Fevent%3Devent25%26s_campaign%3dsm_gp%26hl=en-US",
        "http://www.facebook.com/sharer.php?u=http%3A%2F%2Fwww.bostonglobe.com%2Farts%2F2016%2F11%2F22%2Fmanchester-sea-place-that-all-know-well%2FZcAhliBtsc91ZkCtmNf1NK%2Fstory.html%3Fevent%3Devent25&t=‘Manchester",
        "http://www.linkedin.com/shareArticle?mini=true&url=http%3A%2F%2Fwww.bostonglobe.com%2Farts%2F2016%2F11%2F22%2Fmanchester-sea-place-that-all-know-well%2FZcAhliBtsc91ZkCtmNf1NK%2Fstory.html%3Fevent%3Devent25&title=‘Manchester",
        "http://twitter.com/intent/tweet?text=‘Manchester",
        "http://www.facebook.com/sharer.php?u=http%3A%2F%2Fwww.bostonglobe.com%2Farts%2F2016%2F11%2F22%2Fmanchester-sea-place-that-all-know-well%2FZcAhliBtsc91ZkCtmNf1NK%2Fstory.html%3Fevent%3Devent25%3Fevent%3Devent25&t‘Manchester"
      ],
      "entities": {
        "persons": [
          {
            "name": "casey affleck",
            "sentiment": "positive"
          },
          {
            "name": "lee chandler",
            "sentiment": "none"
          },
          {
            "name": "michelle williams",
            "sentiment": "none"
          },
          {
            "name": "kenneth lonergan",
            "sentiment": "none"
          },
          {
            "name": "margaret",
            "sentiment": "none"
          },
          {
            "name": "tate donovan",
            "sentiment": "none"
          },
          {
            "name": "joe",
            "sentiment": "none"
          },
          {
            "name": "lee",
            "sentiment": "none"
          },
          {
            "name": "laura linney",
            "sentiment": "none"
          },
          {
            "name": "patrick",
            "sentiment": "none"
          },
          {
            "name": "lonergan",
            "sentiment": "none"
          },
          {
            "name": "lucas hedges",
            "sentiment": "none"
          },
          {
            "name": "mark ruffalo",
            "sentiment": "none"
          },
          {
            "name": "affleck",
            "sentiment": "none"
          },
          {
            "name": "ty burr",
            "sentiment": "none"
          },
          {
            "name": "josh hamilton",
            "sentiment": "none"
          },
          {
            "name": "gretchen mol",
            "sentiment": "none"
          },
          {
            "name": "kyle chandler",
            "sentiment": "none"
          }
        ],
        "organizations": [
          {
            "name": "google",
            "sentiment": "positive"
          },
          {
            "name": "claire folger/amazon studios",
            "sentiment": "positive"
          },
          {
            "name": "ty burr globe",
            "sentiment": "none"
          },
          {
            "name": "manchester",
            "sentiment": "none"
          },
          {
            "name": "amazon video",
            "sentiment": "none"
          },
          {
            "name": "globe",
            "sentiment": "none"
          }
        ],
        "locations": [
          {
            "name": "manchester",
            "sentiment": "none"
          },
          {
            "name": "manchester-by-the-sea",
            "sentiment": "none"
          },
          {
            "name": "south shore",
            "sentiment": "none"
          },
          {
            "name": "north shore",
            "sentiment": "none"
          },
          {
            "name": "kendall square",
            "sentiment": "none"
          },
          {
            "name": "west newton",
            "sentiment": "none"
          },
          {
            "name": "coolidge corner",
            "sentiment": "none"
          },
          {
            "name": "new england",
            "sentiment": "none"
          },
          {
            "name": "boston",
            "sentiment": "none"
          },
          {
            "name": "quincy",
            "sentiment": "none"
          }
        ]
      },
      "crawled": "2016-11-22T22:27:41.686+02:00"
    },
    {
      "thread": {
        "uuid": "f72ecf58191f31ea3606780e531585d6d02c8d98",
        "url": "http://omgili.com/ri/jHIAmI4hxg8w7niuyAyflFlwVidy6u4LS9kvx0qq_IKtvJG87mVGIpL0E6BrrjKqLNLXsBDhT.sYmbvERwhOO.BxQEHOX6Hzajw60bWhg4CMUyZiHkyKC820qUqVGv.T_Cmcfy_WmRKFsNj9VhQB4tWOB3CaoRqsdhmpp9lgj89CDYiihI9nwA--",
        "site_full": "www.bostonglobe.com",
        "site": "bostonglobe.com",
        "site_section": "http://www.bostonglobe.com/",
        "site_categories": [
          "news"
        ],
        "section_title": "The Boston Globe",
        "title": "One chart captures alarming decline in sea ice",
        "title_full": "One chart captures alarming decline in sea ice - The Boston Globe",
        "published": "2016-11-22T02:00:00.000+02:00",
        "replies_count": 2,
        "participants_count": 3,
        "site_type": "news",
        "country": "US",
        "spam_score": 0.005,
        "main_image": "http://www.bostonglobe.com/rf/image_585w/Boston/2011-2020/2016/11/22/BostonGlobe.com/EditorialOpinion/Images/1123graph-1744.jpg",
        "performance_score": 4,
        "domain_rank": 2402,
        "social": {
          "facebook": {
            "likes": 469,
            "comments": 0,
            "shares": 469
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 30
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "f72ecf58191f31ea3606780e531585d6d02c8d98",
      "url": "http://omgili.com/ri/jHIAmI4hxg8w7niuyAyflFlwVidy6u4LS9kvx0qq_IKtvJG87mVGIpL0E6BrrjKqLNLXsBDhT.sYmbvERwhOO.BxQEHOX6Hzajw60bWhg4CMUyZiHkyKC820qUqVGv.T_Cmcfy_WmRKFsNj9VhQB4tWOB3CaoRqsdhmpp9lgj89CDYiihI9nwA--",
      "ord_in_thread": 0,
      "author": "bostonglobe",
      "published": "2016-11-22T02:00:00.000+02:00",
      "title": "One chart captures alarming decline in sea ice",
      "text": " Google+\nBy Bill McKibben November 22, 2016\nSometimes a single image captures a moment — in a picture, or a snippet of video. Or, more rarely, a scientific chart. Here’s one that sent corners of the Internet into a mild tizzy over the last few days.\nDespite the spaghetti tangle of lines, it’s a pretty simple chart. What it shows is the total area of global sea ice, as measured by satellites dating back to 1979. The red line at the bottom is this year, with six weeks still to go.\nAdvertisement\nAnd it’s disturbing, of course, because this year’s line is very different. It’s not following the normal pattern — there’s a lot less ice.\nIf you look behind the numbers, you find that the volume of both Arctic and Antarctic sea ice is extremely low for the date — and the fact that it’s happening at both poles is what makes the chart so dramatic. It seems to imply that something very unusual is happening.\nGet Today's Headlines in your inbox: The day's top stories delivered every morning Sign Up Thank you for signing up! Sign up for more newsletters here That something is climate change. 2014 was the warmest year on record, until 2015 came along, and it held the record until, well, 2016, which will officially be certified as the champion in a few weeks. We only have temperature records that go back to the late 19th century, but the scientists who study the proxy records of things like tree rings or coral reefs are pretty confident that this year is the hottest in the 10,000-year history of human civilization. The carbon dioxide and methane we’ve released by burning coal and gas and oil have now raised the temperature more than a full degree Centigrade.\nView Story Sea ice hits record lows at both poles. What does it mean? It’s the first time scientists have tracked record low ice levels around each pole simultaneously.\nWhich may well have taken us past certain thresholds. Arctic sea ice has been dwindling for decades now — we’ve lost areas of summer ice measured in units like Texas and Alaska. In the Antarctic, for a variety of complicated reasons, sea ice has risen and fallen dramatically, but last spring researchers said the great ice sheets of the frozen continent had reached a tipping point and that the slide of much of that ice into the ocean was now irreversible, with profound consequences for the sea level in coastal cities like, oh, Boston.\nBut it’s the combination of the meteorological with the political that really captured people’s attention, I think. In the weeks after the shocking presidential election, it felt as if everything had changed, even if not that much had really shifted yet. That profound uneasiness — in some cases even among people who had voted for Trump on the theory that he’d shake things up — makes the mounting evidence of climate change feel even more dangerous.\nAdvertisement\nBecause all of a sudden our leaders are not even paying lip service to the looming crisis that anyone with a smidgen of scientific knowledge can clearly see. In the Obama years we may not have done a great deal about climate change, but our government said the right words, and reached modest agreements, like the one in Paris a year ago, that set us on a new trajectory. Not, it must be said, a trajectory steep enough to solve the problem, but there was something soothing about the fact that we were taking action at all.\nNow that balm is gone. We’re confronted, in Mr. Trump, with a man who holds his unscientific views with no apparent hesitation or qualm. In his version of reality, climate change is BS invented by the Chinese; his appointees to key offices have expressed the same views. And so the small comfort of even small action is gone.\nThose of us who value the future must, of course, continue to push as hard as we can. Increasingly we’ll place our hopes in state and local action, and in trying to cajole or force corporations to act where government won’t: Efforts like the one to get Bay State lawmakers to divest the Commonwealth’s holdings from fossil fuel companies have never been more important. But there’s no denying the clarity this moment provides, the picture of our possible and even likely future. Charts like the one accompanying this column (and there are thousands, on every topic from drought to flood to ocean acidification) seem even starker now. We really are living in a new world.\nBill McKibben is founder of the climate campaign 350.org, and the Schumann Distinguished Scholar in Environmental Studies at Middlebury College.",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [
        "http://www.facebook.com/sharer.php?u=http%3A%2F%2Fwww.bostonglobe.com%2Fopinion%2Fcolumns%2F2016%2F11%2F22%2Fone-chart-captures-alarming-decline-sea-ice%2Fndn2lcr80WxKfetCfbzDsI%2Fstory.html%3Fevent%3Devent25%3Fevent%3Devent25&tThis",
        "http://www.linkedin.com/shareArticle?mini=true&url=http%3A%2F%2Fwww.bostonglobe.com%2Fopinion%2Fcolumns%2F2016%2F11%2F22%2Fone-chart-captures-alarming-decline-sea-ice%2Fndn2lcr80WxKfetCfbzDsI%2Fstory.html%3Fevent%3Devent25&title=This",
        "http://twitter.com/intent/tweet?text=This",
        "http://www.facebook.com/sharer.php?u=http%3A%2F%2Fwww.bostonglobe.com%2Fopinion%2Fcolumns%2F2016%2F11%2F22%2Fone-chart-captures-alarming-decline-sea-ice%2Fndn2lcr80WxKfetCfbzDsI%2Fstory.html%3Fevent%3Devent25&t=This",
        "https://plus.google.com/share?url=http%3A%2F%2Fwww.bostonglobe.com%2Fopinion%2Fcolumns%2F2016%2F11%2F22%2Fone-chart-captures-alarming-decline-sea-ice%2Fndn2lcr80WxKfetCfbzDsI%2Fstory.html%3Fevent%3Devent25%26s_campaign%3dsm_gp%26hl=en-US"
      ],
      "entities": {
        "persons": [
          {
            "name": "bill mckibben",
            "sentiment": "positive"
          },
          {
            "name": "trump",
            "sentiment": "none"
          },
          {
            "name": "obama",
            "sentiment": "none"
          }
        ],
        "organizations": [
          {
            "name": "google",
            "sentiment": "positive"
          },
          {
            "name": "middlebury college",
            "sentiment": "none"
          },
          {
            "name": "bay state",
            "sentiment": "none"
          }
        ],
        "locations": [
          {
            "name": "arctic sea",
            "sentiment": "none"
          },
          {
            "name": "paris",
            "sentiment": "none"
          },
          {
            "name": "boston",
            "sentiment": "none"
          },
          {
            "name": "alaska",
            "sentiment": "none"
          },
          {
            "name": "texas",
            "sentiment": "none"
          },
          {
            "name": "antarctic sea",
            "sentiment": "none"
          },
          {
            "name": "antarctic",
            "sentiment": "none"
          },
          {
            "name": "arctic",
            "sentiment": "none"
          }
        ]
      },
      "crawled": "2016-11-22T22:29:08.130+02:00"
    },
    {
      "thread": {
        "uuid": "40de0ec2dd67367ed707bdd0b457d133afc5168a",
        "url": "http://omgili.com/ri/jHIAmI4hxg.aX6RsjGyewXaF650x_J7FQ3_xTZytttTjq2xzLpasjzVXHPctmLdkcQXyKkLExnSu754DNLt8M6.n7FtBpX03",
        "site_full": "www.androidauthority.com",
        "site": "androidauthority.com",
        "site_section": "http://www.androidauthority.com",
        "site_categories": [
          "news",
          "tech"
        ],
        "section_title": "Android Authority",
        "title": "Re-Volt3, a new RC car game for Android, speeds into the Google Play Store",
        "title_full": "Re-Volt3, a new RC car game for Android, speeds into the Google Play Store",
        "published": "2016-11-23T04:40:15.047+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "blogs",
        "country": "US",
        "spam_score": 0.0,
        "main_image": null,
        "performance_score": 2,
        "domain_rank": 1848,
        "social": {
          "facebook": {
            "likes": 277,
            "comments": 0,
            "shares": 277
          },
          "gplus": {
            "shares": 10
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "40de0ec2dd67367ed707bdd0b457d133afc5168a",
      "url": "http://omgili.com/ri/jHIAmI4hxg.aX6RsjGyewXaF650x_J7FQ3_xTZytttTjq2xzLpasjzVXHPctmLdkcQXyKkLExnSu754DNLt8M6.n7FtBpX03",
      "ord_in_thread": 0,
      "author": "John Callaham",
      "published": "2016-11-23T04:40:15.047+02:00",
      "title": "Re-Volt3, a new RC car game for Android, speeds into the Google Play Store",
      "text": "\nPlaying with remote control cars is fun for all ages, and developer WeGo Interactive tapped into that well of entertainment with the first two games in its Re-Volt series of mobile games. Today, the developer officially launched its latest free-to-play entry in the series, Re-Volt3, for Android devices in the Google Play Store.\nSee also: Best free Android games of 2016! 2 weeks ago You’ll have access to over 50 RC cars in Re-Volt3, including regular racing vehicles along with buggies and monster trucks. Players can customize the look of their RC cars with a variety of paint colors and skins, and they can upgrade certain parts to get more performance.\nWeGo Interactive says Re-Volt3 has more realistic looking graphics and improvement in its controls compared to previous games in this series. It includes a single player storyline mode with over 100 stages to complete, with rewards to be won from completing achievements and going up in the rankings. The game also has online multiplayer features, allowing players to compete with other from around the world in a variety of game modes.\nIf you are a fan of the first two Re-Volt games, what do you think of WeGo’s work on Re-Volt3? Let us know your thoughts in the comments!\nGet it at Google Play ",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [
          {
            "name": "wego",
            "sentiment": "none"
          }
        ],
        "organizations": [
          {
            "name": "google",
            "sentiment": "positive"
          },
          {
            "name": "google play store",
            "sentiment": "none"
          },
          {
            "name": "wego interactive",
            "sentiment": "none"
          }
        ],
        "locations": []
      },
      "crawled": "2016-11-23T04:40:15.047+02:00"
    },
    {
      "thread": {
        "uuid": "b92297ce5aff15b6c8256c9ecfb88555d3b7eec1",
        "url": "http://omgili.com/ri/.wHSUbtEfZT4nKbDUJCUNDdTa_8D8tEwUx5pO14VsxTD1fVkjFUhBa.ywjhKwQro3oIwsd3UNmY-",
        "site_full": "www.techinasia.com",
        "site": "techinasia.com",
        "site_section": "https://www.techinasia.com",
        "site_categories": [
          "news",
          "education",
          "business"
        ],
        "section_title": "Tech in Asia",
        "title": "His startup provides a vital service to Google and BMW. Here’s what he has to say.",
        "title_full": "His startup provides a vital service to Google and BMW. Here’s what he has to say.",
        "published": "2016-11-24T12:35:32.123+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "blogs",
        "country": "US",
        "spam_score": 0.0,
        "main_image": null,
        "performance_score": 1,
        "domain_rank": 6989,
        "social": {
          "facebook": {
            "likes": 195,
            "comments": 0,
            "shares": 195
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 100
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "b92297ce5aff15b6c8256c9ecfb88555d3b7eec1",
      "url": "http://omgili.com/ri/.wHSUbtEfZT4nKbDUJCUNDdTa_8D8tEwUx5pO14VsxTD1fVkjFUhBa.ywjhKwQro3oIwsd3UNmY-",
      "ord_in_thread": 0,
      "author": "Osman Husain",
      "published": "2016-11-24T12:35:32.123+02:00",
      "title": "His startup provides a vital service to Google and BMW. Here’s what he has to say.",
      "text": "Copyright: ellagrin / 123RF. \nApplause is a global titan in the digital experience space. It’s raised a total of US$115 million in funding; counts brands like Google, Amazon, and BMW as clients; and works with a community of over 250,000 software testers to constantly improve its product.\nThe startup’s strength lies in helping developers understand how their apps might be perceived by real users. It takes the focus away from laboratory settings and plugs them into the real world, allowing companies to uncover bugs and improve design based on user feedback.\nApplause may now have the financial muscle to attract some of the best and brightest in the world. But its origins were far more modest – co-founders Roy Solomon and Doron Reuveni started up in a small apartment, bootstrapping until they were able to convince investors to take a bet on them.\nRoy Solomon\nRoy explains the creative spark behind the idea came after “frustration with the status quo.” He’s a former product executive, responsible for quality assurance but wasn’t convinced that existing systems were improving the likelihood of a seamless digital experience.\n“I came up with a crowdsourced model to see how the digital product is experienced by customers and test it with them,” he adds. “I realized how valuable other companies would find it to have assurance that their apps and websites would be successful in the hands of real users, not just in a testing lab.”\nFocusing on users In the early days, the startup concentrated mostly on customer development. Roy and team were attentive to what early users had to say about the product, a judicious approach that helped them reap significant rewards. Customer feedback was incorporated into the model early on with pivots as and when necessary.\n“Listening to our customers is why we have grown at the rate since we launched in 2008 and why the world’s biggest brands work with us now,” affirms Roy.\nThings got slightly easier for Applause after it managed to lock in a seed round. Roy hints the team was full of great salespeople; they managed to get 20 companies to commit to using the platform even before it was totally ready.\nThe founders used this momentum to convince investors of their grand vision to shake up several verticals. Another defining moment in their journey was after they snared Google, impressed them with their work, and never looked back.\n“Digital experiences are the gateway to brands. If someone has a bad digital experience, they’re off to your competitor – often with no switching cost at all,” says Roy. “We’re helping companies understand how those experiences play out and how your users will actually engage with them.”\nPhoto credit: sutichak / 123RF .\nBuilding products Applause may have started with just websites and mobile apps, but now it’s also delving into wearables, internet-connected devices, and smart cars. In a recent collaboration with BMW, the startup helped the iconic German car manufacturer bridge the gap between the needs of its technology engineers and usability requirements.\n“Having someone to look at these apps who has never used them before, that was really something new,” says Christian Schmid, senior advanced technology engineer at BMW.\nThe startup raised a US$35 million series F round led by Credit Suisse and Accenture last month, but Roy is tight-lipped on the valuation figure. He does, however, claim that they’re the largest player in the crowdtesting space and they’ve doubled in size since last year in European markets.\nWhat’s the secret sauce? So what advice does he have for other budding entrepreneurs, raring to quit their jobs and work on killer ideas?\n“Focus on building customer relationships. If you listen carefully, they will tell you exactly what they need and how they can consume it,” he explains. “Don’t fall in love with your ideas – fall in love with the right idea to solve what you hear from your customers is their problem.”\nAt the same time, Roy believes it’s important for founders to build and support their vision. To grow a company into one that lasts, it’s critical to pay attention to the details – such as hiring smartly and understanding where the market is headed.\nStriking a balance between the big picture and the small steps needed to get there is pivotal, he affirms. It’s an approach that can help smaller companies capitalize on huge opportunities.\n“By not remaining blind while listening to only your own opinions, you can find the secret sauce that works for you and can turn your casual customers into raving fans and ambassadors of your brand.”\nThis post His startup provides a vital service to Google and BMW. Here’s what he has to say. appeared first on Tech in Asia.\n",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [
          {
            "name": "roy",
            "sentiment": "none"
          },
          {
            "name": "accenture",
            "sentiment": "none"
          },
          {
            "name": "christian schmid",
            "sentiment": "none"
          },
          {
            "name": "doron reuveni",
            "sentiment": "none"
          },
          {
            "name": "roy solomon roy",
            "sentiment": "none"
          },
          {
            "name": "roy solomon",
            "sentiment": "none"
          }
        ],
        "organizations": [
          {
            "name": "google",
            "sentiment": "positive"
          },
          {
            "name": "bmw",
            "sentiment": "none"
          },
          {
            "name": "amazon",
            "sentiment": "none"
          },
          {
            "name": "credit suisse",
            "sentiment": "none"
          }
        ],
        "locations": [
          {
            "name": "asia",
            "sentiment": "none"
          }
        ]
      },
      "crawled": "2016-11-24T12:35:32.123+02:00"
    },
    {
      "thread": {
        "uuid": "289648900048a7e923bac2f2939ad005da4f77b6",
        "url": "http://omgili.com/ri/8HG_hanVOKw042PJks0n5Co9Eavq_tDTCm5kMjT.n0zvyIw8w0oT9z2PRl0gJeZC2rKWWzNd2EoDG4zgXLzgYw0RDy1nb.vT",
        "site_full": "phandroid.com",
        "site": "phandroid.com",
        "site_section": "http://feeds2.feedburner.com/AndroidPhoneFans",
        "site_categories": [
          "tech"
        ],
        "section_title": "Phandroid",
        "title": "Google is offering 4 free months of Play Music and YouTube Red",
        "title_full": "Google is offering 4 free months of Play Music and YouTube Red",
        "published": "2016-11-25T17:15:52.559+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "news",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "http://phandroid.s3.amazonaws.com/wp-content/uploads/2014/06/Google-Play-Music-5.6-DSC06068-640x426.jpg",
        "performance_score": 3,
        "domain_rank": 14390,
        "social": {
          "facebook": {
            "likes": 367,
            "comments": 0,
            "shares": 367
          },
          "gplus": {
            "shares": 19
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "289648900048a7e923bac2f2939ad005da4f77b6",
      "url": "http://omgili.com/ri/8HG_hanVOKw042PJks0n5Co9Eavq_tDTCm5kMjT.n0zvyIw8w0oT9z2PRl0gJeZC2rKWWzNd2EoDG4zgXLzgYw0RDy1nb.vT",
      "ord_in_thread": 0,
      "author": "Joe Fedewa",
      "published": "2016-11-25T17:15:52.559+02:00",
      "title": "Google is offering 4 free months of Play Music and YouTube Red",
      "text": "Joe Fedewa Nov 25th, 2016 \nThe season of giving is upon us and Google is getting in the spirit with an awesome deal on a Play Music subscription. New customers can get 4(!) months of Play Music for free. This also includes YouTube Red and all that goes with it. Just in time to listen to all that Holiday music. \nIf you don’t want to pay the $9.99 per month after that, you can cancel at any time and still enjoy the full 4 months. The offer is only available for new customers. If you currently have a subscription, you won’t be able to tack on 4 months. It should even work if you had a subscription in the past (it worked for me). Head to this link to snag this amazing deal before it ends. We don’t know how long it will last.",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [
          {
            "name": "joe fedewa nov",
            "sentiment": "positive"
          }
        ],
        "organizations": [
          {
            "name": "google",
            "sentiment": "positive"
          },
          {
            "name": "youtube red",
            "sentiment": "none"
          }
        ],
        "locations": []
      },
      "crawled": "2016-11-25T17:15:52.559+02:00"
    },
    {
      "thread": {
        "uuid": "03b6175faf325c81db0fed51f2352f13d876a5a7",
        "url": "http://omgili.com/ri/jHIAmI4hxg9ibLms25NnVImzYjE9lMy4NNFkPjwXfnAfZDVRd70luTigVD6KqZelv4D8ZddIdqfh6l6QT7Uz6vu85gn0U5MduAVAQirioKdhBXme7NcyuvfLbcQHxUrS",
        "site_full": "www.itv.com",
        "site": "itv.com",
        "site_section": "http://www.itv.com/news/london/",
        "site_categories": [
          "entertainment"
        ],
        "section_title": "Latest London News - ITV News",
        "title": "15 'illegal immigrants' detained at M25 services",
        "title_full": "15 'illegal immigrants' detained at M25 services | London - ITV News",
        "published": "2016-11-27T23:23:00.000+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "news",
        "country": "US",
        "spam_score": 0.085,
        "main_image": "http://news.images.itv.com/image/file/1158595/img.jpg",
        "performance_score": 8,
        "domain_rank": 2701,
        "social": {
          "facebook": {
            "likes": 839,
            "comments": 0,
            "shares": 839
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "03b6175faf325c81db0fed51f2352f13d876a5a7",
      "url": "http://omgili.com/ri/jHIAmI4hxg9ibLms25NnVImzYjE9lMy4NNFkPjwXfnAfZDVRd70luTigVD6KqZelv4D8ZddIdqfh6l6QT7Uz6vu85gn0U5MduAVAQirioKdhBXme7NcyuvfLbcQHxUrS",
      "ord_in_thread": 0,
      "author": "itv.com",
      "published": "2016-11-27T23:23:00.000+02:00",
      "title": "15 'illegal immigrants' detained at M25 services",
      "text": "15 'Illegal immigrants' detained at M25 services. Credit: Google Street View Fifteen people believed to be illegal immigrants were detained for \"illegal entry to the UK\" at a service station on the M25.\nThe 15 people included family of three and a child who was referred to social services.\nRPU - Surrey Police @SurreyRoadCops Follow Units currently dealing with 15 persons detained for illegal entry to the UK at #M25 Clackett Lane Services.\n20:51 - 26 Nov 2016 Retweet Reply Favourite A spokesperson for the Home Office said immigration officers were sent to the services between Junction 5 for Godstone and Junction 6 for Sevenoaks, Kent, after an alert came from Surrey Police.\nA total of 15 people, presenting themselves as Iraqi and Iranian nationals, were discovered at the scene and are currently awaiting interview by immigration officials.\n– Home Office spokesperson London",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [
        "http://pbs.twimg.com/profile_images/792660354190995458/fSg5c9ER_normal.jpg",
        "https://twitter.com/#!/search?q=%23M25",
        "https://twitter.com/SurreyRoadCops/status/802615787857055747"
      ],
      "entities": {
        "persons": [],
        "organizations": [
          {
            "name": "google",
            "sentiment": "positive"
          },
          {
            "name": "kent",
            "sentiment": "none"
          },
          {
            "name": "clackett lane services",
            "sentiment": "none"
          },
          {
            "name": "home office",
            "sentiment": "none"
          },
          {
            "name": "surrey police",
            "sentiment": "none"
          }
        ],
        "locations": [
          {
            "name": "uk",
            "sentiment": "none"
          },
          {
            "name": "london",
            "sentiment": "none"
          },
          {
            "name": "sevenoaks",
            "sentiment": "none"
          }
        ]
      },
      "crawled": "2016-11-28T06:21:55.115+02:00"
    },
    {
      "thread": {
        "uuid": "b28ae5891c6164efe4ad5798fdd294dbc2282eda",
        "url": "http://omgili.com/ri/jHIAmI4hxg.iJPgI2z6a7XnBzbAvS8c00C3haxY99spDqYzAg4w9URRCPLqohwSMzQB5O_v8y_sGVqjB1zeeDi2Oee4MtaNRE86RaXRsijG2y0VK6LH9YcpNCxiGXMGP",
        "site_full": "www.cnn.com",
        "site": "cnn.com",
        "site_section": "http://rss.cnn.com/rss/cnn_topstories",
        "site_categories": [
          "news"
        ],
        "section_title": "CNN.com - RSS Channel - Mobile App Manual",
        "title": "The most impressive car restorations",
        "title_full": "The most impressive car restorations",
        "published": "2016-11-29T03:47:40.682+02:00",
        "replies_count": 0,
        "participants_count": 0,
        "site_type": "news",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "http://i2.cdn.cnn.com/cnnnext/dam/assets/161124160919-egon-5-super-tease.jpg",
        "performance_score": 6,
        "domain_rank": 81,
        "social": {
          "facebook": {
            "likes": 664,
            "comments": 0,
            "shares": 664
          },
          "gplus": {
            "shares": 3
          },
          "pinterest": {
            "shares": 4
          },
          "linkedin": {
            "shares": 9
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "b28ae5891c6164efe4ad5798fdd294dbc2282eda",
      "url": "http://omgili.com/ri/jHIAmI4hxg.iJPgI2z6a7XnBzbAvS8c00C3haxY99spDqYzAg4w9URRCPLqohwSMzQB5O_v8y_sGVqjB1zeeDi2Oee4MtaNRE86RaXRsijG2y0VK6LH9YcpNCxiGXMGP",
      "ord_in_thread": 0,
      "author": "",
      "published": "2016-11-29T03:47:40.682+02:00",
      "title": "The most impressive car restorations",
      "text": "1928 Bugatti Type 35C – \"You can't Google this information,\" he points out. Hide Caption 6 of 9 Photos: 1958 Porsche 718 RSK – Zweimüller muses that if there were ever a Noah's Ark for cars, he would include the Austro Daimler Bergmeisteralong, a Volkswagen Beetle, and his father's Alfa Romeo 8C 2300 Mille Miglia Corto. Hide Caption 7 of 9 Photos: Zweimüller won best preserved postwar car at this year's Concorso d'Eleganza Villa d'Este for his 1957 Fantuzzi-bodied Maserati 200Si. Hide Caption 8 of 9 Photos: Egon Zweimüller poses with the 1948 Talbot-Lago Grand Sport Franay Cabriolet that won its class at Pebble Beach in 2012. Hide Caption 9 of 9 Story highlights Egon Zweimüller 's family-run business in Ennsdorf, Austria has become known as one of the world's best car restoration houses Paying painstaking attention to detail, he draws on his priceless technical archive to restore rare cars to factory-delivery status (CNN) When Wolfgang Porsche decided to give one of the classic cars from his private collection to the prestigious Porsche Museum in Stuttgart, Germany, he wanted the best possible restoration for the rare 1932 Austro Daimler Bergmeister sports cabriolet. How Britain's McLaren conquered the world This, after all, was an illustrious vehicle, considered one of the most beautiful cars of its era, with a body by royal coach builder Armbruster and a provenance to match. With money and time no object, Porsche turned to classic car specialist Egon Zweimüller In 2007, whose family-run business in Ennsdorf, Austria has become known as one of the world's best restoration houses. Ten thousand hours later, Zweimüller delivered a car sure to turn heads anywhere, from its first outing at the 2011 Pebble Beach Concours d'Elegance in California to its current home in the Porsche Museum. The 'go-to' name for restorations Read More Egon Zweimüller grew up around cars and motorbikes, driving from the age of six, and riding bikes through the forests around Ennsdorf. In the 1960s, his father opened a wrecking yard (where the workshop now stands), and began collecting old cars and automotive bits and pieces that, over time, would morph into a fully fledged restoration business. Egon Zweimüller with the 1948 Talbot-Lago Grand Sport Franay Cabriolet that won its class at Pebble Beach in 2012. Their restorations include a streamlined 1954 Mercedes-Benz Grand Prix racer, a Concours class-winning 1948 Talbot-Lago Grand Sport Franay cabriolet, a Bugatti Type 35C racer, and a rare 1900-01 Lohner Porsche hybrid electric car for Ernst Piëch, a grandson of another of Porsche's founder's, Ferdinand Porsche. Zweimüller has something a little more modern on hand too. At his workshop, the 42-year-old Austrian shows me a gold 1964 McLaren M1-A open prototype which, at last year's Concorso d'Eleganza Villa d'Este , picked up a mention of honor. This was the McLaren raced by two-time F1 champion Graham Hill, and briefly driven by Elvis Presley in the 1996 film \"Spinout.\" Presley enjoyed the car so much he bought it from the movie's supplier. Now it's in Zweimüller's hands, along with another Presley car, a BMW 507. The checque that Elvis Presley handed over when he bought the gold 1964 McLaren M1-A. Restoring a classic car can be incredibly expensive, running into hundreds of thousands of dollars. But when the best and rarest examples from the likes of Ferrari, Bugatti, Mercedes-Benz and Porsche regularly bring millions of dollars at auction, it can make financial sense. The largest archive in Europe Zweimüller's approach is straightforward. \"I want to restore a car to factory-delivery status -- to be exactly the same as the day it left the factory,\" he says. That means almost obsessive attention to detail. For each restoration, Zweimüller will draw on his vast collection of archived material -- books, photographs, production notes, technical drawings and specification sheets for a range of classic cars. At one million pieces, his is the largest archive of its type in Europe, and priceless because it's not digitized. It includes, for example, 20 of the notebooks that Ferdinand Porsche used to jot down ideas about various car projects. 9 things you didn't know about Ferrari \"You can't Google this information,\" Zweimüller points out. His eye for what's right in a restoration means that he'll even track down the old-fashioned nitrocellulose paint used on prewar cars. To illustrate his point, he pulls out an old Bugatti paint palette box to show the various shades of blue that founder Ettore Bugatti used on his vehicles. It was his guide for the recent restoration of a 1928 blue Type 35C racer. His approach to restoration is tempered by the realities of doing business. \"Of course it depends on the client's wishes,\" he explains, referencing a job where the right factory color for a certain Bugatti was blue, but the client wanted it black. \"So there is a degree of artificial license that can be taken.\" Sometimes, preservation is simply the best choice. Zweimüller won best preserved postwar car at this year's Villa d'Este Concorso for his 1957 Fantuzzi-bodied Maserati 200Si. Zweimüller winning Fantuzzi-bodied 1957 Maserati 200Si. As he pulls back the covers to show the Maserati, he points out that its red paintwork is untouched since its creation almost 60 years ago. 'The perfect job' More covers are lifted to reveal projects in progress for various clients: a Bugatti Type 57, a Dino Ferrari, an Alfa Romeo 8C, and various Porsches, including a Le Mans 917 racer. The beautiful gray and white Austro Daimler Bergmeister is also on hand, back briefly from the Porsche Museum for its annual checkup. Zweimüller muses that if there were ever a Noah's Ark for cars, he would want the Bergmeister to be on it, along with a Volkswagen Beetle, and another of his favorite cars, the Alfa Romeo 8C 2300 Mille Miglia Corto that his father owns. Technically advanced for its day, many of the Bergmeister's design details could be traced back to the time when Porsche founder Ferdinand Porsche (Wolfgang's grandfather) was chief designer at the Austrian Daimler Motor Company. Zweimüller says that while he loves prewar Alfa Romeos, it was a \"great honor\" and labor of love to restore the Bergmeister. \"That vehicle was a concentration of the ideas and talents of Porsche and the engineers who followed him.\" \"Everything was unique for the Bergmeister,\" Zweimüller explains. \"Ferdinand Porsche was like Ettore Bugatti in that respect. It was haute couture for cars. Everything was tailor-made from the chassis up, even down to the screws.\" As he locks up the treasure trove of classic cars in his workshop and storage area, Zweimüller says he has the perfect job. \"I don't have to own these beautiful cars, but they are with me for thousands of hours.\"",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [
          {
            "name": "armbruster",
            "sentiment": "none"
          },
          {
            "name": "graham hill",
            "sentiment": "none"
          },
          {
            "name": "wolfgang",
            "sentiment": "none"
          },
          {
            "name": "noah",
            "sentiment": "none"
          },
          {
            "name": "austro daimler bergmeister",
            "sentiment": "none"
          },
          {
            "name": "dino ferrari",
            "sentiment": "none"
          },
          {
            "name": "maserati",
            "sentiment": "none"
          },
          {
            "name": "wolfgang porsche",
            "sentiment": "none"
          },
          {
            "name": "ferdinand porsche",
            "sentiment": "none"
          },
          {
            "name": "mclaren",
            "sentiment": "none"
          },
          {
            "name": "alfa romeos",
            "sentiment": "none"
          },
          {
            "name": "elvis presley",
            "sentiment": "none"
          },
          {
            "name": "ettore bugatti",
            "sentiment": "none"
          },
          {
            "name": "egon zweimüller",
            "sentiment": "none"
          },
          {
            "name": "zweimüller",
            "sentiment": "none"
          },
          {
            "name": "ernst piëch",
            "sentiment": "none"
          },
          {
            "name": "bugatti",
            "sentiment": "none"
          },
          {
            "name": "mille miglia corto",
            "sentiment": "none"
          },
          {
            "name": "alfa romeo",
            "sentiment": "none"
          }
        ],
        "organizations": [
          {
            "name": "google",
            "sentiment": "positive"
          },
          {
            "name": "daimler motor company",
            "sentiment": "none"
          },
          {
            "name": "mercedes-benz",
            "sentiment": "none"
          },
          {
            "name": "volkswagen",
            "sentiment": "none"
          },
          {
            "name": "rsk",
            "sentiment": "none"
          },
          {
            "name": "porsche",
            "sentiment": "none"
          },
          {
            "name": "austro daimler bergmeisteralong",
            "sentiment": "none"
          },
          {
            "name": "mille miglia corto",
            "sentiment": "none"
          },
          {
            "name": "ferrari",
            "sentiment": "none"
          },
          {
            "name": "porsche museum",
            "sentiment": "none"
          },
          {
            "name": "cnn",
            "sentiment": "none"
          },
          {
            "name": "mclaren",
            "sentiment": "none"
          }
        ],
        "locations": [
          {
            "name": "california",
            "sentiment": "none"
          },
          {
            "name": "britain",
            "sentiment": "none"
          },
          {
            "name": "europe zweimüller",
            "sentiment": "none"
          },
          {
            "name": "pebble beach",
            "sentiment": "none"
          },
          {
            "name": "zweimüller",
            "sentiment": "none"
          },
          {
            "name": "ennsdorf",
            "sentiment": "none"
          },
          {
            "name": "stuttgart",
            "sentiment": "none"
          },
          {
            "name": "europe",
            "sentiment": "none"
          },
          {
            "name": "austria",
            "sentiment": "none"
          },
          {
            "name": "pebble beach concours d'elegance",
            "sentiment": "none"
          },
          {
            "name": "porsche museum",
            "sentiment": "none"
          },
          {
            "name": "germany",
            "sentiment": "none"
          }
        ]
      },
      "crawled": "2016-11-29T03:47:40.682+02:00"
    },
    {
      "thread": {
        "uuid": "0982107a6faf45c510bc6626e7276f4326e2d09f",
        "url": "http://omgili.com/ri/jHIAmI4hxg.aX6RsjGyewXaF650x_J7FQ3_xTZytttS0OD0hERPQNnRbF4qYUqLJi2n_3RJqcimXusW_KumrXQ--",
        "site_full": "www.androidauthority.com",
        "site": "androidauthority.com",
        "site_section": "http://www.androidauthority.com",
        "site_categories": [
          "news",
          "tech"
        ],
        "section_title": "Android Authority",
        "title": "Google brings more beautiful wallpapers to you phone or Mac",
        "title_full": "Google brings more beautiful wallpapers to you phone or Mac",
        "published": "2016-11-29T08:40:11.149+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "blogs",
        "country": "US",
        "spam_score": 0.0,
        "main_image": null,
        "performance_score": 5,
        "domain_rank": 1848,
        "social": {
          "facebook": {
            "likes": 576,
            "comments": 0,
            "shares": 576
          },
          "gplus": {
            "shares": 11
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "0982107a6faf45c510bc6626e7276f4326e2d09f",
      "url": "http://omgili.com/ri/jHIAmI4hxg.aX6RsjGyewXaF650x_J7FQ3_xTZytttS0OD0hERPQNnRbF4qYUqLJi2n_3RJqcimXusW_KumrXQ--",
      "ord_in_thread": 0,
      "author": "David Imel",
      "published": "2016-11-29T08:40:11.149+02:00",
      "title": "Google brings more beautiful wallpapers to you phone or Mac",
      "text": "\nIf you’re a fan of Google’s “Daily Wallpaper” feature baked inside of the official “Wallpapers” app but find yourself drifting towards Apple’s desktop ecosystem, you’re in luck.\nGoogle put up a blog post today detailing the beautiful photos that users upload to its Google+ social network, letting the world know that some of these images would soon be available for your Android device as well as your Mac. Those who use Apple’s desktop computers will have the opportunity to download the new Featured Photos Screensaver for Mac , which grabs high resolution photos selected from the Google+ community and sets it as your wallpaper for while you’re away. Google+ photos will also be available in the Wallpapers Android app.\nSee also: 10 best live wallpaper apps for Android June 10, 2016 Users can submit their own photos to be featured on the home screens of millions of devices by simply sharing their images publicly on Google+. Photos shared in this manner will automatically be considered to be added to the slideshow of images on both the Mac and Android applications. You can make sure your photos are not considered by sharing them privately, but since all the photos are reviewed before images are selected, you shouldn’t worry about publicly sharing family photos and the like with you circles.\nFor those who host a large amount of their photography on Google+ and would like to increase their chances of having their images showcased, you can apply to the Google+ Create program . Those who are accepted will have their shots featured much more often, and may even be considered to have their images used in Google’s various marketing channels. In addition, you will be able to get a sneak peek of new Google + features before anyone else, and can even get your account verified to let people know your photos are really yours.\nIf you didn’t know how to set these photos as your Android wallpaper already, here’s a simple guide:\nDownload Wallpapers app on Google Play Long press the home screen Tap “Wallpapers” Choose Earth, Cityscapes, Landscapes, Life, or Textures Tap “Daily Wallpaper” Choose whether you want the wallpapers to be downloaded on wi-fi only Tap continue Tap “set wallpaper” I’ve personally been using this as my wallpaper app of choice since launch, and I have high hopes that a similar application makes its way over to Windows.\nAre you using these wallpapers?",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [],
        "organizations": [
          {
            "name": "google",
            "sentiment": "positive"
          },
          {
            "name": "mac",
            "sentiment": "none"
          },
          {
            "name": "apple",
            "sentiment": "none"
          }
        ],
        "locations": []
      },
      "crawled": "2016-11-29T08:40:11.149+02:00"
    },
    {
      "thread": {
        "uuid": "e67c7b6e085a573ab77eee6b31ad828396e43af6",
        "url": "http://omgili.com/ri/DyQaNGXlfMp4GkjqYwqUHZMCWJQtzbvqOz4IePD0D3HRgmwcigAqWCgIpJabAQ4T.4axTizrLt01Q22FocM3kNDpQmFYErSWExll.Dl3tZP9vdL6H8OahyZGvXeC8pphkCWsWb3dT_U-",
        "site_full": "thenextweb.com",
        "site": "thenextweb.com",
        "site_section": "http://feeds2.feedburner.com/thenextweb",
        "site_categories": [
          "news",
          "tech"
        ],
        "section_title": "The Next Web",
        "title": "Google Earth Timelapse lets you see climate change clearer than ever",
        "title_full": "Google Earth Timelapse lets you see climate change clearer than ever",
        "published": "2016-11-29T20:08:29.765+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "news",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "https://cdn1.tnwcdn.com/wp-content/blogs.dir/1/files/2016/11/nuflo.gif",
        "performance_score": 1,
        "domain_rank": 1761,
        "social": {
          "facebook": {
            "likes": 148,
            "comments": 12,
            "shares": 148
          },
          "gplus": {
            "shares": 28
          },
          "pinterest": {
            "shares": 1
          },
          "linkedin": {
            "shares": 33
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 5
          }
        }
      },
      "uuid": "e67c7b6e085a573ab77eee6b31ad828396e43af6",
      "url": "http://omgili.com/ri/DyQaNGXlfMp4GkjqYwqUHZMCWJQtzbvqOz4IePD0D3HRgmwcigAqWCgIpJabAQ4T.4axTizrLt01Q22FocM3kNDpQmFYErSWExll.Dl3tZP9vdL6H8OahyZGvXeC8pphkCWsWb3dT_U-",
      "ord_in_thread": 0,
      "author": "Napier Lopez",
      "published": "2016-11-29T20:08:29.765+02:00",
      "title": "Google Earth Timelapse lets you see climate change clearer than ever",
      "text": "44 shares \nWant to see climate change happening before your very eyes? Just take a look at the updated imagery on Google Earth Timelapse. \nGoogle first launched Earth Timelapse in 2013, covering a span of imagery since 1984 to 2012. The company has now updated the tool with images up to 2016, and older imagery has been sharpened using the same technology Google implemented with Maps earlier in the year . \nGoogle had to sift through three quadrillion pixels from more than 5,000,000 satellite images to create set of 33 images of the entire planet changing over time. It’s not all doom and gloom though; there are fascinating views of cities rapidly evolving too. \nAnd if you really have some time to kill, you can watch it all on a 40 minute YouTube Playlist:",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [],
        "organizations": [
          {
            "name": "google",
            "sentiment": "positive"
          }
        ],
        "locations": []
      },
      "crawled": "2016-11-29T20:08:29.765+02:00"
    },
    {
      "thread": {
        "uuid": "51c88d0258b7585b3c0bc2e113983d4742a0bb14",
        "url": "http://omgili.com/ri/_0JOtn.4SCoRuTimvW9_C5EFuSYc2D35lUTtZJ_qhTYMdpJt_vACvi9ywiwjGXejTv1L68STPko-",
        "site_full": "bgr.com",
        "site": "bgr.com",
        "site_section": "http://bgr.com",
        "site_categories": [
          "news",
          "tech"
        ],
        "section_title": "BGR",
        "title": "Google Home talking to Amazon Echo will entertain you all day long",
        "title_full": "Google Home talking to Amazon Echo will entertain you all day long",
        "published": "2016-12-01T03:01:56.000+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "blogs",
        "country": "US",
        "spam_score": 0.0,
        "main_image": null,
        "performance_score": 4,
        "domain_rank": 2702,
        "social": {
          "facebook": {
            "likes": 417,
            "comments": 0,
            "shares": 417
          },
          "gplus": {
            "shares": 9
          },
          "pinterest": {
            "shares": 1
          },
          "linkedin": {
            "shares": 83
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "51c88d0258b7585b3c0bc2e113983d4742a0bb14",
      "url": "http://omgili.com/ri/_0JOtn.4SCoRuTimvW9_C5EFuSYc2D35lUTtZJ_qhTYMdpJt_vACvi9ywiwjGXejTv1L68STPko-",
      "ord_in_thread": 0,
      "author": "Chris Smith",
      "published": "2016-12-01T03:01:56.000+02:00",
      "title": "Google Home talking to Amazon Echo will entertain you all day long",
      "text": "Google and Amazon have the two best voice-enabled virtual home assistants in  Google Home and Amazon Echo . Both devices were on sale through Black Friday and Cyber Monday, and each of them should be a great addition to your smart home project. You don’t need to buy both gadgets because they’re both able to pull off basically the same stunts. But if you do get both of them, you can make them talk to each other. That’s what one user did, and of course, there was a camera present.\nContinue reading... \nTrending right now: \nApple will pay you zero money to trade in your Apple Watch This tool tells you if your Gmail account was infected with malware What it takes to get a NES Classic ",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [],
        "organizations": [
          {
            "name": "google",
            "sentiment": "positive"
          },
          {
            "name": "google home",
            "sentiment": "positive"
          },
          {
            "name": "amazon",
            "sentiment": "positive"
          },
          {
            "name": "amazon echo",
            "sentiment": "positive"
          },
          {
            "name": "apple",
            "sentiment": "none"
          }
        ],
        "locations": [
          {
            "name": "amazon",
            "sentiment": "none"
          }
        ]
      },
      "crawled": "2016-12-01T03:01:56.000+02:00"
    },
    {
      "thread": {
        "uuid": "47c66e5c446e51ffd4e9f82a270727240816b2ca",
        "url": "http://omgili.com/ri/jHIAmI4hxg.JqtT4oCoU32.IFhjz6PW_bbUChZpCLN2Fi9o0D2HUuwC0xy8GRXv_0RaFbVvgPOKQAhcqQHCoW1Iup5chCfUIvZlhrQ5okJ8G2E85OR_trmtgZUHAPYTblVT64URkiRAdA0aXJt9aECWnbjqSr.X4",
        "site_full": "www.computerworld.com",
        "site": "computerworld.com",
        "site_section": "http://www.computerworld.com/category/cloud-computing/index.rss",
        "site_categories": [
          "tech"
        ],
        "section_title": "Computerworld Cloud Computing",
        "title": "2016 will be 1 second longer: Google can help you cope",
        "title_full": "2016 will be 1 second longer: Google can help you cope",
        "published": "2016-12-01T09:07:00.000+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "blogs",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "http://images.techhive.com/images/article/2016/11/20161130-watch-time-stock-100696468-large.3x2.jpg",
        "performance_score": 1,
        "domain_rank": 4542,
        "social": {
          "facebook": {
            "likes": 106,
            "comments": 0,
            "shares": 106
          },
          "gplus": {
            "shares": 4
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 68
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "47c66e5c446e51ffd4e9f82a270727240816b2ca",
      "url": "http://omgili.com/ri/jHIAmI4hxg.JqtT4oCoU32.IFhjz6PW_bbUChZpCLN2Fi9o0D2HUuwC0xy8GRXv_0RaFbVvgPOKQAhcqQHCoW1Iup5chCfUIvZlhrQ5okJ8G2E85OR_trmtgZUHAPYTblVT64URkiRAdA0aXJt9aECWnbjqSr.X4",
      "ord_in_thread": 0,
      "author": "Stephen Lawson",
      "published": "2016-12-01T09:07:00.000+02:00",
      "title": "2016 will be 1 second longer: Google can help you cope",
      "text": "Highlights from Interop 2015 \nLike a man eager to show off his new watch, Google is encouraging anyone running IT operations to ask it for the time. \nThe company will let anyone use its NTP (Network Time Protocol) servers, a move to help IT shops cope with the next “leap second,” which will be tacked onto 2016 just after midnight on Dec. 31. \nLeap seconds help to keep clocks aligned with the Earth’s rotation, which can vary due to geologic and even weather conditions. But an extra second can wreak havoc with applications and services that depend on systems being tightly synchronized. \nMost Internet-connected devices get their time through NTP, an open-source technology that's used all over the world. NTP has its own problems, mainly around funding, but it's long been the standard. Google runs its own NTP servers and uses them to ease its systems through leap seconds, according to Michael Shields, technical lead on the company’s Time Team, in a blog post on Wednesday. \nTime synchronization is critical for many things Google’s systems do, such as keeping replicas up to date, determining which data-affecting operation happened last, and correctly reporting the order of searches and clicks, the company says. \nOrdinary operating systems can’t accommodate a minute that’s 61 seconds long, so some organizations have used special-case workarounds for the extra second. But sometimes these methods raise issues, like what happens to write operations that take place during that second. At times in the past, some Google systems have refused to work when faced with a leap second, though this didn’t affect the company’s services, a Google representative said. \nSo Google will modify its NTP servers to run clocks 0.0014 percent slower for 10 hours before the leap second and for 10 hours afterward. When the leap second takes place, they will have accounted for it already. Google’s been using this technique, called “smeared time,” since a leap second in 2008. \nEnterprises running virtual-machine instances on Google Compute Engine, and those using Google APIs, will want to keep their own systems synchronized with Google’s slightly slower clocks during that 20-hour period. Client systems will also have to be set to that time in order to work with those servers. And it won’t work to run some servers on smeared time and some on regular time, because then clients won’t know which time to follow, Google says. \nSo the company is making its NTP servers available free through the Google Public NTP service. Users can take advantage of the service by configuring their network settings to use time.google.com as their NTP server. The company laid out detailed instructions for synchronizing systems to its smeared time. \nGoogle won’t be the only company smearing time on Dec. 31. Akamai plans to slow down its clocks over a 24-hour period around the leap second. Amazon and Microsoft have done the same thing in the past. \nIn fact, the big cloud companies look ready to standardize on a 24-hour “ leap smear .” Google plans to use the longer transition for the next leap second, partly to ease more slowly into extra second and partly to align itself with other companies. There’s no date yet for the next leap second, but Google expects it to come in 2018. \nLeap seconds began in 1972 and are now administered by the International Earth Rotation and Reference Systems Service (IERS). They’re needed because Earth’s rotation isn’t uniform. It’s affected by things like tides in the oceans and the movement of magma beneath the Earth’s crust. Atomic clocks, which set the standard for most timekeeping, are more consistent than that. To express your thoughts on Computerworld content, visit Computerworld's Facebook page , LinkedIn page and Twitter stream . Related:",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [
          {
            "name": "michael shields",
            "sentiment": "none"
          }
        ],
        "organizations": [
          {
            "name": "google",
            "sentiment": "positive"
          },
          {
            "name": "ntp",
            "sentiment": "none"
          },
          {
            "name": "computerworld",
            "sentiment": "none"
          },
          {
            "name": "google public ntp",
            "sentiment": "none"
          },
          {
            "name": "akamai",
            "sentiment": "none"
          },
          {
            "name": "google compute engine",
            "sentiment": "none"
          },
          {
            "name": "time team",
            "sentiment": "none"
          },
          {
            "name": "microsoft",
            "sentiment": "none"
          },
          {
            "name": "international earth rotation and reference systems service",
            "sentiment": "none"
          },
          {
            "name": "amazon",
            "sentiment": "none"
          }
        ],
        "locations": [
          {
            "name": "earth",
            "sentiment": "none"
          }
        ]
      },
      "crawled": "2016-12-01T09:43:20.778+02:00"
    },
    {
      "thread": {
        "uuid": "ede29261ddce5d7d6d12a3873f926b933d613951",
        "url": "http://omgili.com/ri/jHIAmI4hxg.4snjSUV.tkGFD_3yflZe4YY1A.MXAoJUiv4g6qx_QDjTT_80jy0400VxNadYoKeTZ_a8yXlGjnIvSavLtJ02g",
        "site_full": "www.mirror.co.uk",
        "site": "mirror.co.uk",
        "site_section": "https://news.google.com/news/feeds?pz=1&cf=all&ned=english&hl=United+states&q=apps&output=rss",
        "site_categories": [
          "news",
          "entertainment",
          "sports"
        ],
        "section_title": "apps - Google News",
        "title": "Best Android games and apps 2016: Pokémon Go and Prisma among top UK downloads from Google Play - Mirror.co.uk",
        "title_full": "Best Android games and apps 2016: Pokémon Go and Prisma among top UK downloads from Google Play - Mirror.co.uk",
        "published": "2016-12-01T13:17:46.152+02:00",
        "replies_count": 0,
        "participants_count": 0,
        "site_type": "news",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "http://i1.mirror.co.uk/incoming/article9371437.ece/ALTERNATES/s1200/MAIN-Apps-MAIN.jpg",
        "performance_score": 4,
        "domain_rank": 804,
        "social": {
          "facebook": {
            "likes": 460,
            "comments": 0,
            "shares": 460
          },
          "gplus": {
            "shares": 1
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 4
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "ede29261ddce5d7d6d12a3873f926b933d613951",
      "url": "http://omgili.com/ri/jHIAmI4hxg.4snjSUV.tkGFD_3yflZe4YY1A.MXAoJUiv4g6qx_QDjTT_80jy0400VxNadYoKeTZ_a8yXlGjnIvSavLtJ02g",
      "ord_in_thread": 0,
      "author": "",
      "published": "2016-12-01T13:17:46.152+02:00",
      "title": "Best Android games and apps 2016: Pokémon Go and Prisma among top UK downloads from Google Play - Mirror.co.uk",
      "text": "Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nToday is December 1, and to mark the start of the festive season, Google has announced its top apps and games of 2016, based on download figures from the Google Play store. \nMore than 65 billion apps have been downloaded to Android smartphones and tablets from Google Play in the last year by people in 190 countries around the world. \nThe most downloaded app was Google's video-calling app Duo , which allows you to video call anyone on your contacts list who also has the app - a bit like Skype or Apple's FaceTime. \nHowever, Google decided to award the title of \"Best App 2016\" to Prisma , the app that turns your photos into incredibly realistic looking paintings using artificial intelligence. (Photo: Prisma) \nMeanwhile, on the games side, the most downloaded app was Pokémon GO , the fiendishly addictive augmented reality game that lets you catch Pokémon characters in the real world. \nGoogle also awarded Pokémon GO the title of Best Game 2016. \nThe top five in each category can be seen below: Best Android apps Google Duo: One-to-one video calling app MSQRD: Live filters and face-swap for video selfies Camera 360 lite version: Beauty camera app Keyboard: Emoji keyboard app 30 Day Fit Challenge Workout: Guided workouts for use at home \nBest app award: Prisma",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [
          {
            "name": "pokémon",
            "sentiment": "none"
          }
        ],
        "organizations": [
          {
            "name": "google",
            "sentiment": "positive"
          },
          {
            "name": "prisma",
            "sentiment": "positive"
          },
          {
            "name": "facetime",
            "sentiment": "none"
          },
          {
            "name": "skype",
            "sentiment": "none"
          },
          {
            "name": "apple",
            "sentiment": "none"
          },
          {
            "name": "invalid email  today",
            "sentiment": "none"
          }
        ],
        "locations": [
          {
            "name": "uk",
            "sentiment": "none"
          }
        ]
      },
      "crawled": "2016-12-01T13:17:46.152+02:00"
    },
    {
      "thread": {
        "uuid": "22c37b0791a4df8787c1ec945c898f7b5be488b0",
        "url": "http://omgili.com/ri/jHIAmI4hxg.aX6RsjGyewXaF650x_J7FQ3_xTZytttQOG3yI5IYczHQRSPEycKH1SFtv2YLT.R3eaFa5L8_JLH6BC81_Dx3V",
        "site_full": "www.androidauthority.com",
        "site": "androidauthority.com",
        "site_section": "http://www.androidauthority.com",
        "site_categories": [
          "news",
          "tech"
        ],
        "section_title": "Android Authority",
        "title": "“Ok Google” voice commands now supported by Android Auto",
        "title_full": "“Ok Google” voice commands now supported by Android Auto",
        "published": "2016-12-01T15:56:10.627+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "blogs",
        "country": "US",
        "spam_score": 0.0,
        "main_image": null,
        "performance_score": 2,
        "domain_rank": 1848,
        "social": {
          "facebook": {
            "likes": 240,
            "comments": 0,
            "shares": 240
          },
          "gplus": {
            "shares": 3
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 1
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "22c37b0791a4df8787c1ec945c898f7b5be488b0",
      "url": "http://omgili.com/ri/jHIAmI4hxg.aX6RsjGyewXaF650x_J7FQ3_xTZytttQOG3yI5IYczHQRSPEycKH1SFtv2YLT.R3eaFa5L8_JLH6BC81_Dx3V",
      "ord_in_thread": 0,
      "author": "Robert Triggs",
      "published": "2016-12-01T15:56:10.627+02:00",
      "title": "“Ok Google” voice commands now supported by Android Auto",
      "text": "\nFinally, “Ok Google” keyword support has arrived for Android Auto . It’s only taken the company almost two years to implement the hands-free feature, but now drivers can fully control their car’s infotainment system with their voice, in addition to individual services like Google Maps.\nTo make use of the Ok Google keyword in your vehicle, you’ll need to grab the latest version of the Android Auto app and the Google App. It’s inside that latter that you should find that the “While driving” setting now says that it works with Google Maps and Android Auto. This toggle is found under the “Ok Google” detection menu.\nIf you’re not already using “Ok Google” voice detection on your phone, the feature offers up a range of commands to performs tasks from opening up apps, to setting timers, making calendar appointments, and replying to emails and messages. The fact that all of this can now be done hands-free in your vehicle is bound to be quite useful.\nSee also: Everything you can do with Google voice commands June 20, 2016 If Android Auto or the Google App haven’t updated for you yet, you can grab the latest software from APK Mirror. Just hit the download button below. There may also be a server side switch that Google needs to flick to enable the feature, so it may take a little while for the upgrade to reach everyone.\nDownload Android Auto Download Google App ",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [],
        "organizations": [
          {
            "name": "google",
            "sentiment": "positive"
          },
          {
            "name": "android auto",
            "sentiment": "positive"
          },
          {
            "name": "google maps",
            "sentiment": "none"
          }
        ],
        "locations": [
          {
            "name": "apk mirror",
            "sentiment": "none"
          }
        ]
      },
      "crawled": "2016-12-01T15:56:10.627+02:00"
    },
    {
      "thread": {
        "uuid": "178749e2d4d0a94db129e7836e7647a3bc3dffad",
        "url": "http://omgili.com/ri/.wHSUbtEfZSduuADMF1DcExTbo6Sj2CeUcgN9XXUldkPPAc87LBwjh..hGxct.y4Cw3jsLd5htCDviuNQdY41A--",
        "site_full": "www.engadget.com",
        "site": "engadget.com",
        "site_section": "http://goicicidirect.blogspot.com/feeds/posts/default",
        "site_categories": [
          "news"
        ],
        "section_title": "Engadget RSS Feed",
        "title": "'OK Google' is finally coming to Android Auto",
        "title_full": "'OK Google' is finally coming to Android Auto",
        "published": "2016-12-01T20:01:38.630+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "blogs",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "https://s.aolcdn.com/dims5/amp:8694ca62aa4bb18b1285693645f10358ec3e406f/t:1200,630/q:80/?url=https%3A%2F%2Fs.aolcdn.com%2Fhss%2Fstorage%2Fmidas%2F73fa5d64dfb4412275b3f8eee29313c1%2F204655833%2Fs.aolcdn.jpg",
        "performance_score": 3,
        "domain_rank": 437,
        "social": {
          "facebook": {
            "likes": 313,
            "comments": 0,
            "shares": 313
          },
          "gplus": {
            "shares": 24
          },
          "pinterest": {
            "shares": 4
          },
          "linkedin": {
            "shares": 4
          },
          "stumbledupon": {
            "shares": 392
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "178749e2d4d0a94db129e7836e7647a3bc3dffad",
      "url": "http://omgili.com/ri/.wHSUbtEfZSduuADMF1DcExTbo6Sj2CeUcgN9XXUldkPPAc87LBwjh..hGxct.y4Cw3jsLd5htCDviuNQdY41A--",
      "ord_in_thread": 0,
      "author": "Matt Brian",
      "published": "2016-12-01T20:01:38.630+02:00",
      "title": "'OK Google' is finally coming to Android Auto",
      "text": "'OK Google' is finally coming to Android Auto Before, you had to tap the screen or push a button on the steering wheel. Share Save \nThe major selling point of Android Auto is that it brings smartphone-like apps and services to your vehicle. Google Maps, access to music and weather updates are now taken for granted, but it's remained a mystery over why one of Android's most useful hands-free commands -- \"OK Google\" -- has taken so long to come to the infotainment software. Luckily, the search giant has finally recognized the need for the feature and is in the process of rolling it out, albeit at a slow pace. \nThe feature was first spotted by Reddit user neo5468 , who noticed that the latest versions of the Android Search and Auto apps enabled a new toggle for OK Google commands while driving. However, even if you have the new updates installed, Google appears to be limiting the expansion on an per account basis, so you may need to wait your turn. \nIt's been more than six months since Google's I/O conference, where it first shared that it would enable hotword support in Android Auto. The company also said at the time that it would integrate Waze , but that is also taking some time to surface.",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [
          {
            "name": "waze",
            "sentiment": "none"
          }
        ],
        "organizations": [
          {
            "name": "google",
            "sentiment": "positive"
          },
          {
            "name": "android auto before",
            "sentiment": "positive"
          },
          {
            "name": "android auto 'ok google",
            "sentiment": "neutral"
          },
          {
            "name": "android auto",
            "sentiment": "none"
          }
        ],
        "locations": [
          {
            "name": "reddit",
            "sentiment": "none"
          }
        ]
      },
      "crawled": "2016-12-01T20:01:38.630+02:00"
    }
  ],
  "totalResults": 40,
  "moreResultsAvailable": 0,
  "next": "/search?token=c6052904-f312-436b-a6d8-d915084ac866&format=json&ts=1480615298630&q=language%3A%28english%29+thread.country%3AUS+organization.positive%3A%22Google%22+performance_score%3A%3E0+%28site_type%3Anews+OR+site_type%3Ablogs%29",
  "requestsLeft": 802
}