{
  "posts": [
    {
      "thread": {
        "uuid": "fdf0caf52cde582370ce07c187fece133500890e",
        "url": "http://omgili.com/ri/7aBdisT0NOrO1_KRh30qwogLBAUlEvcqid9xGeFh8Ph3bsElaI.xUDQbWQhuoRzJHqz5cTbnfmZa6zkWbygIV9PH.cPrjkRpMOFz8e0ssMvBmJH59CRwQiXhKXCgdrY34_ktFGaCeM7GUgqTXD1awA--",
        "site_full": "seekingalpha.com",
        "site": "seekingalpha.com",
        "site_section": "http://seekingalpha.com/atom.xml",
        "site_categories": [
          "business"
        ],
        "section_title": "All Articles on Seeking Alpha",
        "title": "LATAM Airlines' (LFL) Management on Q3 2016 Results - Earnings Call Transcript",
        "title_full": "LATAM Airlines' (LFL) Management on Q3 2016 Results - Earnings Call Transcript",
        "published": "2016-11-11T22:26:08.023+02:00",
        "replies_count": 0,
        "participants_count": 0,
        "site_type": "news",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "https://staticseekingalpha1.a.ssl.fastly.net/images/users_profile/000/101/639/big_pic.png?1361390405",
        "performance_score": 0,
        "domain_rank": 1432,
        "social": {
          "facebook": {
            "likes": 1,
            "comments": 0,
            "shares": 1
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "fdf0caf52cde582370ce07c187fece133500890e",
      "url": "http://omgili.com/ri/7aBdisT0NOrO1_KRh30qwogLBAUlEvcqid9xGeFh8Ph3bsElaI.xUDQbWQhuoRzJHqz5cTbnfmZa6zkWbygIV9PH.cPrjkRpMOFz8e0ssMvBmJH59CRwQiXhKXCgdrY34_ktFGaCeM7GUgqTXD1awA--",
      "ord_in_thread": 0,
      "author": "",
      "published": "2016-11-11T22:26:08.023+02:00",
      "title": "LATAM Airlines' (LFL) Management on Q3 2016 Results - Earnings Call Transcript",
      "text": "Stephen Trent – Citi Operator Good day, everyone, and welcome to LATAM Airlines Group Earnings Release Conference Call. Just a reminder, this conference is being recorded. LATAM Airlines Group earnings release for the period was distributed on Thursday, November 10. If you have not received it, you can find it on our website, www.latamairlinesgroup.net, in the Investor Relations section. At this time, I would like to point out that the statements regarding the Company's business outlook and anticipated financial and operating results constitute forward-looking comments. These expectations are highly dependent on the economy, the airline-industry and international markets. Therefore, they are subject to change. Now, it is my pleasure to turn the call over to Mr. Ramiro Alfonsín, Chief Financial Officer of LATAM Airlines Group for opening remarks and introduction. Mr. Alfonsín, please begin. Ramiro Alfonsín Thank you, operator. Good morning, everyone, and welcome to LATAM third quarter earnings call. Joining me today are; Ms. Cláudia Sender, President of LATAM Brazil; Ms. Gisela Escobar, Head of Corporate Control and Investor Relations; Mr. Roberto Alvo, Head of International Passenger Operations and Fleet; and Enrique Elsaca, Head of Spanish Speaking Countries Operations. Also joining us is Mr. Andres del Valle, Head of Corporate Finance. In today's call I will be providing a brief overview of the highlights of our third quarter results. Gisela will then walk us through the details on the quarter and before our Q&A session Mr. Enrique Elsaca will address the new travel model that we announced on Wednesday. On the second slide of our presentation uploaded on the webcast you will find the highlights of the third quarter 2016. Earnings before interest and tax amounted to $152 million in the third quarter of 2016 representing an operating margin of 6%. This is an increase of 26% compared to the third quarter of 2015. With that, our margin for the first nine months of 2016 will be 5.4%, which is in the midpoint of the guidance provided by the Company for the year. As a result of this and based on the visibility we have for the fourth quarter 2016, we are narrowing our guidance for 2016 to the higher end of the range originally provided. Operating margin guidance was in the range of 4.5% to 6.5% and we are narrowing it down to the range of 5.5% and 6.5%. On the revenue side for the first time after 11 consecutive quarters for revenue decline, we experienced an increase of 0.2%. This revenue improvement reflects the positive revenue per ASK trend in the domestic and international routes in Brazil in particular to the U.S. driven by the significant capacity adjustment. In addition to this, we also had a stronger currency environment in South America especially of the Brazilian real. We continue to take a cautious approach in Brazil with respect to capacity. We'll reduce capacity in the domestic Brazil market by 13% during the third quarter. Revenue per ASK has increased compared to the third quarter of last year, continuing the trend we have seen in the past three quarters. We have also continued our efforts to adjust our fleet commitment. We have deferred the arrival of two Airbus A350 resulting in total fleet commitments for 2017 of $482 million, the lowest in the history of LATAM and well below the $1.9 billion of 2016. In addition the seven aircraft that we are receiving next year will be all financed through operating leases. Therefore we will have no fleet CapEx cash out in 2017. Yesterday, we provided more details regarding an important project to renew the travel model for domestic services, in order to address the changing dynamics of customers and the industry. The objective of this early sign is to increase competitiveness and to assure the sustainability and the profitability of our domestic operations in each of the six markets where we operate. This includes both Hispanic speaking markets as well as Brazil. Later in this presentation as I mentioned, Enrique will be providing additional color on the changes of our domestic operations. Please join me on Slide 3, where you will find the summary of our income statement. Although the environment is still challenging in most of our region, on the third quarter revenues improved when compared to the same period of last year as a result as I mentioned before of a more stable currency environment as well as the positive revenue per ASK trend in domestic and international rules in Brazil. Passenger revenues declined 0.6% compared to a reduction of 13% on the prior quarter and cargo revenues declined 40%. These reductions were more than compensated by an increase in other revenue originated from Multiplus as well as in increase in sales from tour operations associated with the Olympic Games in Rio de Janeiro. Our cost decreased by 1% is compared to third quarter 2015, mainly driven by a decline in fuel prices partially offset by the appreciation of the local currencies especially the Brazilian real. As a consequence, we reached an operating result of $152 million which represent a 26% increase compared to the same period last year and an operating margin of 6%. Our non-operating cost included $82 million in net financial expenses and $62 million in income tax. In addition, we registered a slight impact coming from the 1.5% depreciation of the Brazilian real when compared to the June exchange rate, which generated a foreign exchange loss of $11 million in the third quarter of this year, which is considerably lower when compared to the $242 million loss of the previous year. With that, our net income amounted to $5 million compared to the loss of $113 million of 2015, which is mainly explained by the foreign exchange impact and the improved results on the operation side. Well we look at the results for the first nine months of the year on the right hand side of the slide, revenue decreased by almost 10%, especially driven by the reductions of the first and the second quarter, the reduction on the first quarter in revenues were 16% and on the second quarter was 12%. Reduction in revenues was offset by a 10% reduction in cost. Therefore the Company improved its operating income by 2.2% year-to-date and operating margin reached 5.4%, an improvement when compared to the 4.7% we had last year. Our net income amounted to $15 million and our EBITDAR shows and increase of 3.1% with a margin of 21% increasing 2.7 percentage points compared to the same period of 2015 with a fixed resilience of our business model in this macro environment. I will now hand the floor to Gisela to provide further details on the quarter. Gisela Escobar Thank you. If you turn to the next slide, we can take a closer look at the revenue trends we saw during the third quarter. Although we continue to see unit revenue declines in both the passenger and the cargo business, we do see an improvement in the trends that we have seen during the first half of the year. On the passenger side, revenue per ASK declined 0.7% this quarter versus last year. This compares to a 15% to 20% revenue per ASK decline that we were seeing during the first half, and on the cargo side, a revenue per ATK is down 8.9% versus the 17% to 18% declines that we saw during the first semester. Most of this improved trend is due to an improved demand scenario in Brazil, especially on international routes as well as the appreciation of the Brazilian real with respect to last year and the significant and proactive capacity adjustments that LATAM has made over the course of the last few quarters. If we look at the international passenger operations, which represent 54% of our passenger capacity, on those routes our capacity is up 4.9% this quarter with traffic increasing 7% and load factors at very strong levels of 87.8%. The revenue per ASK decline of 6.8% includes an improvement in the revenue per ASK of Brazil-U.S. routes which had been significantly impacted over the past couple of quarters and where we are now seeing improvements year-over-year of approximately 20% in terms of revenue per ASK. And that is offset by declines in revenue per ASK on some of the long-haul routes from Spanish speaking countries where we are continuing to add capacity and where we're seeing some weakness in terms of demand related to a weaker macro environment. On the domestic Brazil route, we had made a significant capacity adjustment this quarter in line with our guidance and with the capacity adjustments that we have already made during this year. With that capacity is down 13.2% this quarter and almost 12% for the first nine months as compared to last year. Load factors are slightly up 82.4% this quarter, and with that revenue per ASK improved 8.6% as compared to the third quarter of last year. This 8.6% is a 1.8% improvement in revenue per ASK in Brazilian currency and includes the effect of the approximately 8% appreciation of the Brazilian real versus last quarter. On the Spanish speaking countries, domestic operations which are approximately 18% of our total capacity, we are growing capacity at around 10% compared to last year. Traffic is up approximately 8% and with that our load factors is 79.6% for the quarter. Here although we have seen stabilization of most of the currency in the region, except for Argentina when we compare it with the third quarter of last year, we are seeing weaker economic growth and that has resulted in weaker demand. And we have not seen yet the significant capacity adjustments in these markets to adjust to that weaker macro trend. And this is largely what led to this reduction in revenue per ASK of 18.3% during the quarter. This drop has been similar across the five different Spanish speaking markets and going forward what we expect for the fourth quarter is some adjustment in terms of our ASK growth. Our ASK growth in the fourth quarter will be lower than this 10%, and with that we expect to see an improving trend in this revenue per ASK number going forward. On the cargo side, we continue with capacity reductions. Capacity is down almost 6% this quarter and we are seeing a load factors at 49.6% and stabilizing with respect to last quarter and showing less of a decline that we saw in the first and second quarter. And the 8.9% decline in revenue per ASK is also an improving trend which is mainly related to a recovery of imports into the Brazilian market. Turning to next slide to talk a little bit more in detail about operating cost, this quarter our cost per ASK equivalent is up 1.3% with respect to the third quarter of last year. There is a few significant impacts here. First we recognized severance losses – severance cost of $25 million during this quarter related to a personnel reduction. And in addition to that, we also recognized $25 million in cost associated to the tourism operations for the Rio Olympics. That also generated additional revenue, so the net effect on the margin was positive, but it was $25 million of additional cost during this quarter. So, those two elements represent approximately $58 million of cost that should be non-recurring going forward. In addition to the, the appreciation of the currencies we saw at that obviously has had a positive impact on the revenue side, but it has a negative impact on the cost that was denominated in local currency especially wages. And in addition to that another important element when we look at cost on cost per ASK basis had to do with the very strong capacity adjustment. This quarter we did the most capacity adjustments of the year with passenger ASKs being flat and as a result of the ATK reductions, ASK equivalent are down 2%. So that means that even if we maintain our cost in absolute terms flat, our cost per ask is going up. The capacity adjustments that we're making require adjustments in fixed cost and in our fixed cost structure which we continue to work on, but obviously don't necessarily fall – are not necessarily immediate related to the reductions in capacity. So, far over the last year, we have had a net reduction in personnel of approximately 5,000 people and some of that is related to overhead and support functions. Some of that is related to the capacity reductions that we have been implementing, but a part of that will also be delayed into the fourth quarter. If you turn to the next slide, if we look at a punctuality level, in line with our constant and continued focus on providing the best passenger experience, on-time performance is one of our most important focus. We continue to see strong improvements in our on-time performance in all of our business units. In Spanish Speaking Countries we saw an improvement of 5 points. This includes record levels that we saw in Chile during the month of September with on-time performance reaching 97%. We see improvements also in Brazil domestic routes with strong punctuality in all of our hubs, and on international routes as well where we saw 1 point improvement with respect to last year. Turning to the next slide, to talk a little bit on fleets on going forward, we continue to work on our fleet – on right sizing our fleet commitment as a reaction to the demand environment that we're seeing in the region. And with that, we have during this quarter, during the third quarter been able to defer the delivery of two A350s that were originally planned for delivery in 2017 and that now will be coming in 2018. With that as you can see on this slide, we have historically low fleet commitments for next year. In 2017, fleet commitments are $482 million, only a fraction of the $1.6 billion to $1.9 billion of fleet commitments that we've seen in recent years. In addition, all of this will be financed through operating leases or sale on leaseback. So there is no actual cash fleet CapEx during 2017 that needs to be financed. With this, we completed a reduction in our total fleet commitment of almost $5 billion for the 2017, 2018 period over the last year, and we are still looking at a – and we're still looking at further reductions to reach our $2 billion to $3 billion target that we have mentioned in previous quarters. Turning to next slide, and looking a little bit at our balance sheet. We continue to have a very stable credit metric with respect to the numbers that you saw in June. Our leverage remains flat at around 5.8 times in terms of adjusted net debt to EBITDAR. In terms of cash, our cash and cash equivalents reached 14.5% of revenues. These are adequate cash levels for the current environment with a total cash balance of $1.4 billion at the close of September. On the bottom part of the slide, you can see our debt amortization profile for the coming years. For 2017, the $1.5 billion in debt amortization includes $300 million of LATAM unsecured bonds that is coming due in the second quarter next year. We expect to cover all of these debt amortizations with free cash flow generated from operations, as well as some additional financing initiative. Looking finally at our fuel and FX exposure, these – what you see on this slide are fuel hedging and FX hedging positions at the close of September. For the fourth quarter of 2016, we currently have approximately a 50% of our total fuel consumption hedged, 11% of that was hedged in 2015 at higher fuel price and 38% of that is our current portfolio, that has been done during 2016. For the January-September nine month period, our fuel hedging losses reached $53 million, which is significantly lower than what we recognized in 2015. And at current prices, our expected fuel hedge loss for the full year would be $59 million. So, only slightly higher than what we've already recognized. For 2017, we currently have, so far only 35% hedged for the first semester of next year. Regarding the BRL, we've hedged for the fourth quarter $90 million of our cash flow exposure to the Brazilian currency. And during this year, so far we've recognized a $38 million loss related to all of our FX hedges. Finally, just a word on our guidance. As was mentioned at the beginning of the presentation, we are adjusting our operating margin guidance for this year just narrowing the range that was originally provided to the higher end of the range, so we are currently expecting operating margins to be between 5.5% and 6.5% for the full year. We have not made any changes to our capacity growth guidance for this year. We are – if you look at our total capacity for the nine month period January through September, we're growing approximately 1% in terms of ASKs and we expect that our growth rate in each of our business unit will be within the range that we provided in our guidance. Just as a summary of the main highlights then for what we've mentioned for this quarter. We've been able to maintain our operating margins within the range of our guidance, 5.4% EBIT margins so far for the first nine months of 2016 despite the challenging macro scenario that we've seen with weak demand in different markets and with currency volatility during the year. We continued to be very consistent and cautious with respect to capacity. We have taken a very conservative approach to capacity during this year especially in the Brazil domestic market where we've reduced 12% capacity so far this year in the domestic operations, which is the most of any Brazilian airline operating in that market. We've also continued with our cost reduction efforts, with our cost per ASK equivalent ex-fuel being down almost 3% for the first nine months of this year and we are taking care to maintain an adequate cash position at all times in the range of $1.4 billion and we continue to work a very actively on rightsizing our fleet commitment with very good news for 2017 on that front with no cash CapEx and very low feet commitment for next year. With that I want to turn it over to Enrique Elsaca who as Ramiro mentioned in the beginning is the Head of the Spanish speaking domestic operation and has been leading over the past year the redesign of our domestic business model Passenger Operations. So he is going to go through what this new business model entails. Enrique Elsaca Thank you, Gisela. Good morning everybody. First of all, I will give you an overview of the domestic operations we have then talk about the reasons why we are doing this change, and then talking a little bit more about the elements of the change and what we expect to gain through this process. LATAM has domestic operations as you know in six markets throughout South America; in Brazil, Chile, Peru, Argentina, Ecuador and Colombia. This markets represents approximately 45% of our ASK and passenger revenues, but most importantly it represent 78% of our passengers transported, 44% in Brazil and 34% in Spanish speaking. And therefore, it is a very significant in our operation. Despite the recent microeconomics have slowed down in our region, all of this markets have significant growth potential in the long-term, based on penetration rates that are still very low compared to developed countries. South America, trips per capita included in both domestic and international are between 0.5 to 1.3 per inhabitant, while in developed countries this number is over 2. In Europe this goes over 3. LATAM is a leading player in most of these markets, especially in Chile, Peru and Brazil, and such has been instrumental in being the [indiscernible] of air travel in the region. 10 years ago in 2006, LATAM changed its business mode for domestic operations to become much more a low cost, reducing its cash by about 20% and achieving continuing and significant growth through lower first, making air travel in more accessible. In particular in Chile, the domestic industry has tripled the size over the past 10 years going from 3 million to 10 million passengers as you may have seen in this chart in the left part. While the air fares on this same 10 years have – went down almost or more than 50%. Today air fares have never been lower than what you can see in Chile, there are comparable to ultra-low cost fares globally. As an example, the cheapest fare in Chile today is 7,000 pesos that is equivalent to $11 one way, excluding taxes which is similar to the cheapest fare offer by low-cost carrier in the world. Turning to the next page, why we are doing this change and we see mainly three reasons. First, the growth of leisure passengers, leisure passengers will be say in between 50% to 70% of our passenger in our different domestic markets, and they are growing at double and sometimes triple the rate of corporate passengers and increasingly taking a major part of the market. These passengers are very price sensitive and require low fares, which require carriers to have competitive and efficient cost structure to couple with that demand. Second, competitors both globally and within South America are increasingly resulting low cost models in order to remain competitive. Although within South America there is currently only one low cost player, which is Viva, we believe that the growth of potential of these markets makes them attractive for other low cost carriers. And third and finally, the way in which our airlines sell their tickets in the industry is changing. Ticket price are simple and more transparent for passengers as you may see in the picture. And ancillaries allow passengers to pay separately for those specific elements of the trip that they value or they need such as check-in luggage and preferred seating among other ancillaries. What are the elements of this model as you see in the chart, here you can see a circle that we have wrapped in order to explain the model. Our new business model average the changing dynamic of the industry making us more competitive and ensuring our sustainability in the long term, allowing that to lift the growth of the industry well maintaining and improving the profitability of our domestic operations. Through this [indiscernible] circle and increasing the efficient cost structure will allow us to lowest to provide lower fares, stimulating demand and ASK growth which intern through economies of scale will allow us for continued efficiency and so on. We are convinced that cost efficiencies are key in order to maintain a competitive advantage. For this reason, we have been working over the last two years to continue to reduce our operating cost and we will continue to do so in the context of this new business model. Cost efficiencies will include the following things; first, the reduction in sales costs via increase web sales penetration, we'll target to increase to reach up to 80% our direct sales. Second, increase in operational productivity, including the areas of maintenance, crew, airport and so on. Third, continued reduction in overhead costs including the centralization and simplification of super factions. Fourth, lower airport costs through digital empowerment tools including self-check-in and self-back pack. And fifth, the increase utilization of our aircraft, we believe that we can improve it 15%. We are not providing at this time a target for cash reduction. We expect to achieve with this changes but we expect to show the positive evaluation of our quarterly numbers during the course of the next two years. It will be gravel process, since the rollout will be graveled in different countries and because of certain changes require IT and digital enablers, which we are currently working on. But we believe that with this changes our costs per ASK in domestic operations will allow us to compete with any low cost carrier operating in the region or that could come or one to enter in the region. Another key element of this [indiscernible] circle are the ancillary revenues initiatives. Ancillary revenues are very new trend in South America, but can represent over $15 per passengers for U.S. carriers. We expect to develop ancillary revenues offering a better onboard experience to our edible mobile that provides more food and beverage options and improved products. Also we will unbundle our sales structure, allowing our passengers to pay for the services they require, such as additional bags, preferred seats, flexibility and changes, hotels, insurance et cetera. We expect this model to result in significant growth in number of passenger transported, reaching up to 50% more passengers in the next four to five years. This will be addressed through efficient capacity growth, including higher low factors, moving 81% to up to 86% higher aircraft utilizations 15% higher and lighter aircrafts as we move towards more 320s and 321s. Therefore we are not at this time considering additional aircrafts orders. This model will be implement gradually country-by-country and the rollout will be begin during the first semester of next year. We estimate the model will be fully implemented over the next two years. Turning to the next and last page, it is important to highlight that is a renewal of LATAM business model, that LATAM will not become a low cost carrier. These changes are necessary for LATAM to compete with low cost and maintaining our heritage and our preference are more business clients. Between 30% to 50% of our passengers in the different domestic markets are business passengers, the rest are leisure passengers which grow in many cases up to three times as far, but are price sensitive and regard lower fares. Our new business model will allow us to maintain our market share with business clients but also capture the explosive growth potential of leisure passengers driving the development of the airline industry and increasing the innovation of air travel. Our model will be different from low cost carriers. In that low cost carriers there's only a portion of the market. LATAM will continue to serve all type of passengers with a value proposition specific to each. We will have the right cost structure to be able to provide accessible fares to price sensitive passengers who are price driven, but we will continue to prioritize elements that are valuable to corporate passengers. These are; one, our unique network and frequencies of connection both within South American and our growth; second, the best fit and flyer program over the region; and third, a digital platform that gives business passenger a better control of this travel experience. Ramiro Alfonsín Thank you, Enrique. We'll like to turn it over to the operator for the Q&A session. Question-and-Answer Session Operator [Operator Instructions]. Our first question comes from the line of Duane Pfennigwerth with Evercore ISI. Your line is now open. Duane Pfennigwerth Hey, thanks for the time. I wonder in this quarter if you could say how much higher your margins might have been without any FX hedges in place? Gisela Escobar The FX hedges this quarter was at $18 million loss that recognized in the fuel cost line. FX, it's recognized in the fuel cost line even though it's an FX loss, but that's the line that all of our hedging results go into, both the fuel and the FX. So, it would have been $18 million higher, our operating income. Duane Pfennigwerth Then can you comment on what you are seeing in Brazil domestic and specifically in the close-end pricing environment into the fourth quarter? Cláudia Sender Hi Duane this is Cláudia. I think in the Brazil domestic market what the theme is that after 14 months of consistent traffic drop, demand drop we see that this drop is decreasing in rate, so it's decelerating, but we still don't see a pick-up in demand. It's very early to tell that there is a consolidation of the demand here in the country. So, we're still looking forward very cautiously in terms of capacity, we still believe that there is some excess capacity in the market. So, we maintain our capacity posture stance going forward. We're not adding – we're not thinking about adding any capacity in the next few months. In terms pricing, again we have some good weeks, some bad weeks, so it's hard to say that there is a consolidated perspective from a price perspective. It's hard to say that there is a consolidated trend from a pricing perspective, but we do see some pick up in the earlier weeks. Duane Pfennigwerth Do you see any outlier in respect to that closed-end pricing? Is that something you can comment on, because you have a different type of capacity? It seems like some carriers are appropriately shaping their business to the economic environment and obviously there is some outlier to that. So, I wonder if you see consistency among your competitors. Cláudia Sender It's very hard for me to comment on competitors decisions, but as far as I can tell from our perspective, we maintain our conservative view on the seed of the economic pick-up in the country. Operator Our next question comes from Savanthi Syth with Raymond James. Your line is now open. Savanthi Syth Hey good morning. I was just wondering on the – just the clarity on the new low-cost carrier program on the domestic operation side, does that encompass all of the fleets operating in that domestic side, so it's going to be just one product. And you can expect from business passenger side any additional complexity in connecting the domestic passenger over to international product given the difference in the new product offering? Enrique Elsaca The product is just one product. We are not having two different products. We are having the same brands and the same value propositions. So we are not changing our planes, we are not changing the pitch of our planes, because we know that we have a mixture of corporate passengers and leisure passengers. But we will do the cost efficiencies in order to have the competitive to have the first for the price sensitive customers. Also we expect to do this change in the domestic businesses first, and once we accomplish that during the next year, we will most probably evaluate to go farther in the regional flights with this model. So, regional we have flights in the regional, there are even shorter than the domestic flight we have in our operation. So, we believe that we can combine the model that we are designing, that is not completely a low-cost model, but has elements of a low cost model with the long-haul business that we have and the regional business we have. And also with the corporate or business passengers that we serve in the countries we operate, as we mentioned is some places it's 30%, up to 50% of our passengers are corporate. So, we will want to get both markets. Savanthi Syth That makes sense. I appreciate that. And then, you know, helpful to hear from Cláudia just on, this is what you are thinking on the supply demand in Brazil. I know you are still probably working on your 2017 capacity plans. But I was wondering if you could just talk about you know what you are seeing in the different segment and you know what levels of capacity we might expect next year kind of ballpark? Cláudia Sender We are still not disclosing any capacity plans for 2017. But in terms of the segments, we've seen a very strong demand drop in the corporate segment that now is actually getting back to last year's demand. So, I think this is a segment that was affected the most. Leisure was affected a little less, but we do see some pickup in the corporate demand in the last few weeks. Ramiro Alfonsín I mean we will be providing guidance early next year. Savanthi Syth Okay. Yeah, I understood. I was just kind of wondering if, the trend you were seeing enough of the trends change where we might see some regions kind of growing faster next year. Operator Our next question comes from Josh Milberg of Morgan Stanley. Your line is now open. Josh Milberg Great. Thank you. Thanks for taking the questions. I was hoping you guys could provide a little color just on how your EBIT margins have evolved by division? We saw that if you had a similar improvement goal in your Brazil domestic business and that would imply some meaningful pressure on other divisions. And I don't know what you can say, but is that something that occurred and can you maybe talk about also just the profitability outlook for 2017? Is what you are doing – I mean just adding to that, it's what you are doing in terms of cost efficiencies and right sizing, maybe meaning that there is some upside next year? Sorry, I cut you off. Gisela Escobar Regarding our different business units, as you know we don't really go into detail regarding the profitability in each of the different business units. We have said that you know during this year, we have seen a very challenging situation in the domestic Brazil market and generally we have had the higher – the unit with the higher profitability has been the domestic Spanish speaking market relative to our other operations. We're not – we can't really comment at all on our competitors results on the numbers that they've reported. And I think that when we look going forward we are obviously working on a significant cost reduction initiative throughout the organization. A lot of our cost initiatives related specifically to the domestic operations for this low cost model, but a lot of them are also reduction in overhead and support functions, that at the end of the day are going to benefit all of our different business units. It's still too early for us to say what number we expect for 2017 and we do expect to provide as we always do operating margin guidance, but that will probably be within the next few months. Josh Milberg Okay. Thank you very much. Operator Our next question comes from Michael Linenberg with Deutsche Bank. Your line is now open. Michael Linenberg Good morning. I have a couple of questions. Just back to the slide, Gisela or Ramiro where you highlighted your debt maturities over the next couple of years, you talked about both hang those down by way of operating cash flow as well as some financing initiative. And I just, I wanted to get a feel for what you were seeing in the market right now, there it's been pretty turbulent with respect to the fixed income market and along those lines why that exchange? A few weeks back, what happened there? It looked like that was pulled and what was the catalyst there, so anything that you could provide on that front would be great? Andres del Valle Hi Mike, this is Andres del Valle here. The issuance of the new bond was, I mean devised in order to fund the tenure for two time legacy bonds, namely company 1 in 2017, such that we place an office purchase in something like a $463 million of those funds [indiscernible] but the results of the tender were not as planned in terms of many of a few bonds were tender. So, people sort of held to those bonds. So, the main objective that we have to put for the transaction is to do this liability management and it really wasn't there. That was sort of – I think they cancelled the transaction. I think we didn't get the sufficient amount of our bonds basically. That's one thing. So now on the next year we have as we showed $1.4 billion, $1.48 billion in 2017 of those $300 million is of course the TAM 2017 that matures in April. Now end of this year, we will have, I mean you know ample liquidity, plus we have couple of financing initiative that should thus be necessary we can tag along, but we are not confident of that, we'll all be mature for next year is going to be, I mean loosely covered, no problem there. Michael Linenberg Okay great. And then just turning over to Enrique on the new domestic operation and I recognized that you don't break out profitability by division, but I'd be very curious that with Project Laser in Chile, you know from 2005 to present, if you were to sort of normalize for fuel and sort of macro that moving over to that model, did you see a meaningful improvement in margins or a modest improvement or maybe margins stayed the same, but because you grew the revenue base so much that your absolute profit improved dramatically. I mean can you give us any color on how that played out, you know that was kind of a laboratory and a bit of an experiment and it sounds like it was a success to the extent that you now want to replicate that across your entire system? Enrique Elsaca The example of Chile of the growth you have seen is very similar to the one we have in Peru and in Ecuador, so this is a market in our region, all of the markets in the last 10 years, they either double or triple. So, that's not only, Chile was an example, the first one, but we did same in all other operations. And even though the prices went down in the case of Chile, you see the price – the average prices went down in 10-years about 60%, the lower prices went down more maybe 70% in real terms, we also reduce our cost subsequently and that allow us to have a profit margin that is healthy with a bigger business. So, we expect with this change that we know that this prices will continues to go down is just the problem of mix of passengers, the leisure passengers convert to the business passenger. Business passenger may pay four or five times the leisure passenger and we are going to be growing more leisure passenger, so the mix will continue the trend of reducing the price, the average price. But we will have to think that will help us to offset that. First we will continue improving our load factor when we launched this model 10 years ago, our target was to reach 75 and we reached 76 on first five years. So, we never believed we can go farther than 75. Today our target, we are around 81, 82. Our target is 86. So, we want to offset that transaction in the mix or in the deal by the load factor. And secondly ancillaries, ancillaries now is a new thing in South America maybe not in the world, but for us it's new and that will help us also to offset. And the most important thing as – we will reduce our cost significantly and that equation we believe will help us first to compete and second to have a more healthy sustainable business in the long-term. Michael Linenberg Okay. Thanks and just one quick on ancillaries, Enrique. Besides Brazil, are there any other domestic Spanish speaking countries where you can't charge for first or second bag, or is Brazil the only one where you can't impose bag fees across your system? Enrique Elsaca Brazil is – Cláudia may talk a little bit more, because there are moving things on the regulatory part in Brazil. And maybe she can explain better. Out of Brazil, the other five countries, we don't have any restriction. We have some small restriction in Argentina with the band that we have that has minimum price that is not very low and that can help to stimulate, but if every year they maintain the band, the lower part of the band on fixed terms, it will be diluted in the next two year. So, besides that specifics thing, all the countries there have no restrictions. So, we are promptly due to go forward next year. Cláudia you can add something what's going on in Brazil? Cláudia Sender So as Enrique said, the general transportation conditions, there are so called CGT here in Brazil determine that we have to have a minimum luggage franchise and this is under discussion by ENAC, so this might be reviewed soon, but we have no further news than whatever is public. Michael Linenberg Okay. Very good, thank you everyone. Operator Our next question comes from Mauricio Martinez with GBM. Your line is now open. Mauricio Martinez Good morning everyone. Thank you for taking my question. My question is kind of follow-up on the previous one. It's regarding the new business model. As you mentioned you are expecting further decrease in fares somewhere around 20% for 2020. But I was wondering if you can share with us your expectations for unit cost. I mean is the unit cost per ASK, is this going to drop even more than fares and which records will be the main drivers, specifically in order to make more lean operations? Enrique Elsaca We have not provided this time any target of cash reduction, but we expect that to show a positive evolution over the course of the next two years, that's what we have said. And it depends also on the rollout per country and also in the enablers that helps to do this and we have some enablers in the IP and digital that are important. We believe that the CAS in domestic operation will now have to compete to the low-cost carriers face to face. And one of the main things we are going to be changing as we mentioned and it's on the sharp and one of the chart of the [indiscernible] is further reduction in cost of sale. So we will improve our penetration of web sales that we are around 50% and we want to improve that to up to 80%. We have not moved to 100% such some low cost, because we have corporate business travelers that they do buy through different channels. Second we will increase our productivity in all of the areas, the airports, crew, maintenance. Third, we'll continue to make reduction as you have seen in our overhead cost. We will stream our organization and we'll make it more lean more simple. We are centralizing, we are outsourcing some functions and we'll continue. We have done that in the last 12 months and we will continue in that trend. We will make an importance change in airports with more digital power tools, sorry that will help us do more self-check-in and self-back pack, and also very important, the increasing utilization. We are not bringing more planes. We are improving our utilization from 9, 9.5 hours to 11 hours. We are moving from 319s to 320s and we are moving in some countries from 320s to 321s. 330 to 50 more seats and we're improving our load factor. So those are the major things that are moving the cost reduction and we believe in the next 12 to 18 months, we will have the cost necessary to compete to the current low cost carriers or any low-cost carriers that enter the region. Mauricio Martinez Perfect, very clear. Thank you. Operator Our next question comes from Gabriel Francisco with Goldman Sachs. Your line is now open. Gabriel Francisco Hi. Thank you for taking my questions. Most have been answered, just one thing on the low cost new business model. One condition that we may assume is that you are not going to change your fleet type. Is that correct to assume? Ramiro Alfonsín Sorry, can you ask again? Gabriel Francisco Sure. Sure. Can you hear me better now? Ramiro Alfonsín You got cutoff just a moment. Sorry Gabriel. Could you go again? Gabriel Francisco Yeah, sure. Absolutely, no problem. Just wanted to you said – would you change any type of planes to address this new business model change a smaller planes or anything like that. Can you provide any color on that? Roberto Alvo Currently as Enrique explained in the next 12 to 24 months, we have the Airbus fleet and for the short-term we don't expect to add additional planes. Going forward we'll evaluate, but this is not in the plans at this moment. Gabriel Francisco Okay. Thanks. And earlier you said well you said no guidance on CAS. I just want some comments on how is this business model comparable with the point-to-point model that LATAM has today multi-direct routes and not an actual hub per se like Copa or other LCCs in Europe. Do you think it will increase about marginally the load factor for even and specially for regional routes? Enrique Elsaca For getting the low factor of high, we will see the requirement of moving from one model to the other. We have a hub and spoke model in the regional and international business that we fly, and in most of our countries, we have just one big city and we'll operate point-to-point. So we don't see a big change to implement the model to move from hub to point-to-point. I think it's not the main thing to get either the low factors, nor the deals and last is the passengers in order to be successful and to grow. Gabriel Francisco Okay. Sorry, I'm having quite a few there. You can see, one on the Qatar capitalization, any colors like it's been moved to for a Q, but it has been a little bit out of the news lately. Any update on that? Ramiro Alfonsín Yeah. We have received the authorization from the FBS yesterday, so we are preparing the pre-emptive write-off for the next coming weeks. Gabriel Francisco Okay. And just as my last one, maybe Cláudia could address that one. We have had and she even commented on news as I am aware on the Antitrust Authority in Brazil are not recommending the approval of the agreement with IAG and other European carriers. Do you think that what would be the impact if that was not accepted? What kind of route would be most affected? That's my last one. Roberto Alvo Hi, Gabriel. Just to clarify, Cláudia did not say that they would not recommend the approval. They said that they would not recommend the approval as it was filed, and you know these things are filed without any measures mitigation. So, we still believes very clearly that there is significant benefits for the passengers in both South American point of sales and European point of sales, as you know these JVs have been authorized everywhere in the world and we are working hard with CADE to make very clear why this is going to be good for the market. So we are not sitting up in a position where this could be not approved, we think that it will. And we think we'll have news around the mid or the end of 2017. Gabriel Francisco Okay. Thank you and thank you for the patients for taking so many questions. Enrique Elsaca",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [
          {
            "name": "stephen trent",
            "sentiment": "neutral"
          },
          {
            "name": "mauricio martinez perfect",
            "sentiment": "none"
          },
          {
            "name": "ramiro alfonsín",
            "sentiment": "none"
          },
          {
            "name": "duane",
            "sentiment": "none"
          },
          {
            "name": "josh milberg great",
            "sentiment": "none"
          },
          {
            "name": "alfonsín",
            "sentiment": "none"
          },
          {
            "name": "roberto alvo hi",
            "sentiment": "none"
          },
          {
            "name": "gabriel francisco sure",
            "sentiment": "none"
          },
          {
            "name": "enrique elsaca",
            "sentiment": "none"
          },
          {
            "name": "raymond james",
            "sentiment": "none"
          },
          {
            "name": "gabriel",
            "sentiment": "none"
          },
          {
            "name": "gabriel francisco hi",
            "sentiment": "none"
          },
          {
            "name": "duane pfennigwerth",
            "sentiment": "none"
          },
          {
            "name": "enrique",
            "sentiment": "none"
          },
          {
            "name": "duane pfennigwerth hey",
            "sentiment": "none"
          },
          {
            "name": "gisela escobar",
            "sentiment": "none"
          },
          {
            "name": "mauricio martinez",
            "sentiment": "none"
          },
          {
            "name": "gabriel francisco yeah",
            "sentiment": "none"
          },
          {
            "name": "josh milberg okay",
            "sentiment": "none"
          },
          {
            "name": "ramiro alfonsín sorry",
            "sentiment": "none"
          },
          {
            "name": "andres del valle",
            "sentiment": "none"
          },
          {
            "name": "enrique elsaca brazil",
            "sentiment": "none"
          },
          {
            "name": "josh milberg",
            "sentiment": "none"
          },
          {
            "name": "cláudia sender",
            "sentiment": "none"
          },
          {
            "name": "gisela",
            "sentiment": "none"
          },
          {
            "name": "michael linenberg",
            "sentiment": "none"
          },
          {
            "name": "roberto alvo",
            "sentiment": "none"
          },
          {
            "name": "viva",
            "sentiment": "none"
          },
          {
            "name": "cláudia",
            "sentiment": "none"
          },
          {
            "name": "ramiro",
            "sentiment": "none"
          },
          {
            "name": "ramiro alfonsín you",
            "sentiment": "none"
          },
          {
            "name": "andres del valle hi mike",
            "sentiment": "none"
          },
          {
            "name": "gabriel francisco okay",
            "sentiment": "none"
          }
        ],
        "organizations": [
          {
            "name": "latam airlines group",
            "sentiment": "neutral"
          },
          {
            "name": "citi",
            "sentiment": "neutral"
          },
          {
            "name": "lfl",
            "sentiment": "neutral"
          },
          {
            "name": "latam airlines",
            "sentiment": "neutral"
          },
          {
            "name": "goldman sachs",
            "sentiment": "none"
          },
          {
            "name": "cade",
            "sentiment": "none"
          },
          {
            "name": "antitrust authority",
            "sentiment": "none"
          },
          {
            "name": "evercore isi",
            "sentiment": "none"
          },
          {
            "name": "iag",
            "sentiment": "none"
          },
          {
            "name": "morgan stanley",
            "sentiment": "none"
          },
          {
            "name": "head of international passenger operations and fleet",
            "sentiment": "none"
          },
          {
            "name": "corporate control and investor relations",
            "sentiment": "none"
          },
          {
            "name": "atk",
            "sentiment": "none"
          },
          {
            "name": "cgt",
            "sentiment": "none"
          },
          {
            "name": "ask",
            "sentiment": "none"
          },
          {
            "name": "ebitdar",
            "sentiment": "none"
          },
          {
            "name": "brl",
            "sentiment": "none"
          },
          {
            "name": "deutsche bank",
            "sentiment": "none"
          },
          {
            "name": "cas",
            "sentiment": "none"
          },
          {
            "name": "enac",
            "sentiment": "none"
          },
          {
            "name": "airbus",
            "sentiment": "none"
          },
          {
            "name": "latam",
            "sentiment": "none"
          }
        ],
        "locations": [
          {
            "name": "qatar",
            "sentiment": "none"
          },
          {
            "name": "savanthi syth",
            "sentiment": "none"
          },
          {
            "name": "rio de janeiro",
            "sentiment": "none"
          },
          {
            "name": "ecuador",
            "sentiment": "none"
          },
          {
            "name": "europe",
            "sentiment": "none"
          },
          {
            "name": "chile",
            "sentiment": "none"
          },
          {
            "name": "colombia",
            "sentiment": "none"
          },
          {
            "name": "south america",
            "sentiment": "none"
          },
          {
            "name": "cláudia",
            "sentiment": "none"
          },
          {
            "name": "u.s.",
            "sentiment": "none"
          },
          {
            "name": "gabriel francisco",
            "sentiment": "none"
          },
          {
            "name": "argentina",
            "sentiment": "none"
          },
          {
            "name": "brazil",
            "sentiment": "none"
          },
          {
            "name": "peru",
            "sentiment": "none"
          }
        ]
      },
      "crawled": "2016-11-11T22:26:08.023+02:00"
    },
    {
      "thread": {
        "uuid": "43968c3eca63adfbbd98fb5e127c6976d63a0cc8",
        "url": "http://omgili.com/ri/jHIAmI4hxg9BcPFu_4VOJxXOPE7_XaSqHHmPvWoFDz9eYQTio3NGKz.vqrA7E59r3c9Pqv_f71s6PUtApSCkkVgHk.P1uVD6pfNvPGHfGB1FNnY7YKa1qlAvq2yUf4dqYsv45lJDKDOpqKDA7fLJhA--",
        "site_full": "www.onenewspage.com",
        "site": "onenewspage.com",
        "site_section": "http://www.onenewspage.com/rss/latest/Technology.rss",
        "site_categories": [
          "news",
          "entertainment",
          "education"
        ],
        "section_title": "Latest Technology News on One News Page",
        "title": "Citibank enters the mobile wallet space, partners with MasterCard to offer Citi Pay",
        "title_full": "Citibank enters the mobile wallet space, partners with MasterCard to offer Citi Pay - One News Page",
        "published": "2016-11-12T00:21:13.647+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "news",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "http://cdn.newsserve.net/700/i/20161111/1254-Citibank-enters-the-mobile-wallet-space-partners-with.jpg",
        "performance_score": 0,
        "domain_rank": 91686,
        "social": {
          "facebook": {
            "likes": 0,
            "comments": 0,
            "shares": 0
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "43968c3eca63adfbbd98fb5e127c6976d63a0cc8",
      "url": "http://omgili.com/ri/jHIAmI4hxg9BcPFu_4VOJxXOPE7_XaSqHHmPvWoFDz9eYQTio3NGKz.vqrA7E59r3c9Pqv_f71s6PUtApSCkkVgHk.P1uVD6pfNvPGHfGB1FNnY7YKa1qlAvq2yUf4dqYsv45lJDKDOpqKDA7fLJhA--",
      "ord_in_thread": 0,
      "author": "onenewspage.com",
      "published": "2016-11-12T00:21:13.647+02:00",
      "title": "Citibank enters the mobile wallet space, partners with MasterCard to offer Citi Pay",
      "text": "Your digital wallet just keeps expanding. The latest company to join on the mobile bandwagon is none other than Citibank, who this week debuted a standalone digital wallet app of its own called Citi Pay.",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [],
        "organizations": [
          {
            "name": "mastercard",
            "sentiment": "neutral"
          },
          {
            "name": "citibank",
            "sentiment": "neutral"
          },
          {
            "name": "citi",
            "sentiment": "neutral"
          }
        ],
        "locations": []
      },
      "crawled": "2016-11-12T00:21:13.647+02:00"
    },
    {
      "thread": {
        "uuid": "92a58c3bcae7c89c71ea382e593b928c5695b40e",
        "url": "http://omgili.com/ri/2wGaacqxApvQboY7on5a1l9L3GcBODsgg0QtL0JzN42dstbhyvXj.vUh0ZQBk_AHdFHbANImhr6RaKSQDdTlja2_yxxL9tE09XMh31xyXOAmPoasP0CC8rXncYCLx64MLUCtVb16J31yPHXExyVx8sTYx.2F.VXq",
        "site_full": "markets.financialcontent.com",
        "site": "financialcontent.com",
        "site_section": "http://stocks.investingdaily.com/investingdaily/action/rssfeed?ChannelID=6719",
        "site_categories": [
          "finance",
          "business"
        ],
        "section_title": "Reuters: Company News",
        "title": "Citi preparing to move 900 staff to Dublin from London -Sunday Times",
        "title_full": "Citi preparing to move 900 staff to Dublin from London -Sunday Times",
        "published": "2016-11-13T17:09:48.963+02:00",
        "replies_count": 0,
        "participants_count": 0,
        "site_type": "blogs",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "",
        "performance_score": 0,
        "domain_rank": 86243,
        "social": {
          "facebook": {
            "likes": 0,
            "comments": 0,
            "shares": 0
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "92a58c3bcae7c89c71ea382e593b928c5695b40e",
      "url": "http://omgili.com/ri/2wGaacqxApvQboY7on5a1l9L3GcBODsgg0QtL0JzN42dstbhyvXj.vUh0ZQBk_AHdFHbANImhr6RaKSQDdTlja2_yxxL9tE09XMh31xyXOAmPoasP0CC8rXncYCLx64MLUCtVb16J31yPHXExyVx8sTYx.2F.VXq",
      "ord_in_thread": 0,
      "author": "",
      "published": "2016-11-13T17:09:48.963+02:00",
      "title": "Citi preparing to move 900 staff to Dublin from London -Sunday Times",
      "text": "November 13, 2016 at 07:55 AM EST Citi preparing to move 900 staff to Dublin from London -Sunday Times LONDON, Nov 13 (Reuters) - U.S. bank Citi is preparing to move up to 900 jobs from London to Dublin as part of its contingency plans for Britain's exit from the European Union, the Sunday Times reported.",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [],
        "organizations": [
          {
            "name": "citi",
            "sentiment": "neutral"
          },
          {
            "name": "european union",
            "sentiment": "none"
          },
          {
            "name": "reuters",
            "sentiment": "none"
          }
        ],
        "locations": [
          {
            "name": "dublin",
            "sentiment": "none"
          },
          {
            "name": "london",
            "sentiment": "none"
          },
          {
            "name": "britain",
            "sentiment": "none"
          },
          {
            "name": "u.s.",
            "sentiment": "none"
          },
          {
            "name": "london",
            "sentiment": "none"
          }
        ]
      },
      "crawled": "2016-11-13T17:09:48.963+02:00"
    },
    {
      "thread": {
        "uuid": "e2c61c131c312213b20709a1d6c772eaa3b1c41c",
        "url": "http://omgili.com/ri/2wGaacqxApvQboY7on5a1l9L3GcBODsgg0QtL0JzN42dstbhyvXj.vUh0ZQBk_AHdFHbANImhr4ACRnKcRU.xj976yfx0vyN2hOn5rOtzuvpSKl0z3S6_1uJr51rMdv3g2MisyRGEXzESXmon6gCBDrfG7C_8X64",
        "site_full": "markets.financialcontent.com",
        "site": "financialcontent.com",
        "site_section": "http://finance.dailyherald.com/dailyherald/action/rssfeed?ChannelID=6743",
        "site_categories": [
          "finance",
          "business"
        ],
        "section_title": "Reuters: Company News",
        "title": "Citi preparing to move 900 staff to Dublin from London -Sunday Times",
        "title_full": "Citi preparing to move 900 staff to Dublin from London -Sunday Times",
        "published": "2016-11-13T18:26:20.956+02:00",
        "replies_count": 0,
        "participants_count": 0,
        "site_type": "blogs",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "",
        "performance_score": 0,
        "domain_rank": 86243,
        "social": {
          "facebook": {
            "likes": 0,
            "comments": 0,
            "shares": 0
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "e2c61c131c312213b20709a1d6c772eaa3b1c41c",
      "url": "http://omgili.com/ri/2wGaacqxApvQboY7on5a1l9L3GcBODsgg0QtL0JzN42dstbhyvXj.vUh0ZQBk_AHdFHbANImhr4ACRnKcRU.xj976yfx0vyN2hOn5rOtzuvpSKl0z3S6_1uJr51rMdv3g2MisyRGEXzESXmon6gCBDrfG7C_8X64",
      "ord_in_thread": 0,
      "author": "",
      "published": "2016-11-13T18:26:20.956+02:00",
      "title": "Citi preparing to move 900 staff to Dublin from London -Sunday Times",
      "text": "November 13, 2016 at 07:55 AM EST Citi preparing to move 900 staff to Dublin from London -Sunday Times LONDON, Nov 13 (Reuters) - U.S. bank Citi is preparing to move up to 900 jobs from London to Dublin as part of its contingency plans for Britain's exit from the European Union, the Sunday Times reported.",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [
          {
            "name": "tim",
            "sentiment": "neutral"
          }
        ],
        "organizations": [
          {
            "name": "citi",
            "sentiment": "neutral"
          },
          {
            "name": "european union",
            "sentiment": "none"
          },
          {
            "name": "reuters",
            "sentiment": "none"
          }
        ],
        "locations": [
          {
            "name": "dublin",
            "sentiment": "none"
          },
          {
            "name": "london",
            "sentiment": "none"
          },
          {
            "name": "britain",
            "sentiment": "none"
          },
          {
            "name": "u.s.",
            "sentiment": "none"
          },
          {
            "name": "london",
            "sentiment": "none"
          }
        ]
      },
      "crawled": "2016-11-13T18:26:20.956+02:00"
    },
    {
      "thread": {
        "uuid": "e5f652fc51ff4be1ef3543e7e6c9b2a18652d88a",
        "url": "http://omgili.com/ri/vkc1Z8ITDMvmd6quqxUWCa_fh9V.xC_cTHHOzY8J2wT3646otZ8v0biGvhQfQlUS4g7LxUkFy_Y0kqWfs3oaCA--",
        "site_full": "venturebeat.com",
        "site": "venturebeat.com",
        "site_section": "http://venturebeat.com",
        "site_categories": [
          "business"
        ],
        "section_title": "VentureBeat",
        "title": "The rise of the fintech bots",
        "title_full": "The rise of the fintech bots",
        "published": "2016-11-13T22:11:50.146+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "blogs",
        "country": "US",
        "spam_score": 0.0,
        "main_image": null,
        "performance_score": 0,
        "domain_rank": 2406,
        "social": {
          "facebook": {
            "likes": 11,
            "comments": 0,
            "shares": 11
          },
          "gplus": {
            "shares": 2
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 25
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "e5f652fc51ff4be1ef3543e7e6c9b2a18652d88a",
      "url": "http://omgili.com/ri/vkc1Z8ITDMvmd6quqxUWCa_fh9V.xC_cTHHOzY8J2wT3646otZ8v0biGvhQfQlUS4g7LxUkFy_Y0kqWfs3oaCA--",
      "ord_in_thread": 0,
      "author": "Bill Parsons, Yodlee",
      "published": "2016-11-13T22:11:50.146+02:00",
      "title": "The rise of the fintech bots",
      "text": "GUEST: \nWant to know if chatbots are gaining ground on apps? Look at the data. A Citi analyst, for example, reported that bots are growing at a much faster pace than mobile apps did at this same stage. In the realm of personal finance, bots have the real potential to radically improve the way we manage our money, weaving financial decisions into the fabric of our daily lives and giving us immediate insight into the long-term effects of our spending, savings and investing habits.\nFor instance, in the near future, when you walk into Starbucks, Siri might gently suggest that instead of spending $5 on a coffee this morning, perhaps you should put those dollars toward your child’s college fund, which you’ve been neglecting lately. To further nudge you in the right direction, she might also let you know how that $5 investment in a college fund will appreciate over time, versus the cost of making one coffee purchase, which holds no long-term value. You compromise and opt for drip coffee instead of a latte, putting the leftover $2.50 into your child’s 529 plan.\nThis is a simple example, but in time, as AI and fintech bots advance in sophistication, one can imagine even more fantastic ways they can help us simplify financial management and make better decisions throughout the day. The latest innovations in data science embrace behavioral psychology and machine learning to automate chores, make personalized recommendations and provide actionable advice.\nWe’re already seeing early instances of bots in personal finance from fintech innovators, such as robo-advisors and automated recommendations. But like any new cutting-edge technology, there are bound to be some unintended consequences, not unlike the recent issues with Tesla’s autopilot .\nHere are just a few considerations as finbots gain wider adoption:\nWho’s the real bank? As bots make their way into our financial lives, the lines will start to blur as to who is really accountable, who owns the customer relationship, and who is the real bank. For example, Amazon Echo might be the primary way you interact with your finances, but you may have multiple financial accounts with various providers that your bot will need to connect with to provide you with the information and comprehensive insights you need. In such a connected world, it can become difficult to know who owns the customer relationship and where responsibility lies when something goes wrong. At the end of the day, it’s the consumer’s responsibility to manage their financial relationships and interactions.\nHuman logic vs. computer logic Individuals, financial markets and computers all are imperfect in some manner; they also process information, understand context and behave very differently. AI might be able to “learn” certain patterns and even try to push us toward more logical actions, but it can’t always make sense of “situational context” and emotional financial decisions or understand market gyrations.\nUltimately, bots follow computer logic, so the more emotionally based financial decisions are still the responsibility of the individual. While leveraging machine learning and AI for predictive analytic solutions, such as lending and insurance underwriting, credit scoring, fraud detection and identity management, and trading-algorithms are getting quite good, the technologies are nowhere near perfect. Bots are not a replacement for personal accountability, nor are they a replacement for anyone having a solid level of financial literacy.\nInnovation outpacing regulation Whenever technology disrupts a market, it can force the obsolescence of established rules and regulations. Just look at how Uber and Airbnb are forcing a debate about employment and housing laws. While this dynamic impacts just about every industry, it is particularly acute in financial services, a heavily regulated industry that is already far outpaced by technology innovation.\nWith this in mind, regulators and policy makers need to stay up to speed on the technologies that are shaping financial services and personal finance. They must do this while also placing a priority on the long-term benefits of disruptive innovation for consumers and the broader economy. In particular, regulations should balance the perspectives of banks and fintech innovators, and also focus on helping consumers achieve positive financial outcomes in their lives.\nBlack swan events Despite the best efforts by the tech and financial community, the potential for completely unanticipated risks always looms. AI is advancing rapidly, but it still lacks critical thinking skills needed if and when these unexpected events occur. When such black swan events unfold, the built-in algorithms and learned behaviors may no longer apply. That means our financial robots, at a minimum, need to know their own limitations and alert humans when things don’t look right. Longer term, though, we’ll expect bots to respond to and guide us through these unanticipated situations. To do so, they’ll need to understand the context of particular events and take a holistic approach to making decisions based on all available data.\nBanking on trust AI and fintech bots present world-changing opportunities in finance that will lead us all toward more insightful prosperity. Banking and finance always have and always will be based on trust combined with strong checks and balances. Finbots will likewise need to gain and maintain our trust if we’re going to rely on them with our hard-earned money. Building that trust requires measured and thoughtful deployment of bot technology.\nToday, the most immediate opportunity for bots centers around improving customer care, leveraging bots for personal financial management and wealth management applications. But in time, bots and AI will get more sophisticated and the ecosystem around disruptive financial services and applications will mature.\nData intelligence based on transactional and goal-oriented data will enable us to see all of our financial data in the context of our daily financial lives and increasingly suggest personal and relevant actions to improve it. This will bring advanced financial technologies to more people across every income level and into every aspect of our everyday financial lives. When this happens, not only will individuals and families benefit, but so will the broader economy.\nGet more stories like this on Twitter & Facebook ",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [
          {
            "name": "tesla",
            "sentiment": "none"
          },
          {
            "name": "siri",
            "sentiment": "none"
          }
        ],
        "organizations": [
          {
            "name": "citi",
            "sentiment": "neutral"
          },
          {
            "name": "starbucks",
            "sentiment": "none"
          },
          {
            "name": "twitter & facebook",
            "sentiment": "none"
          },
          {
            "name": "amazon echo",
            "sentiment": "none"
          }
        ],
        "locations": []
      },
      "crawled": "2016-11-13T22:11:50.146+02:00"
    },
    {
      "thread": {
        "uuid": "3c09f34eee53a3b281809eff504a9b04bf8b6afe",
        "url": "http://omgili.com/ri/snFTpiOKdJW28CYogKDW5gt8JbyviNjoW02E8kVaHfYQWX97_uqQMiL0ko4jqTxq1sHUfeQ9Rep1StzfiZqmKPb6c1KNt1Lnvrg3eIW8H30OYfUYIRIAsA--",
        "site_full": "news.forexlive.com",
        "site": "forexlive.com",
        "site_section": "http://www.forexlive.com/feed",
        "site_categories": [
          "finance"
        ],
        "section_title": "Forexlive RSS Breaking News Feed",
        "title": "EURUSD post Trump: 2 Key reasons to sell - Citi",
        "title_full": "EURUSD post Trump: 2 Key reasons to sell - Citi",
        "published": "2016-11-14T22:10:44.351+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "blogs",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "",
        "performance_score": 0,
        "domain_rank": 43953,
        "social": {
          "facebook": {
            "likes": 0,
            "comments": 0,
            "shares": 0
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "3c09f34eee53a3b281809eff504a9b04bf8b6afe",
      "url": "http://omgili.com/ri/snFTpiOKdJW28CYogKDW5gt8JbyviNjoW02E8kVaHfYQWX97_uqQMiL0ko4jqTxq1sHUfeQ9Rep1StzfiZqmKPb6c1KNt1Lnvrg3eIW8H30OYfUYIRIAsA--",
      "ord_in_thread": 0,
      "author": "Greg Michalowski",
      "published": "2016-11-14T22:10:44.351+02:00",
      "title": "EURUSD post Trump: 2 Key reasons to sell - Citi",
      "text": "Looking for a new forex broker? Compare Brokers EURUSD post Trump: 2 Key reasons to sell - Citi Mon 14 Nov 2016 19:59:18 GMT Author: FX Strategy | CitiFX eFX Plus has a post saying CitiFX remains short the EURUSD and they cite 2 key reasons. As per the commentary: The Trump vvictory has 1) led to a change in language at the ECB and 2) raised questions as to whether EUR iis a risk positive or defensive currency? We remain a bearish on EURUSD after last Tuesday's surprise. First, ECB has softened their tone after the Trump victory. Concerns on the growth outlook for Europe as well as EU stability have limited a follow-through in the hawkish rhetoric picked up last week. With December 8 ECB decision still to come – the market will trade in part off these perceived language changes. Second, several of Euro's anchors have been questioned after Trump's victory. Euro zone stability, European trade and political relations are all longer-term drivers for Europe. They will change, possibly undermining investor confidence in the macro outlook for 2017/2018. Political risk for Europe is certainly going to rise into 2017 with the Italian referendum, the Dutch, German and French elections. This tends to be negative for European equity markets, limiting cross-border investment. And unlike the US, political surprises are unlikely to bring fiscal stimulus. The short run for EUR is dominated by rate differentials, the medium run by the deteriorating trade outlook in the long run by tail risk – both of these end up being EURUSD negative.' They add that they expect an \"orderly move lower, testing the lower bound of the QE range and below but not a precipitous drop sharply lower\" CitiFX added a short EURUSD to its ttechnical portfolio from 1.09 last week For other interbank trade and analysis, subscribe to eFX Plus by clicking HERE . LON ; About Us \nAll the biggest trading floors in the world have screens locked on ForexLive™. We provide real-time forex news and analysis at the highest level while making it accessible for less-experienced traders. \nLooking for our RSS feed? Premier forex trading news site \nFounded in 2008, ForexLive.com is the premier forex trading news site offering interesting commentary, opinion and analysis for true FX trading professionals. Get the latest breaking foreign exchange trade news and current updates from active traders daily. ForexLive.com blog posts feature leading edge technical analysis charting tips, forex analysis, and currency pair trading tutorials. Find out how to take advantage of swings in global foreign exchange markets and see our real-time forex news analysis and reactions to central bank news, economic indicators and world events. 2016 - Live Analytics Inc v.0.8.2659 \nHIGH RISK WARNING: Foreign exchange trading carries a high level of risk that may not be suitable for all investors. Leverage creates additional risk and loss exposure. Before you decide to trade foreign exchange, carefully consider your investment objectives, experience level, and risk tolerance. You could lose some or all of your initial investment; do not invest money that you cannot afford to lose. Educate yourself on the risks associated with foreign exchange trading, and seek advice from an independent financial or tax advisor if you have any questions. \nADVISORY WARNING: FOREXLIVE™ provides references and links to selected blogs and other sources of economic and market information as an educational service to its clients and prospects and does not endorse the opinions or recommendations of the blogs or other sources of information. Clients and prospects are advised to carefully consider the opinions and analysis offered in the blogs or other information sources in the context of the client or prospect's individual analysis and decision making. None of the blogs or other sources of information is to be considered as constituting a track record. Past performance is no guarantee of future results and FOREXLIVE™ specifically advises clients and prospects to carefully review all claims and representations made by advisors, bloggers, money managers and system vendors before investing any funds or opening an account with any Forex dealer. Any news, opinions, research, data, or other information contained within this website is provided as general market commentary and does not constitute investment or trading advice. FOREXLIVE™ expressly disclaims any liability for any lost principal or profits without limitation which may arise directly or indirectly from the use of or reliance on such information. As with all such advisory services, past results are never a guarantee of future results. \nViewing",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [
          {
            "name": "citi mon",
            "sentiment": "negative"
          },
          {
            "name": "trump",
            "sentiment": "neutral"
          }
        ],
        "organizations": [
          {
            "name": "citi",
            "sentiment": "neutral"
          },
          {
            "name": "ecb",
            "sentiment": "none"
          },
          {
            "name": "live analytics inc",
            "sentiment": "none"
          },
          {
            "name": "eu",
            "sentiment": "none"
          },
          {
            "name": "fx strategy",
            "sentiment": "none"
          }
        ],
        "locations": [
          {
            "name": "us",
            "sentiment": "none"
          },
          {
            "name": "europe",
            "sentiment": "none"
          }
        ]
      },
      "crawled": "2016-11-14T22:10:44.351+02:00"
    },
    {
      "thread": {
        "uuid": "1764955713b47546aea321900749ce794a2d98bd",
        "url": "http://omgili.com/ri/jHIAmI4hxg.zGMsOxe2VgJetL._q3swTNqCqXPLWGe5iD3tt_eopZNuIJ6g09cd08z8TG1bep0A-",
        "site_full": "www.astm.org",
        "site": "astm.org",
        "site_section": "http://www.astm.org/RSS/NWI.rss",
        "site_categories": [
          "education",
          "business"
        ],
        "section_title": "ASTM International - New Work Items",
        "title": "WK56540 Standard Specification for Polyethylene-Based Structural-Grade Plastic Lumber for Outdoor Applications is a work item revision to existing standard D7568-13",
        "title_full": "WK56540 Standard Specification for Polyethylene-Based Structural-Grade Plastic Lumber for Outdoor Applications is a work item revision to existing standard D7568-13",
        "published": "2016-11-15T02:47:00.000+02:00",
        "replies_count": 0,
        "participants_count": 0,
        "site_type": "news",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "",
        "performance_score": 0,
        "domain_rank": 27711,
        "social": {
          "facebook": {
            "likes": 0,
            "comments": 0,
            "shares": 0
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "1764955713b47546aea321900749ce794a2d98bd",
      "url": "http://omgili.com/ri/jHIAmI4hxg.zGMsOxe2VgJetL._q3swTNqCqXPLWGe5iD3tt_eopZNuIJ6g09cd08z8TG1bep0A-",
      "ord_in_thread": 0,
      "author": "",
      "published": "2016-11-15T02:47:00.000+02:00",
      "title": "WK56540 Standard Specification for Polyethylene-Based Structural-Grade Plastic Lumber for Outdoor Applications is a work item revision to existing standard D7568-13",
      "text": "plastic lumber; polyethylene; recycled plastics; reinforced; structural grade composite lumber; Citing ASTM Standards",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [],
        "organizations": [
          {
            "name": "citi",
            "sentiment": "neutral"
          }
        ],
        "locations": []
      },
      "crawled": "2016-11-15T11:19:22.501+02:00"
    },
    {
      "thread": {
        "uuid": "b65ff345e33734c7a18b4af978c82b3cb432546e",
        "url": "http://omgili.com/ri/jHIAmI4hxg.KbH3nII0OArUANL_l37cQJffQPej0nK4gBa3cjHXhVUdG9cdFWKN5_Dvbw5OHS6UzbFVZXDMQxU8BO7CU._X7pHegAKafQq4-",
        "site_full": "www.doctorofcredit.com",
        "site": "doctorofcredit.com",
        "site_section": "http://www.doctorofcredit.com",
        "site_categories": [
          "business"
        ],
        "section_title": "Doctor Of Credit",
        "title": "Is There A New Citi Application Rule? One Card Per 60 Days",
        "title_full": "Is There A New Citi Application Rule? One Card Per 60 Days",
        "published": "2016-11-16T23:00:28.089+02:00",
        "replies_count": 4,
        "participants_count": 1,
        "site_type": "blogs",
        "country": "US",
        "spam_score": 0.0,
        "main_image": null,
        "performance_score": 0,
        "domain_rank": 27103,
        "social": {
          "facebook": {
            "likes": 0,
            "comments": 0,
            "shares": 0
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "b65ff345e33734c7a18b4af978c82b3cb432546e",
      "url": "http://omgili.com/ri/jHIAmI4hxg.KbH3nII0OArUANL_l37cQJffQPej0nK4gBa3cjHXhVUdG9cdFWKN5_Dvbw5OHS6UzbFVZXDMQxU8BO7CU._X7pHegAKafQq4-",
      "ord_in_thread": 0,
      "author": "William Charles",
      "published": "2016-11-16T23:00:28.089+02:00",
      "title": "Is There A New Citi Application Rule? One Card Per 60 Days",
      "text": "Citi has always had strict rules on how many credit cards you could be approved for. Previously these rules have been as follows ( in addition to the one bonus per family of cards per 24 months ):\nYou can only apply for one Citi personal card every 8 days You can apply for no more than two Citi personal cards every 65 days You can apply for one Citi business card every 95 days There has been a few threads on reddit ( 1 , 2 , 3 ) that there is a new rule and that you’re limited to one personal card per 60 day period. According to what I’ve read, this excludes targeted/mailed offers and started at or around August 27th, 2016 ( this is also when the new rule regarding one bonus per family of cards went into place ).\nI asked for datapoints on Twitter and only had readers confirming their experience:\n@Drofcredit my parents and I have been denied recently for the same reason. Analyst said new rule. No more than 1 app in 60 days.\n— Vee Jay (@veejangl) November 14, 2016 \n\nOther datapoints agreeing with rule:\n1 Datapoints disagreeing with rule:\n1 My Thoughts I have no idea if this is a new rule or not, I always think it’s suspicious when representatives mention specific time frames (e.g 60 days in this case) as it usually means that it’s a hard coded rule they can’t override. I don’t think it really matters that much anymore either as you’re limited to one bonus per family of cards per 24 months .\nThe post Is There A New Citi Application Rule? One Card Per 60 Days appeared first on Doctor Of Credit .\n",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [
          {
            "name": "— vee jay",
            "sentiment": "none"
          }
        ],
        "organizations": [
          {
            "name": "citi",
            "sentiment": "neutral"
          }
        ],
        "locations": []
      },
      "crawled": "2016-11-16T23:00:28.089+02:00"
    },
    {
      "thread": {
        "uuid": "85f683ed91011404cd5e7208f4f355bd16046bf3",
        "url": "http://omgili.com/ri/jHIAmI4hxg.OqJSZWOxpwh6hn1691cMskdCrsWCB5MwIjrqwtkyoOi60oRJZ_xi2q51UR4DR5iqefTsLiecv8V3S58mTox8Dt_Qpzm7L3rUFd.w9i7CI89Av4NolzEYl.qofLY.L2UQuwaCxQcq5Iw--",
        "site_full": "www.frugaltravelguy.com",
        "site": "frugaltravelguy.com",
        "site_section": "http://www.frugaltravelguy.com/atom.xml",
        "site_categories": [
          "travel",
          "business"
        ],
        "section_title": "Frugal Travel Guy",
        "title": "Is the Citi AAdvantage Platinum Select World Elite Card Still Worth It?",
        "title_full": "Is the Citi AAdvantage Platinum Select World Elite Card Still Worth It?",
        "published": "2016-11-16T07:39:00.000+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "blogs",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "",
        "performance_score": 0,
        "domain_rank": 67495,
        "social": {
          "facebook": {
            "likes": 0,
            "comments": 0,
            "shares": 0
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "85f683ed91011404cd5e7208f4f355bd16046bf3",
      "url": "http://omgili.com/ri/jHIAmI4hxg.OqJSZWOxpwh6hn1691cMskdCrsWCB5MwIjrqwtkyoOi60oRJZ_xi2q51UR4DR5iqefTsLiecv8V3S58mTox8Dt_Qpzm7L3rUFd.w9i7CI89Av4NolzEYl.qofLY.L2UQuwaCxQcq5Iw--",
      "ord_in_thread": 0,
      "author": "Sandra MacGregor",
      "published": "2016-11-16T07:39:00.000+02:00",
      "title": "Is the Citi AAdvantage Platinum Select World Elite Card Still Worth It?",
      "text": "If you're a newbie, here's a featured credit card to get you started. Home | Awards and Points Programs | Is the Citi AAdvantage Platinum Select World Elite Card Still Worth It? Is the Citi AAdvantage Platinum Select World Elite Card Still Worth It? November 17, 2016 Sandra MacGregor \n\nWhile the Citi / AAdvantage Platinum Select World Elite Mastercard used to be a go-to card for many travelers, the changes to the award redemption program in March have left many wondering if the card’s perks are enough to make up for the reward devaluations. It’s impossible, however, to overlook the fact that American Airlines is the biggest in the world and size — and the convenience that comes with it — matters for frequent fliers. Here’s a concise compendium of both the card’s pros and cons so you can decide if the Citi / AAdvantage Platinum Select World Elite Mastercard is right for you. \nThe Bonus \nPresently the card is offering a welcome bonus of 30,000 American AAdvantage miles after you spend $1,000 in the first three months. (This offer is only available for those who haven’t had a Citi / AAdvantage card — other than a CitiBusiness® / AAdvantage® card — in the last 2 years). \nThe Miles \nThe card makes it very rewarding to take to the skies with American Airlines. Cardholders will earn 2 AAdvantage miles for every $1 they spend on American Airlines purchases. The card defines such purchases as “… items billed by American Airlines as merchant of record booked through American Airlines channels (AA.com, American Airlines reservations, and American Airlines airport and city ticket counters).” \nYou get 1 AAdvantage mile for all other purchases. The card also allows you to redeem up to 7,500 fewer AAdvantage miles for some select AA flights (you can view eligible destinations at aa.com/reducedmileageawards). Every year you receive 10% of your redeemed AAdvantage miles back (to a max of 10,000 AAdvantage miles per year). \nThe AA program is easy to use and you can redeem points for free AA and OneWorld airline partner flights, hotel stays, car rentals and more. Citi® / AAdvantage® Platinum Select® World Elite™ MasterCard®",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [
          {
            "name": "sandra macgregor",
            "sentiment": "none"
          }
        ],
        "organizations": [
          {
            "name": "citi",
            "sentiment": "neutral"
          },
          {
            "name": "american airlines",
            "sentiment": "none"
          },
          {
            "name": "oneworld",
            "sentiment": "none"
          }
        ],
        "locations": []
      },
      "crawled": "2016-11-17T11:44:14.476+02:00"
    },
    {
      "thread": {
        "uuid": "ef933e9401eddaaaad9b4ebde0fbb4e75cbe15ce",
        "url": "http://omgili.com/ri/jHIAmI4hxg.R9M6RBHurip_hPkVssqG9Xq3XwcfSnR1lq5EvWX.fYh19W0.ptcbgtKKnO880yAmF_6wgcK0wpCTAvuZJLZQKrydObShNyaphw3ftsn3KBv0KXI697iOEkwU.0O.JoFw-",
        "site_full": "www.livemint.com",
        "site": "livemint.com",
        "site_section": "http://livemint.com//rss/companies",
        "site_categories": [
          "news",
          "education",
          "business"
        ],
        "section_title": "companies",
        "title": "Citi’s helping hand for art conservation",
        "title_full": "Citi’s helping hand for art conservation - Livemint",
        "published": "2016-11-17T22:50:48.235+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "news",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "http://www.livemint.com/rf/Image-621x414/LiveMint/Period2/2016/11/18/Photos/Processed/csr3-k68D--621x414@LiveMint.JPG",
        "performance_score": 0,
        "domain_rank": 4429,
        "social": {
          "facebook": {
            "likes": 21,
            "comments": 0,
            "shares": 21
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 1
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "ef933e9401eddaaaad9b4ebde0fbb4e75cbe15ce",
      "url": "http://omgili.com/ri/jHIAmI4hxg.R9M6RBHurip_hPkVssqG9Xq3XwcfSnR1lq5EvWX.fYh19W0.ptcbgtKKnO880yAmF_6wgcK0wpCTAvuZJLZQKrydObShNyaphw3ftsn3KBv0KXI697iOEkwU.0O.JoFw-",
      "ord_in_thread": 0,
      "author": "Sohini Sen",
      "published": "2016-11-17T22:50:48.235+02:00",
      "title": "Citi’s helping hand for art conservation",
      "text": "New Delhi: For the art restoration team at Mumbai’s Chhatrapati Shivaji Maharaj Vastu Sangrahalaya (CSMVS), formerly the Prince of Wales Museum, one look at a 17th century miniature of Ibrahim Adil Shah II, a gum-tempera on paper from the Deccan’s Bijapur district, was enough to indicate that there was a long and laborious process ahead. \nRestoring damaged or decayed art work requires extreme care and is consequently a slow and expensive process. The paint had dried up in the 300-year-old art work and was flaking at the slightest touch of the brush. It took several days for the work to be restored, a process the museum’s chief conservator, Anupam Sah, describes in his book Conserving the Collection: The caring path for 5000 years of our Art . The book was launched during the ongoing ConserveArte exhibition in Mumbai, part of a three-year tie-up with the Citigroup under which an exhibition of selected restored art works is to be organized every year.\nCiti tied up with the museum in October last year as part of its corporate social responsibility (CSR) initiative. Protection of national heritage, art and culture is among the activities listed in the schedule. Few companies have so far taken steps to comply with the CSR rules mandated by the government. In fiscal year 2016, 91 NSE-listed companies spent Rs40.88 crore on social development-related activities, nearly 40% less than in FY2015 when close to Rs68 crore was spent, according to data analysed by NextGen Pvt. Ltd, a CSR consulting firm.\nCitigroup spends a substantial portion of its CSR funds on schemes for financial inclusion and creating economic opportunity for youth. For art and culture, Citi India has set aside Rs4.77 crore from its total CSR-related spend of Rs39.25 crore in FY16. The total includes the Rs13.03 crore spent by the New-York based Citi Foundation on projects on financial inclusion and creating economic opportunities for the youth in India.\nCiti has also tied up with the National Centre for the Performing Arts, Mumbai; India Foundation for the Arts, Bengaluru; and the Kiran Nadar Museum of Art, Delhi, for a number of art and culture initiatives. \nThe company also has a separate Museums on Wheels project with the Chhatrapati Shivaji museum through which it showcases different exhibitions to low-income families within and outside Mumbai. \nExhibitions on Mohenjodaro and dolls of ancient India, which were previously only exhibited in the Chhatrapati Shivaji museum are taken to the smaller districts in Maharashtra, as well as areas such as Dharavi within Mumbai—since these are low-income households whose members wouldn’t visit museums usually. The travelling exhibition is an interactive and educative process spreading awareness about culture and heritage through replicas of art works on display in an air conditioned bus. \n“CSMVS has a collection of over 70,000 objects which epitomizes the rich cultural heritage of our country. The museum is a living monument of our past history in many ways. It is our duty, I feel, to do our part in preserving this heritage through such a prestigious institution,” said Debasis Ghosh, Public Affairs Officer, Citi India.\n“In the first year (October 2015-October 2016), of the 650-700 art-works we have restored, about 150 are of iconic value. Be it the Ashokan edict, the Gandharan Buddha head, or Akbar’s armour—these are pieces which demand their space in history,” says Sah, who has curated the 50 pieces on display at the exhibition.\nCiti’s initiative is not the only example of a corporate funding art projects, but there aren’t too many such. The percentage of CSR funds going into art may be as low as 1%, said Arundhati Ghosh, executive director of the India Foundation for the Arts, a not-for-profit, grant-making organization supporting art practice, research and education in India.\n“There is a conventional understanding of what is ‘good for the world’. In most cases that has to do with serving people less fortunate than us through health, education, etc. However, supporting the arts and culture does not have to come at the cost of this support. They can happen simultaneously with a portion of the overall funds available,” Ghosh said.\nGhosh pointed out that some challenges continue to plague the art and culture segment as corporates often use the scales with which they measure the impact of development projects to determine the impact of the arts. “No one is willing to invest in developing new processes that can truly understand the impact of the arts,” she added.",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [
          {
            "name": "chhatrapati shivaji maharaj vastu sangrahalaya",
            "sentiment": "neutral"
          },
          {
            "name": "buddha",
            "sentiment": "none"
          },
          {
            "name": "bengaluru",
            "sentiment": "none"
          },
          {
            "name": "anupam sah",
            "sentiment": "none"
          },
          {
            "name": "arundhati ghosh",
            "sentiment": "none"
          },
          {
            "name": "sah",
            "sentiment": "none"
          },
          {
            "name": "mohenjodaro",
            "sentiment": "none"
          },
          {
            "name": "ghosh",
            "sentiment": "none"
          },
          {
            "name": "debasis ghosh",
            "sentiment": "none"
          },
          {
            "name": "ibrahim adil shah ii",
            "sentiment": "none"
          }
        ],
        "organizations": [
          {
            "name": "citi",
            "sentiment": "neutral"
          },
          {
            "name": "performing arts",
            "sentiment": "none"
          },
          {
            "name": "kiran nadar museum of art",
            "sentiment": "none"
          },
          {
            "name": "citi india",
            "sentiment": "none"
          },
          {
            "name": "citigroup",
            "sentiment": "none"
          },
          {
            "name": "chhatrapati shivaji",
            "sentiment": "none"
          },
          {
            "name": "nextgen pvt. ltd",
            "sentiment": "none"
          },
          {
            "name": "csr",
            "sentiment": "none"
          },
          {
            "name": "india foundation for the arts",
            "sentiment": "none"
          },
          {
            "name": "citi foundation",
            "sentiment": "none"
          }
        ],
        "locations": [
          {
            "name": "mumbai",
            "sentiment": "none"
          },
          {
            "name": "new delhi",
            "sentiment": "none"
          },
          {
            "name": "maharashtra",
            "sentiment": "none"
          },
          {
            "name": "dharavi",
            "sentiment": "none"
          },
          {
            "name": "bijapur",
            "sentiment": "none"
          },
          {
            "name": "delhi",
            "sentiment": "none"
          },
          {
            "name": "wales museum",
            "sentiment": "none"
          },
          {
            "name": "india",
            "sentiment": "none"
          }
        ]
      },
      "crawled": "2016-11-17T22:50:48.235+02:00"
    },
    {
      "thread": {
        "uuid": "e2d814916fc296e882d9610c5f9a3888dd2c71ca",
        "url": "http://omgili.com/ri/0xd.sZhj5je1vLRWuceEFw3YjSnooRhm4sbpASBVqJYHAYigIv40ggO0FXKBES528Sw1ZRNuuWLEQpxZdILdlA--",
        "site_full": "ca.reuters.com",
        "site": "reuters.com",
        "site_section": "",
        "site_categories": [
          "news"
        ],
        "section_title": "",
        "title": "Citi to sell Canadian subprime lending unit for undisclosed amount | Business | Reuters",
        "title_full": "Citi to sell Canadian subprime lending unit for undisclosed amount | Business | Reuters",
        "published": "2016-11-18T00:00:00.000+02:00",
        "replies_count": 0,
        "participants_count": 0,
        "site_type": "news",
        "country": "US",
        "spam_score": 0.316,
        "main_image": "",
        "performance_score": 0,
        "domain_rank": 408,
        "social": {
          "facebook": {
            "likes": 0,
            "comments": 0,
            "shares": 0
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "e2d814916fc296e882d9610c5f9a3888dd2c71ca",
      "url": "http://omgili.com/ri/0xd.sZhj5je1vLRWuceEFw3YjSnooRhm4sbpASBVqJYHAYigIv40ggO0FXKBES528Sw1ZRNuuWLEQpxZdILdlA--",
      "ord_in_thread": 0,
      "author": "",
      "published": "2016-11-18T00:00:00.000+02:00",
      "title": "Citi to sell Canadian subprime lending unit for undisclosed amount | Business | Reuters",
      "text": "Citi to sell Canadian subprime lending unit for undisclosed amount Thu Nov 17, 2016 12:00pm EST [ - ] Text [ + ] \n(Reuters) - Citigroup Inc (C.N: Quote ) agreed to sell its Canadian subprime lending unit to an investor group led by private investment firm JC Flowers and Värde Partners for an undisclosed amount, as the bank scales back its international consumer banking presence. \nCitiFinancial Canada, which charges a higher interest rate than most mainstream lenders in Canada, has drawn criticism from some consumer advocates over its interest rates and fees. \nThe company offers personal loans that start at 27.99 percent and mortgage refinancing that starts at 10.35 percent, according to the company's website. \nCitiFinancial Canada was not immediately available for comment. \nThe Globe and Mail reported in September that Ontario Teachers' Pension Plan was among the bidders for CitiFinancial Canada. \nThe deal, expected to close in the first half of 2017, will not be material to its earnings, Citi said on Thursday. \nCiti's Institutional Clients Group advised the bank on the deal. National Bank Financial Inc was lead financial adviser to JC Flowers and Värde. Barclays Capital also served as financial adviser to the buyers. \n(Reporting by Sruthi Shankar in Bengaluru; Editing by Shounak Dasgupta) © Thomson Reuters 2016 All rights reserved. ",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [
          {
            "name": "shounak dasgupta",
            "sentiment": "none"
          },
          {
            "name": "sruthi shankar",
            "sentiment": "none"
          }
        ],
        "organizations": [
          {
            "name": "citi",
            "sentiment": "neutral"
          },
          {
            "name": "reuters citi",
            "sentiment": "neutral"
          },
          {
            "name": "jc flowers",
            "sentiment": "none"
          },
          {
            "name": "thomson reuters",
            "sentiment": "none"
          },
          {
            "name": "barclays capital",
            "sentiment": "none"
          },
          {
            "name": "national bank financial inc",
            "sentiment": "none"
          },
          {
            "name": "institutional clients group",
            "sentiment": "none"
          },
          {
            "name": "citifinancial canada",
            "sentiment": "none"
          },
          {
            "name": "reuters",
            "sentiment": "none"
          },
          {
            "name": "globe",
            "sentiment": "none"
          },
          {
            "name": "värde partners",
            "sentiment": "none"
          },
          {
            "name": "ontario teachers",
            "sentiment": "none"
          },
          {
            "name": "citigroup inc",
            "sentiment": "none"
          }
        ],
        "locations": [
          {
            "name": "bengaluru",
            "sentiment": "none"
          },
          {
            "name": "canada",
            "sentiment": "none"
          }
        ]
      },
      "crawled": "2016-11-18T13:30:48.254+02:00"
    },
    {
      "thread": {
        "uuid": "d48ed12603d1b2732683c3f45404620813c243bf",
        "url": "http://omgili.com/ri/jHIAmI4hxg8WtCPbSkXcA1_JzXAuw2t9w66061KogAgiEfgeLr7Jup3Nq3QttaZI7dywTrzf1BTBUotw.TAwWP_psjGMtFiyVTFpFlbOHVpg_mrDark994fZs.fxSdMg1t55boI5o_Qsieyhp61gYORuNWXHazz8",
        "site_full": "www.benzinga.com",
        "site": "benzinga.com",
        "site_section": "http://feeds.benzinga.com/benzinga",
        "site_categories": [
          "news",
          "business"
        ],
        "section_title": "Benzinga - Stock Market Quotes, Business News, Financial News, Trading Ideas, and Stock Research by Professionals",
        "title": "Citi's Neutral-To-Bullish Call On The Airliners",
        "title_full": "Citi's Neutral-To-Bullish Call On The Airliners",
        "published": "2016-11-18T16:21:28.119+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "news",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "https://cdn2.benzinga.com/files/imagecache/bz2_opengraph_meta_image_400x300/images/story/2012/aircraft-123005_1920_0.jpg",
        "performance_score": 0,
        "domain_rank": 23263,
        "social": {
          "facebook": {
            "likes": 0,
            "comments": 0,
            "shares": 0
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "d48ed12603d1b2732683c3f45404620813c243bf",
      "url": "http://omgili.com/ri/jHIAmI4hxg8WtCPbSkXcA1_JzXAuw2t9w66061KogAgiEfgeLr7Jup3Nq3QttaZI7dywTrzf1BTBUotw.TAwWP_psjGMtFiyVTFpFlbOHVpg_mrDark994fZs.fxSdMg1t55boI5o_Qsieyhp61gYORuNWXHazz8",
      "ord_in_thread": 0,
      "author": "Jim Swanson",
      "published": "2016-11-18T16:21:28.119+02:00",
      "title": "Citi's Neutral-To-Bullish Call On The Airliners",
      "text": "Hey, Buffett! This Is the Better Airline Stock to Buy (GuruFocus) \n“The US airline industry has been hosting a renaissance party for investors,” Citi’s Kevin Crissey said in a report. All the stocks in this segment have at least tripled over the last five years. \n“Although we are staying at the party from a ratings perspective, we’ve moved away from the punch bowl,” Crissey commented. Top Pick \nCrissey named American Airlines Group Inc (NASDAQ: AAL ) as the top pick among U.S. airlines , saying the company would benefit from “unique post-merger efficiency opportunities” and lower capex. He initiated coverage of the company with a Buy rating and a price target of $55. Other Buy-Rated Stocks Allegiant Travel Company (NASDAQ: ALGT ): Initiated at Buy with a price target of $185. Delta Air Lines, Inc. (NYSE: DAL ): Initiated at Buy with a price target of $61. Southwest Airlines Co (NYSE: LUV ): Initiated at Buy with a price target of $57. Neutral-Rated Stocks Alaska Air Group, Inc. (NYSE: ALK ): Initiated at Neutral with a price target of $81. Hawaiian Holdings, Inc. (NASDAQ: HA ): Initiated at Neutral with a price target of $48. JetBlue Airways Corporation (NASDAQ: JBLU ): Initiated at Neutral with a price target of $22. United Continental Holdings Inc (NYSE: UAL ): Initiated at Neutral with a price target of $69 Downgrade Spirit Airlines Incorporated (NASDAQ: SAVE ): Downgraded from Buy to Neutral, while raising the price target from $52 to $61. \n“We think valuation on SAVE shares already discounts a substantial portion of its near-term growth opportunities,” the analyst mentioned. In Friday's Pre-Market Alaska closed Thursday at $78.85. Allegiant closed Thursday at $160.80. American was up 1.03 percent at $46.30. Delta was up 1.26 percent at $49.12. Hawaiian was up 2.03 percent at $50. JetBlue was up 0.05 percent at $20.75. Southwest was up 0.66 percent at $47. Spirit was down 1.43 percent at $53.10. United was up 0.72 percent at $68.35. Latest Ratings for AAL",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [
          {
            "name": "buffett",
            "sentiment": "neutral"
          },
          {
            "name": "top pick  crissey",
            "sentiment": "none"
          },
          {
            "name": "crissey",
            "sentiment": "none"
          },
          {
            "name": "kevin crissey",
            "sentiment": "none"
          }
        ],
        "organizations": [
          {
            "name": "citi",
            "sentiment": "neutral"
          },
          {
            "name": "better airline stock",
            "sentiment": "neutral"
          },
          {
            "name": "allegiant",
            "sentiment": "none"
          },
          {
            "name": "downgrade spirit airlines incorporated",
            "sentiment": "none"
          },
          {
            "name": "delta",
            "sentiment": "none"
          },
          {
            "name": "jetblue airways corporation",
            "sentiment": "none"
          },
          {
            "name": "delta air lines, inc.",
            "sentiment": "none"
          },
          {
            "name": "allegiant travel company",
            "sentiment": "none"
          },
          {
            "name": "jetblue",
            "sentiment": "none"
          },
          {
            "name": "ual",
            "sentiment": "none"
          },
          {
            "name": "hawaiian holdings, inc.",
            "sentiment": "none"
          },
          {
            "name": "southwest airlines co",
            "sentiment": "none"
          },
          {
            "name": "neutral-rated stocks alaska air group, inc.",
            "sentiment": "none"
          },
          {
            "name": "united continental holdings inc",
            "sentiment": "none"
          },
          {
            "name": "american airlines group inc",
            "sentiment": "none"
          },
          {
            "name": "nyse",
            "sentiment": "none"
          },
          {
            "name": "southwest",
            "sentiment": "none"
          }
        ],
        "locations": [
          {
            "name": "us",
            "sentiment": "none"
          },
          {
            "name": "pre-market alaska",
            "sentiment": "none"
          },
          {
            "name": "u.s.",
            "sentiment": "none"
          },
          {
            "name": "ha",
            "sentiment": "none"
          }
        ]
      },
      "crawled": "2016-11-18T16:21:28.119+02:00"
    },
    {
      "thread": {
        "uuid": "a1b114bfaa99a5649f6908bfa83cd7b29c2c4a65",
        "url": "http://omgili.com/ri/jHIAmI4hxg8nqlc1XwVAxhT1Gc5dE8KjHVtXMc0sg7Ygmy2N5K0IJKKxSM7bHOryWT_wG.klyCSUk.sMFQodWBw2qeAJpCmMgs8NLrFjfMlCf5EPQD_WG075u4Zb_i_SI1ZY1eaTOKkeMsbYgwHrdgIoxO3D28bvPjPee.PEYKA-",
        "site_full": "www.flyertalk.com",
        "site": "flyertalk.com",
        "site_section": "http://www.flyertalk.com/forum/",
        "site_categories": [
          "entertainment",
          "education"
        ],
        "section_title": "FlyerTalk Forums",
        "title": "statement generated in Nov but not sent to me and not showing online!",
        "title_full": "statement generated in Nov but not sent to me and not showing online!",
        "published": "2016-11-21T19:11:45.022+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "blogs",
        "country": "US",
        "spam_score": 0.0,
        "main_image": null,
        "performance_score": 0,
        "domain_rank": 5203,
        "social": {
          "facebook": {
            "likes": 0,
            "comments": 0,
            "shares": 0
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "a1b114bfaa99a5649f6908bfa83cd7b29c2c4a65",
      "url": "http://omgili.com/ri/jHIAmI4hxg8nqlc1XwVAxhT1Gc5dE8KjHVtXMc0sg7Ygmy2N5K0IJKKxSM7bHOryWT_wG.klyCSUk.sMFQodWBw2qeAJpCmMgs8NLrFjfMlCf5EPQD_WG075u4Zb_i_SI1ZY1eaTOKkeMsbYgwHrdgIoxO3D28bvPjPee.PEYKA-",
      "ord_in_thread": 0,
      "author": "sdsearch",
      "published": "2016-11-21T19:11:45.022+02:00",
      "title": "statement generated in Nov but not sent to me and not showing online!",
      "text": "On my Citi AA Gold card, in October I had a statement with a payment due. I made the payment on time. I made no futher purchases in that cycle.\n\nNow the citi.com site says my last statement closed Nov 10, but my only statements available online are for Sep and Oct! And if I looked my account activity, it shows me since Nov 10, or from my Sep and Oct statements! (So nothing online shows me the statement period when I made that last payment.)\n\nAnd I never got that November statement in the mail yet!\n\nI was able to \"request\" a PDF of the statement, they put that in my account a day or two later, but say it will only stay there for 7 days. (I can download it, tho.)\n\nI called up Citi, they don't know why all this happened, but they will send me a \"duplicate\" paper statement.\n\nThen they had the gall to ask me if I wanted to switch to paperless. Huh? They can't make the statement appear \"normally\" online, they can only send me a \"duplicate\" paper copy. or post it online in a version that expires in 7 days, and they want me to rely only on their buggy website??? :confused: No thanks! :eek: ",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [],
        "organizations": [
          {
            "name": "citi",
            "sentiment": "neutral"
          }
        ],
        "locations": []
      },
      "crawled": "2016-11-21T19:11:45.022+02:00"
    },
    {
      "thread": {
        "uuid": "213025641e345d66737ab3125ab37bd945b0e8e4",
        "url": "http://omgili.com/ri/vkc1Z8ITDMvk_LtskrSKndhtxLwqxMZg9gUo5OBOiEixSO5MH6Ie9FYk4E9E3VXw",
        "site_full": "video.cnbc.com",
        "site": "cnbc.com",
        "site_section": "http://www.cnbc.com/id/100004038/device/rss/rss.html",
        "site_categories": [
          "business"
        ],
        "section_title": "Latest Video",
        "title": "Citi and JPMorgan named world's most systematically important banks",
        "title_full": "Citi and JPMorgan named world's most systematically important banks",
        "published": "2016-11-21T19:13:41.334+02:00",
        "replies_count": 0,
        "participants_count": 0,
        "site_type": "news",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "http://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/11/21/104121417-2ED2-BL-Banks-112116.600x400.jpg",
        "performance_score": 0,
        "domain_rank": 767,
        "social": {
          "facebook": {
            "likes": 1,
            "comments": 0,
            "shares": 1
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "213025641e345d66737ab3125ab37bd945b0e8e4",
      "url": "http://omgili.com/ri/vkc1Z8ITDMvk_LtskrSKndhtxLwqxMZg9gUo5OBOiEixSO5MH6Ie9FYk4E9E3VXw",
      "ord_in_thread": 0,
      "author": "",
      "published": "2016-11-21T19:13:41.334+02:00",
      "title": "Citi and JPMorgan named world's most systematically important banks",
      "text": "Citi and JPMorgan named world's most systematically important banks 2 Hours Ago",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [],
        "organizations": [
          {
            "name": "jpmorgan",
            "sentiment": "neutral"
          },
          {
            "name": "citi",
            "sentiment": "neutral"
          }
        ],
        "locations": []
      },
      "crawled": "2016-11-21T19:13:41.334+02:00"
    },
    {
      "thread": {
        "uuid": "83834fbfa482a49bc74a1371b801e97009134984",
        "url": "http://omgili.com/ri/2wGaacqxApvQboY7on5a1l9L3GcBODsgg0QtL0JzN42dstbhyvXj.vUh0ZQBk_AH.83HD2GYXx4.gyuN_UKzz40ZTAPiJk1082cNjdWZ8k3bIFD.Yu9C0ZgVOzDASJAsz5XK_oQ9Y.2GhilBZsNAvNhgMwF.qCn8",
        "site_full": "markets.financialcontent.com",
        "site": "financialcontent.com",
        "site_section": "http://stocks.investingdaily.com/investingdaily/action/rssfeed?ChannelID=3193",
        "site_categories": [
          "finance",
          "business"
        ],
        "section_title": "theflyonthewall.com",
        "title": "Charles Schwab upgraded to Buy from Neutral at Citi",
        "title_full": "Charles Schwab upgraded to Buy from Neutral at Citi",
        "published": "2016-11-22T15:48:35.028+02:00",
        "replies_count": 0,
        "participants_count": 0,
        "site_type": "blogs",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "",
        "performance_score": 0,
        "domain_rank": 86243,
        "social": {
          "facebook": {
            "likes": 0,
            "comments": 0,
            "shares": 0
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "83834fbfa482a49bc74a1371b801e97009134984",
      "url": "http://omgili.com/ri/2wGaacqxApvQboY7on5a1l9L3GcBODsgg0QtL0JzN42dstbhyvXj.vUh0ZQBk_AH.83HD2GYXx4.gyuN_UKzz40ZTAPiJk1082cNjdWZ8k3bIFD.Yu9C0ZgVOzDASJAsz5XK_oQ9Y.2GhilBZsNAvNhgMwF.qCn8",
      "ord_in_thread": 0,
      "author": "",
      "published": "2016-11-22T15:48:35.028+02:00",
      "title": "Charles Schwab upgraded to Buy from Neutral at Citi",
      "text": "  07:55 AM EST Charles Schwab upgraded to Buy from Neutral at Citi  ",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [
          {
            "name": "charles schwab",
            "sentiment": "neutral"
          }
        ],
        "organizations": [
          {
            "name": "citi",
            "sentiment": "neutral"
          }
        ],
        "locations": []
      },
      "crawled": "2016-11-22T15:48:35.028+02:00"
    },
    {
      "thread": {
        "uuid": "c22f361a1e2706e1f6aa62582926a0b87552a889",
        "url": "http://omgili.com/ri/jHIAmI4hxg.YuZjPcTcrfKQXWWp.8B_z87wDFwH_p5uoSDL7I7CSJzBxXzccs4ZJmuPjquXB3K8FA1ZIDeD0AgPQBNYMdhUeJzUxKGtUGewoetsrnRR6x_mHPHO7xFwlEz8NvRTVLsq6tDkIdLZua3p.8DnFg_1O4v_p.qWoWhQ-",
        "site_full": "www.financialexpress.com",
        "site": "financialexpress.com",
        "site_section": "",
        "site_categories": [
          "news",
          "education",
          "business"
        ],
        "section_title": "",
        "title": "Sensex to hit 30,000 mark by September 2017, instead of March: Citi - The Financial Express.",
        "title_full": "Sensex to hit 30,000 mark by September 2017, instead of March: Citi - The Financial Express.",
        "published": "2016-11-24T10:45:32.120+02:00",
        "replies_count": 0,
        "participants_count": 0,
        "site_type": "news",
        "country": "US",
        "spam_score": 0.205,
        "main_image": "http://images.financialexpress.com/2016/11/sensex-thumb-1.jpg",
        "performance_score": 0,
        "domain_rank": 4726,
        "social": {
          "facebook": {
            "likes": 94,
            "comments": 0,
            "shares": 94
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "c22f361a1e2706e1f6aa62582926a0b87552a889",
      "url": "http://omgili.com/ri/jHIAmI4hxg.YuZjPcTcrfKQXWWp.8B_z87wDFwH_p5uoSDL7I7CSJzBxXzccs4ZJmuPjquXB3K8FA1ZIDeD0AgPQBNYMdhUeJzUxKGtUGewoetsrnRR6x_mHPHO7xFwlEz8NvRTVLsq6tDkIdLZua3p.8DnFg_1O4v_p.qWoWhQ-",
      "ord_in_thread": 0,
      "author": "Fe Online",
      "published": "2016-11-24T10:45:32.120+02:00",
      "title": "Sensex to hit 30,000 mark by September 2017, instead of March: Citi - The Financial Express.",
      "text": "Sensex to hit 30,000 mark by September 2017, instead of March: Citi Sensex to hit 30,000 mark by September 2017, instead of March: Citi Citi expects the Sensex to hit the 30,000 mark by September 2017, as against the earlier projection of March 2017. By: FE Online | Published: November 24, 2016 11:09 AM Surendra Goyal, Head of India Equity Research at Citi India told CNBC-TV 18 that FIIs (Foreign Institutional Investors) will be spooked by rupee’s depreciation. \nCiti expects the Sensex to hit the 30,000 mark by September 2017, as against the earlier projection of March 2017. Surendra Goyal, Head of India Equity Research at Citi India told CNBC-TV 18 that FIIs (Foreign Institutional Investors) will be spooked by rupee’s depreciation. Goyal believes that it is tough to assess the damage caused by demonetisation. Talking sector-specific, Goyal said that real estate, cement, consumer discretionary, rural-focused NBFCs will face stress for longer time than others on account of demonetisation. Citi is overweight on pharma due to its “reasonable valuation”, Goyal said. He expects pharma sector earnings to be better than IT. As far as the IT goes, Goyal is of the view that the visa issue will compound the problems that the sector is already facing. \nMeanwhile, Morgan Stanley has kept its March 2017 target unchanged at 30,000, stating that the impact of a US Federal rate hike “seems to be becoming less relevant for the domestic market”. “In the context of the country’s macro stability today that risk (Fed) is less relevant to India. We are pretty comfortable and in fact this is the first time since the liberalisation 25 years ago that India has cut rates against a Fed rate hike (Fed had hiked rates last December but RBI has lowered rates since then),” Morgan Stanley India Equity Strategist Ridham Desai was reported as saying. “This is a manifestation of the strength of our external balancesheet. We never had the courage to go against the Fed in the past. And our base call is that this will happen the second time when RBI cuts interest rates as against a hike by US Fed,” he added. \n\n— CNBC-TV18 News (@CNBCTV18News) November 24, 2016 \nBesides, PTI reported Ridham Desai as saying that while demonetisation will have some negative impact on the Indian economy in the short term, the scenario looks positive in the long run. “Demonetisation is not a serious issue. People are making a big deal out of it. If there will be a problem in the economy why to think there will not be any response from the policymakers and RBI?” he asked. Interestingly, Desai said GST would have a much larger implication on unaccounted money compared to scrapping of high value notes. \n(With inputs from PTI) Please Wait while comments are loading... Trending Now ",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [
          {
            "name": "sep",
            "sentiment": "neutral"
          },
          {
            "name": "surendra goyal",
            "sentiment": "none"
          },
          {
            "name": "desai",
            "sentiment": "none"
          },
          {
            "name": "goyal",
            "sentiment": "none"
          },
          {
            "name": "ridham desai",
            "sentiment": "none"
          }
        ],
        "organizations": [
          {
            "name": "citi sensex",
            "sentiment": "negative"
          },
          {
            "name": "citi",
            "sentiment": "neutral"
          },
          {
            "name": "citi india",
            "sentiment": "none"
          },
          {
            "name": "head of india equity research",
            "sentiment": "none"
          },
          {
            "name": "nbfcs",
            "sentiment": "none"
          },
          {
            "name": "fed",
            "sentiment": "none"
          },
          {
            "name": "citi citi",
            "sentiment": "none"
          },
          {
            "name": "pti",
            "sentiment": "none"
          },
          {
            "name": "morgan stanley",
            "sentiment": "none"
          },
          {
            "name": "us fed",
            "sentiment": "none"
          },
          {
            "name": "morgan stanley india equity",
            "sentiment": "none"
          },
          {
            "name": "cnbc-tv",
            "sentiment": "none"
          }
        ],
        "locations": [
          {
            "name": "us",
            "sentiment": "none"
          },
          {
            "name": "india",
            "sentiment": "none"
          }
        ]
      },
      "crawled": "2016-11-24T10:45:32.120+02:00"
    },
    {
      "thread": {
        "uuid": "ead8080ed79cf813d491d8e808db3d91767448e9",
        "url": "http://omgili.com/ri/snFTpiOKdJX21Vfqf.ik4imIMDSEyRMJ83rdddbgKN19YmaPhAUCeR52vwZKGHhOVqotRxavCgK59mIWBU_Yi8pWlggMD6hC",
        "site_full": "news.efinancialcareers.com",
        "site": "efinancialcareers.com",
        "site_section": "http://news.efinancialcareers.com/us-en/feed",
        "site_categories": [
          "education",
          "business"
        ],
        "section_title": "eFinancialCareersEnglish (UK) – eFinancialCareers",
        "title": "Citi’s head of UK investment banking says students need to find out what they really want to do",
        "title_full": "Citi’s head of UK investment banking says students need to find out what they really want to do",
        "published": "2016-11-25T16:09:39.060+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "news",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "http://news-cdn.efinancialcareers.com/wp-content/uploads/GettyImages-458266487-1.jpg",
        "performance_score": 0,
        "domain_rank": 26002,
        "social": {
          "facebook": {
            "likes": 0,
            "comments": 0,
            "shares": 0
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "ead8080ed79cf813d491d8e808db3d91767448e9",
      "url": "http://omgili.com/ri/snFTpiOKdJX21Vfqf.ik4imIMDSEyRMJ83rdddbgKN19YmaPhAUCeR52vwZKGHhOVqotRxavCgK59mIWBU_Yi8pWlggMD6hC",
      "ord_in_thread": 0,
      "author": "Paul Clarke",
      "published": "2016-11-25T16:09:39.060+02:00",
      "title": "Citi’s head of UK investment banking says students need to find out what they really want to do",
      "text": "by Paul Clarke About an hour ago \nIf you’re a student trying to break into investment banking now, can you be casual about your journey towards your first job? Now that students are better qualified than ever,  en/252925/why-lloyd-blankfeins-careers-advice-is-wrong/ \nIf you’re a student trying to break into investment banking now, can you be casual about your journey towards your first job? Now that students are better qualified than ever, laden with internships and impeccable academics, can you take the time to find yourself? \nMaybe not. But Michael Lavelle, UK and Ireland head of corporate and investment banking and EMEA vice chairman of corporate and investment banking at Citigroup, believes that the next generation of bankers needs to at least ensure they’re making the right choice before they start. \n“I would encourage the next generation of investment bankers to experience as much as they can,” he said on the sidelines of the UCLU investment society conference today. “Find out what you like, and I don’t just mean financial services. Get as much experience as you can in as many industries as you can to find out what you really enjoy.” \nLavelle echoes Lloyd Blankfein, CEO of Goldman Sachs, who’s long been saying that students need to chill out and explore. “To succeed, you have to be a complete person. In the early part of your life you should focus a lot on being a complete person,” suggested Lloyd back in 2013. \nThe idea, as Lavelle explains it, is not to take your foot of the gas. If you want to be among the 4% or so of students who make the cut for investment banks’ graduate programmes you need to be focused on this goal from the moment you start university. Instead, he says the point is to ensure that you’ve had enough different experiences to really inform the decision you make before accepting an investment banking job. The churn in the junior investment banking ranks currently suggests that not everyone accepting the jobs has made the most informed choice. \nLavelle said that when he started out in investment banking 26 years ago, he didn’t really have a clear idea of what he wanted to do. Having a linear plan is not the answer, he suggests. Until last year, he was head of equity capital markets at Citi, but was promoted to his current role in July 2015. He was made managing director at Citigroup at the age of 26. \n“I knew that I wanted to work in financial services, work with interesting people and travel the world,” he said. “All of those things are true today.” \nLavelle’s views are perhaps a little surprising, considering the competition banks are facing from the likes of Google and Facebook for the best graduate talent. He says that investment banks are alive to the threat, but graduates are still interested in banking. \n“The CVs we’re getting now are the best we’ve ever had,” he says. “I’m not complacent that it’s harder to attract the very best talent from the large technology companies and others, but we’re receiving hundreds, if not thousands of applications for the jobs we have.” \nLavelle admits he’s “evangelical” about the industry. “It’s great industry, it’s great fun, you can do it for a long time,” he said. It can be intellectually rewarding and it can be financially rewarding,” he said. \nLavelle also played down the impact of Brexit on recruitment. Citi wouldn’t reduce hiring or cut heads in Europe as a direct result of Brexit, he said. Citi was moving people out of London into cheaper locations anyway, into centres in Derby and Belfast in the UK. “There are more cost-effective places to base people, and for their perspective, the cost of living is lower.” \n“We don’t know how many people will be incrementally reduced as a result of Brexit. It may be zero, but it will probably be a modest number – in the hundreds.”",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [
          {
            "name": "paul clarke",
            "sentiment": "neutral"
          },
          {
            "name": "lavelle",
            "sentiment": "none"
          },
          {
            "name": "lloyd blankfein",
            "sentiment": "none"
          },
          {
            "name": "michael lavelle",
            "sentiment": "none"
          }
        ],
        "organizations": [
          {
            "name": "citi",
            "sentiment": "neutral"
          },
          {
            "name": "goldman sachs",
            "sentiment": "none"
          },
          {
            "name": "emea",
            "sentiment": "none"
          },
          {
            "name": "citigroup",
            "sentiment": "none"
          },
          {
            "name": "uclu",
            "sentiment": "none"
          },
          {
            "name": "facebook",
            "sentiment": "none"
          },
          {
            "name": "google",
            "sentiment": "none"
          },
          {
            "name": "lloyd",
            "sentiment": "none"
          }
        ],
        "locations": [
          {
            "name": "uk",
            "sentiment": "none"
          },
          {
            "name": "belfast",
            "sentiment": "none"
          },
          {
            "name": "ireland",
            "sentiment": "none"
          },
          {
            "name": "brexit",
            "sentiment": "none"
          },
          {
            "name": "europe",
            "sentiment": "none"
          },
          {
            "name": "derby",
            "sentiment": "none"
          },
          {
            "name": "london",
            "sentiment": "none"
          }
        ]
      },
      "crawled": "2016-11-25T16:09:39.060+02:00"
    },
    {
      "thread": {
        "uuid": "32e8f755855f5cc802a4f2b3531825f027fc2aca",
        "url": "http://omgili.com/ri/0xd.sZhj5jdSY1Pv4POXfBE7R_r5ueLn7kldD.h5DIkjPcMLtSZi7Zwo4MtHAAqEoNu.wvE43jGSgV2QRvGJf6DWBCv4QqC2URkORemM6S4-",
        "site_full": "creditcardforum.com",
        "site": "creditcardforum.com",
        "site_section": "http://creditcardforum.com/feed.php",
        "site_categories": [
          "business"
        ],
        "section_title": "The #1 Credit Card Message Board & Credit Forum",
        "title": "Rewards • Re: Citi Hilton HHonors card.",
        "title_full": "Rewards • Re: Citi Hilton HHonors card.",
        "published": "2016-11-28T18:52:19.464+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "blogs",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "",
        "performance_score": 0,
        "domain_rank": 75189,
        "social": {
          "facebook": {
            "likes": 0,
            "comments": 0,
            "shares": 0
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "32e8f755855f5cc802a4f2b3531825f027fc2aca",
      "url": "http://omgili.com/ri/0xd.sZhj5jdSY1Pv4POXfBE7R_r5ueLn7kldD.h5DIkjPcMLtSZi7Zwo4MtHAAqEoNu.wvE43jGSgV2QRvGJf6DWBCv4QqC2URkORemM6S4-",
      "ord_in_thread": 0,
      "author": "CarefulBuilder14",
      "published": "2016-11-28T18:52:19.464+02:00",
      "title": "Rewards • Re: Citi Hilton HHonors card.",
      "text": "Don't expect customer service to be any better on either Citi Hilton card. Citi isn't exactly known for their customer service, period. Their buffoon CEO probably has 100% of the customer service based in India besides their supervisors. These are the same customer service reps that said contactless payments are being phased out around the world, and didn't understand that my access checking account doesn't have overdraft fees. \"I'm not sure why your account doesn't have overdraft fees, Michael.\"\"Gee perhaps it's because you're a dimwit moron who shouldn't have a customer service job.\"At least other company have SOME English speaking front line customer service reps. Customer service 101: You never say \"I don't know\" or \"I'm not sure\" to a customer. Be knowledgeable. I wouldn't be bothered at all to see Corbat go. Sometimes I wish CSRs would have said \"I don't know\" rather than make something up to appear knowledgeable and misleading me.I can't say I've had complaints about Prestige CSRs, but I've most just called that \"back of the card\" number to be transferred to the concierge or benefits teams.I've not had much experience with obviously foreign CSRs, but I've had my share of domestic idiots.  ",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [
          {
            "name": "corbat",
            "sentiment": "none"
          },
          {
            "name": "michael",
            "sentiment": "none"
          }
        ],
        "organizations": [
          {
            "name": "citi",
            "sentiment": "neutral"
          },
          {
            "name": "citi hilton",
            "sentiment": "neutral"
          }
        ],
        "locations": [
          {
            "name": "india",
            "sentiment": "none"
          }
        ]
      },
      "crawled": "2016-11-28T18:52:19.464+02:00"
    },
    {
      "thread": {
        "uuid": "e14fc6cb5d6405c1202cf6cb3004ade83edf42a8",
        "url": "http://omgili.com/ri/8HG_hanVOKzR4spksmDlbHm65bZQBsSdQjWEwr2E_7ttGKgYwCz8VqwJ36caxz9WduT6gITRIG2dEiwcN_3nbblVUGWHyOR6cr7LvY6viycEGxrg9oGjAw--",
        "site_full": "pix11.com",
        "site": "pix11.com",
        "site_section": "http://pix11.com",
        "site_categories": [
          "news"
        ],
        "section_title": "Lawmakers push for Citi Bike expansion to all boroughs – New York's PIX11 / WPIX-TV",
        "title": "Lawmakers push for Citi Bike expansion to all boroughs",
        "title_full": "Lawmakers push for Citi Bike expansion to all boroughs",
        "published": "2016-11-29T19:37:25.280+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "blogs",
        "country": "US",
        "spam_score": 0.0,
        "main_image": null,
        "performance_score": 0,
        "domain_rank": 26925,
        "social": {
          "facebook": {
            "likes": 0,
            "comments": 0,
            "shares": 0
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "e14fc6cb5d6405c1202cf6cb3004ade83edf42a8",
      "url": "http://omgili.com/ri/8HG_hanVOKzR4spksmDlbHm65bZQBsSdQjWEwr2E_7ttGKgYwCz8VqwJ36caxz9WduT6gITRIG2dEiwcN_3nbblVUGWHyOR6cr7LvY6viycEGxrg9oGjAw--",
      "ord_in_thread": 0,
      "author": "tirellat94",
      "published": "2016-11-29T19:37:25.280+02:00",
      "title": "Lawmakers push for Citi Bike expansion to all boroughs",
      "text": "Please enable Javascript to watch this video The Citi Bike bike share program has had its ups and downs in New York City, but after a few hiccups some would argue most New Yorkers have come around on the topic.\nNow, however, you have some — like Bronx Borough President Ruben Diaz, Jr. asking — when is our neighborhood next?\n“Now is the time for Bronxites that we are thinking differently about ourselves, we deserve the very best,\" Diaz said. \"We deserve what the rest of the city is getting.\"\nAsk Bronx residents and most say they would absolutely use Citi Bikes in their borough. But when can they?\nAccording to Citi Bike's own expansion map, by the end of 2016 the system will have 10, 000 bikes and by the end of 2017, 12,000 bikes.\nYet not a single one will be in the Bronx or Staten Island.\n“When they announced a couple of years ago that they would expand to other parts of the city to New Jersey, but not the Bronx, we took exception to that,” recalled Diaz.\nA City Council Transportation Committee hearing addressed these concerns among others on Monday.\n“We strongly believe that it is time to bring some public and increase of private dollars to this important mode of transportation,” explained Transportation Committee Chair, Councilmember Ydanis Rodriguez.\nTracy Capers is from a nonprofit organization out of Bedford-Stuyvesant and she's worked with Citi Bike to bring the program to her neighborhood.\nCapers said she's seen first hand how Citi Bikes went from a \"not in my neighborhood\" conversation to a \"what about my neighborhood\" discussion instead.\n“One of the things we’ve been fighting is trying to change the conversation that bike share is a tool regardless of income and for people of color and low income communities. It's not a tool of gentrification,\" Capers said.",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [
          {
            "name": "capers",
            "sentiment": "none"
          },
          {
            "name": "tracy capers",
            "sentiment": "none"
          },
          {
            "name": "ydanis rodriguez",
            "sentiment": "none"
          },
          {
            "name": "diaz",
            "sentiment": "none"
          },
          {
            "name": "ruben diaz",
            "sentiment": "none"
          }
        ],
        "organizations": [
          {
            "name": "citi bike",
            "sentiment": "neutral"
          },
          {
            "name": "citi",
            "sentiment": "neutral"
          },
          {
            "name": "citi bikes",
            "sentiment": "none"
          },
          {
            "name": "city council transportation committee",
            "sentiment": "none"
          },
          {
            "name": "bronx borough",
            "sentiment": "none"
          },
          {
            "name": "transportation committee chair",
            "sentiment": "none"
          }
        ],
        "locations": [
          {
            "name": "new york city",
            "sentiment": "none"
          },
          {
            "name": "bronx",
            "sentiment": "none"
          },
          {
            "name": "bedford-stuyvesant",
            "sentiment": "none"
          },
          {
            "name": "new jersey",
            "sentiment": "none"
          },
          {
            "name": "staten island",
            "sentiment": "none"
          }
        ]
      },
      "crawled": "2016-11-29T19:37:25.280+02:00"
    },
    {
      "thread": {
        "uuid": "a264e13ea3f00a6c9aa3673acc621ad3ff5ac33b",
        "url": "http://omgili.com/ri/DyQaNGXlfMpabjFEI9brHZkv_d_VAhRHpjSIzsd4IQEQzQK5eqv64txuCYxcuTajv9LyCeHNz3qzGfwwS_HTSrRbPA4OI2Nbp4lttfY1418-",
        "site_full": "toronto.backpage.com",
        "site": "backpage.com",
        "site_section": "http://ontario.backpage.com/online/exports/Rss.xml?category=511551&key=Datelines&section=4381",
        "site_categories": [
          "business"
        ],
        "section_title": "backpage.com | phone & websites | ontario, on",
        "title": "Numbers for Sexting in Canada - 19",
        "title_full": "Numbers for Sexting in Canada - 19",
        "published": "2016-12-06T03:47:00.000+02:00",
        "replies_count": 0,
        "participants_count": 0,
        "site_type": "blogs",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "",
        "performance_score": 0,
        "domain_rank": 949,
        "social": {
          "facebook": {
            "likes": 0,
            "comments": 0,
            "shares": 0
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "a264e13ea3f00a6c9aa3673acc621ad3ff5ac33b",
      "url": "http://omgili.com/ri/DyQaNGXlfMpabjFEI9brHZkv_d_VAhRHpjSIzsd4IQEQzQK5eqv64txuCYxcuTajv9LyCeHNz3qzGfwwS_HTSrRbPA4OI2Nbp4lttfY1418-",
      "ord_in_thread": 0,
      "author": "",
      "published": "2016-12-06T03:47:00.000+02:00",
      "title": "Numbers for Sexting in Canada - 19",
      "text": "Want to engage in phone chat or sexting? Here are the hottest SEXTING numbers in Major Canadian Cities. \nGet a Free trial Today PHONE NUMBERS",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [],
        "organizations": [
          {
            "name": "citi",
            "sentiment": "neutral"
          }
        ],
        "locations": [
          {
            "name": "canada",
            "sentiment": "none"
          }
        ]
      },
      "crawled": "2016-12-06T04:51:43.816+02:00"
    }
  ],
  "totalResults": 20,
  "moreResultsAvailable": 0,
  "next": "/search?token=c6052904-f312-436b-a6d8-d915084ac866&format=json&ts=1480992703816&q=language%3A%28english%29+thread.country%3AUS+organization.neutral%3A%22Citi%22",
  "requestsLeft": 1081
}
