{
  "posts": [
    {
      "thread": {
        "uuid": "7828dcf25f46b4219f1762495439a0a74bbb8049",
        "url": "http://omgili.com/ri/jHIAmI4hxg.fKmqfQ3WsnQ861rqFK0bO7fL4EbILjATdw08_uPdw7JWBjjcy2XX1Tu7BFXn4kkpP5TN3LAYjIAj6hW9omoxoDAUx5GSlW4u27YrLb2J9.teQ0vKYSuG9",
        "site_full": "www.heraldnet.com",
        "site": "heraldnet.com",
        "site_section": "http://www.heraldnet.com/section/RSS01&mime=xml",
        "site_categories": [
          "news"
        ],
        "section_title": "HeraldNet.com",
        "title": "Boeing most experienced workers are packing up their tools",
        "title_full": "Boeing most experienced workers are packing up their tools",
        "published": "2016-11-08T16:30:00.000+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "news",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "http://www.heraldnet.com/wp-content/uploads/2016/11/web1_tsr-Boeing-edh-161109.jpg",
        "performance_score": 0,
        "domain_rank": 42798,
        "social": {
          "facebook": {
            "likes": 0,
            "comments": 0,
            "shares": 0
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "7828dcf25f46b4219f1762495439a0a74bbb8049",
      "url": "http://omgili.com/ri/jHIAmI4hxg.fKmqfQ3WsnQ861rqFK0bO7fL4EbILjATdw08_uPdw7JWBjjcy2XX1Tu7BFXn4kkpP5TN3LAYjIAj6hW9omoxoDAUx5GSlW4u27YrLb2J9.teQ0vKYSuG9",
      "ord_in_thread": 0,
      "author": "Wire Service",
      "published": "2016-11-08T16:30:00.000+02:00",
      "title": "Boeing most experienced workers are packing up their tools",
      "text": "The Boeing Co. plant in Everett on June 1, 2015. (David Ryder / Bloomberg) Boeing most experienced workers are packing up their tools Tue Nov 8th, 2016 1:58pm You must sign in or register to continue reading content. \nBy Julie Johnsson , Bloomberg \nJohn Rothery said his goodbyes, handed in his badge and walked away from Boeing. He had worked on almost every commercial jet model over four decades, from a 707 bristling with military radar in the late 1970s to today’s sleek 787 Dreamliner. \nThe date, Oct. 3, had been circled on Rothery’s calendar for more than a year. It was the last time that Boeing would bump up pension pay for Seattle-area factory workers before it froze the plan at month’s end, provisions dictated by a deeply unpopular 2014 contract extension. For Rothery, it was the final straw. \n“I’ll be 64 in November. After 37 years, that’s enough,” said Rothery, a tool-and-die maker. “I was working just to build a pension. As of Oct. 31, there’s no pension. Why stay?” \nThe benefit change could hasten a generational shift as Boeing’s baby boomers retire, a trend that’s also looming for other U.S. manufacturers. The planemaker’s most experienced workers are packing up their tools during critical upgrades of its two largest profit-drivers: the 737 and 777 jetliners. About 10,000 mechanics are eligible to retire from the company’s Puget Sound manufacturing base alone, and no one knows how many are poised to leave. \n“It’s a conversation that anyone who is close to retirement is having,” said Becky Beasley, 75, a grandmother and body-structures mechanic who helps rivet together hulking aluminum panels to form the 777’s hull. \nBoeing is well aware of the risks: Shortages of skilled workers from a smaller, mid-1990s exodus contributed to a factory meltdown that halted production of its cash cow, the 737. So earlier this year, the manufacturer carefully structured a voluntary layoff aimed at retirement-age workers, staggering the departures of 1,057 machinists to avoid massive disruptions. \n“We had that very much in mind,” said Joelle Denney, vice president for human resources at Boeing’s commercial airplane division, of the 1995 tumult. As the date approached when pension benefits would stop accruing, workers had been leaving in a steady stream. \n“We’re not expecting a big bubble or wave,” Denney said. \nWhile Donald Trump and Hillary Clinton argue over the impact of international trade on factory jobs, U.S. manufacturers are grappling with a looming shortage of skilled workers. Almost 3.5 million manufacturing positions will need to be filled over the next decade as baby boomers retire, and 2 million of those jobs could remain vacant because of manufacturing’s fading appeal to millennials, according to a 2015 study by Deloitte and the Manufacturing Institute. \nThe dilemma could be especially acute for Boeing, where about 35 percent of the 29,645 machinists in the company’s Seattle industrial hub are 55 or older. By contrast, only 23 percent of the 15.3 million Americans working in manufacturing are in that age group, according to the U.S. Bureau of Labor Statistics. \nFor the long haul, the planemaker is investing in education — from vocational training to programs at middle schools — to try to make manufacturing “cool” to a generation that has never known shop class, Denney said. In the short term, Boeing is stepping up training and mentoring programs within its factories, she said. \nSome question whether the company is doing enough. \n“I do think that if people decide to leave en masse, that they cannot replace that workforce,” said Jon Holden, president of the International Association of Machinists and Aerospace Workers, District 751. “There’s not enough in the pipeline to replace them.” \nMemories are still vivid of the cascading production issues two decades ago after Boeing offered a one-time retirement incentive with few restrictions. More than 3,700 mechanics, engineers and technical workers cashed out in June and July 1995 alone, creating immediate shortages in some positions. \nMany later were rehired as contractors as Boeing’s factories struggled to keep pace with a sales spurt. The shortfall contributed to production meltdowns in 1997 that forced the manufacturer to temporarily halt its 747 and 737 assembly lines to catch up. The cost to Boeing: a $1.6 billion pretax accounting loss. \nThis year, Boeing closely managed who participated in the voluntary layoff offer, methodically planning for their replacement and charting when they left the company, Denney said. The measure targeted employees and managers on the cusp of retirement by offering as many as 26 weeks of pay and accelerated retirement benefits. \nBoeing is trying to make its operations more efficient as it trims spending and automates more production amid cut-throat competition for slowing aircraft sales. The company has eliminated 4,853 jobs in the state of Washington since the end of January, a 6.2 percent reduction. \nBut while Boeing can control who leaves through the voluntary layoff, anyone can retire. That raises a risk of critical shortages of skilled tradesman with an intuitive feel for fabricating and assembling airplanes — among the most complicated machines on the planet. \n“The tricky aspect for the executives is not to lose too many skilled positions too quickly,” said Leon Grunberg, a sociologist and co-author of “Emerging from Turbulence: Boeing and the American Workplace Today.”“Can Boeing minimize the risk of losing the tribal knowledge?” \nThose leaving now will receive monthly pension payments of $95 for each year of employment. That amounts to about $34,200 annually for a 30-year Boeing veteran. While that covers basic necessities, retirees will also need savings to maintain their lifestyles, another factor that makes it difficult to predict near-term attrition. \nBeasley, the body-structures mechanic, doesn’t have a sufficiently large nest egg after 18 years at Boeing. She’s also putting a grandson through law school. \n“I’m a little concerned about my financial stability when I leave,” she said. “Social Security would barely cover the house payments.” \nRothery, the newly retired tool-and-die maker, is looking forward to golf, soccer and road trips in a motor home after wrapping up his career at Boeing’s Frederickson, Washington, plant. His future is secure: 401(k) plan accounts of $750,000 or more aren’t unusual for career workers who saved carefully, Rothery said. \nHe takes satisfaction from training his successor to step in seamlessly, but frets that his transition may be the exception. \n“It’s the vast amount of experience that’s leaving,” Rothery said. “They will work around it. They’ll still accomplish the task at hand. At what expense, it’s hard to say.” Most Read",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [
          {
            "name": "david ryder",
            "sentiment": "neutral"
          },
          {
            "name": "frederickson",
            "sentiment": "none"
          },
          {
            "name": "donald trump",
            "sentiment": "none"
          },
          {
            "name": "deloitte",
            "sentiment": "none"
          },
          {
            "name": "becky beasley",
            "sentiment": "none"
          },
          {
            "name": "beasley",
            "sentiment": "none"
          },
          {
            "name": "hillary clinton",
            "sentiment": "none"
          },
          {
            "name": "denney",
            "sentiment": "none"
          },
          {
            "name": "rothery",
            "sentiment": "none"
          },
          {
            "name": "jon holden",
            "sentiment": "none"
          },
          {
            "name": "julie johnsson",
            "sentiment": "none"
          },
          {
            "name": "bloomberg  john rothery",
            "sentiment": "none"
          },
          {
            "name": "joelle denney",
            "sentiment": "none"
          },
          {
            "name": "leon grunberg",
            "sentiment": "none"
          }
        ],
        "organizations": [
          {
            "name": "boeing",
            "sentiment": "positive"
          },
          {
            "name": "boeing co.",
            "sentiment": "positive"
          },
          {
            "name": "bloomberg",
            "sentiment": "neutral"
          },
          {
            "name": "international association of machinists and aerospace workers",
            "sentiment": "none"
          },
          {
            "name": "manufacturing institute",
            "sentiment": "none"
          },
          {
            "name": "social security",
            "sentiment": "none"
          },
          {
            "name": "american workplace today",
            "sentiment": "none"
          },
          {
            "name": "u.s. bureau of labor statistics",
            "sentiment": "none"
          }
        ],
        "locations": [
          {
            "name": "everett",
            "sentiment": "none"
          },
          {
            "name": "washington",
            "sentiment": "none"
          },
          {
            "name": "u.s.",
            "sentiment": "none"
          },
          {
            "name": "seattle",
            "sentiment": "none"
          }
        ]
      },
      "crawled": "2016-11-09T01:01:46.538+02:00"
    },
    {
      "thread": {
        "uuid": "c12b653bd2080b7226d2048961d8e0c8cac4aa07",
        "url": "http://omgili.com/ri/m1nCBNv_poxGr6isQa5LKrPE0zO0DI8.0f.4rZfOomtksUPLgK82Ta.yc7B6YyKd_zlnmb_KaaZiA0jo6P18OXOupXzlRxpJLAXghsXLkhZA2rd86l551w--",
        "site_full": "inhabitat.com",
        "site": "inhabitat.com",
        "site_section": "http://inhabitat.com",
        "site_categories": [
          "business"
        ],
        "section_title": "INHABITAT",
        "title": "Boeing and HRL win Guinness World Record for world's lightest metal",
        "title_full": "Boeing and HRL win Guinness World Record for world's lightest metal",
        "published": "2016-11-10T19:13:28.374+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "blogs",
        "country": "US",
        "spam_score": 0.0,
        "main_image": null,
        "performance_score": 3,
        "domain_rank": 7567,
        "social": {
          "facebook": {
            "likes": 395,
            "comments": 0,
            "shares": 395
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 2
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "c12b653bd2080b7226d2048961d8e0c8cac4aa07",
      "url": "http://omgili.com/ri/m1nCBNv_poxGr6isQa5LKrPE0zO0DI8.0f.4rZfOomtksUPLgK82Ta.yc7B6YyKd_zlnmb_KaaZiA0jo6P18OXOupXzlRxpJLAXghsXLkhZA2rd86l551w--",
      "ord_in_thread": 0,
      "author": "Cat DiStasio",
      "published": "2016-11-10T19:13:28.374+02:00",
      "title": "Boeing and HRL win Guinness World Record for world's lightest metal",
      "text": "\nBoeing and HRL Laboratories created a metal microlattice that has been awarded the Guinness World Record for the world's lightest metal . The entire structure of the microlattice is 99.99 percent air, making it 100 times lighter than styrofoam. Perhaps the most interesting thing about the new metal is not its light weight, but the fact that it was created to emulate human cell structure. It’s far from a bionic metal, but it illustrates that developing technology to mimic nature can help us achieve great things.\n\nhttps://www.youtube.com/watch?v=k6N_4jGJADY\nWhile the weight of a material is often associated with its strength, that isn’t always the case. For many applications, the use of a lighter material can lend a number of benefits in terms of durability and flexibility, all important considerations where all sorts of structures are concerned. Like human bones, which are porous, the microlattice is incredibly strong despite being mostly air. Its spindly structure is capable of absorbing and distributing force to reduce damage. The team placed the metal microlattice atop the delicate head of a dandelion (already gone to seed) to demonstrate its ultra light weight.\nRelated: Scientists develop world's lightest metal, 100x times lighter than styrofoam \nBoeing’s new metal microlattice is made from nickel phosphorus and is approximately 100 times lighter than styrofoam. While the aerospace company is certainly looking forward to potential applications in commercial airplane wings, the lightweight yet durable microlattice could have other uses in vehicle engines, military protective gear, and possible even in the medical world. Because of the way the microlattice’s structure mimics porous human cells, it could someday be used to develop an artificial lung.\nThe microlattice is the product of several years of research and development, and initially introduced in 2011 . The Guinness World Record was just awarded last year , after a long application and review process.\nVia ArchDaily \nImages via Boeing \n\n",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [],
        "organizations": [
          {
            "name": "guinness world record",
            "sentiment": "positive"
          },
          {
            "name": "hrl laboratories",
            "sentiment": "positive"
          },
          {
            "name": "hrl",
            "sentiment": "positive"
          },
          {
            "name": "boeing",
            "sentiment": "positive"
          }
        ],
        "locations": []
      },
      "crawled": "2016-11-10T19:13:28.374+02:00"
    },
    {
      "thread": {
        "uuid": "178b40140f45bcde0e50b4cabfeccef08dc6844c",
        "url": "http://omgili.com/ri/DyQaNGXlfMrGZO29B6Snrrs0_uleJhBHBhuA8QTJe.qy81Bz2K5Rg_6wtpzWSmfp4n7smUZ1t6k-",
        "site_full": "theawesomer.com",
        "site": "theawesomer.com",
        "site_section": "http://theawesomer.com",
        "site_categories": [
          "education",
          "business"
        ],
        "section_title": "The Awesomer",
        "title": "An Empty Boeing 787",
        "title_full": "An Empty Boeing 787",
        "published": "2016-11-15T02:30:50.713+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "blogs",
        "country": "US",
        "spam_score": 0.0,
        "main_image": null,
        "performance_score": 0,
        "domain_rank": 18442,
        "social": {
          "facebook": {
            "likes": 0,
            "comments": 0,
            "shares": 0
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "178b40140f45bcde0e50b4cabfeccef08dc6844c",
      "url": "http://omgili.com/ri/DyQaNGXlfMrGZO29B6Snrrs0_uleJhBHBhuA8QTJe.qy81Bz2K5Rg_6wtpzWSmfp4n7smUZ1t6k-",
      "ord_in_thread": 0,
      "author": "The Awesomer",
      "published": "2016-11-15T02:30:50.713+02:00",
      "title": "An Empty Boeing 787",
      "text": "\nLink \nIt’s rare that a single image is as satisfying as this one , showing off the interior of a Boeing 787 jumbo jet looks without any of the seats installed. We like to imagine spreading out some sleeping bags on the floor when we’re not skateboarding around the cabin.\n\nMore Awesome Stuff: Recreating Top Gun’s Photo Scene \nStarting a 737 \nNERF-firing R/C Plane \nHigh Velocity Aerial Filming \nPorta Estel·lar \n\n",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [],
        "organizations": [
          {
            "name": "boeing",
            "sentiment": "positive"
          }
        ],
        "locations": []
      },
      "crawled": "2016-11-15T02:30:50.713+02:00"
    },
    {
      "thread": {
        "uuid": "c31d5a33b201119efc0405585bdcd7a5aef2e3d9",
        "url": "http://omgili.com/ri/jHIAmI4hxg8tFV.2eEwFn4I_gXSAL.X_450jjsIJmx3p3liUApPzRdzS2rO3SjJ1741yCsFMGW0kCSfSt8kF_rW.CKTUBg9x",
        "site_full": "www.latimes.com",
        "site": "latimes.com",
        "site_section": "http://feeds.latimes.com/latimes/sports/motorracing/\r",
        "site_categories": [
          "news"
        ],
        "section_title": "L.A. Times - Auto Racing",
        "title": "Boeing will move 1,600 Huntington Beach jobs to Los Angeles County",
        "title_full": "Boeing will move 1,600 Huntington Beach jobs to Los Angeles County",
        "published": "2016-11-15T23:43:15.571+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "news",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "http://www.trbimg.com/img-582b8064/turbine/la-fi-boeing-jobs-20161115",
        "performance_score": 0,
        "domain_rank": 609,
        "social": {
          "facebook": {
            "likes": 49,
            "comments": 0,
            "shares": 49
          },
          "gplus": {
            "shares": 1
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 8
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "c31d5a33b201119efc0405585bdcd7a5aef2e3d9",
      "url": "http://omgili.com/ri/jHIAmI4hxg8tFV.2eEwFn4I_gXSAL.X_450jjsIJmx3p3liUApPzRdzS2rO3SjJ1741yCsFMGW0kCSfSt8kF_rW.CKTUBg9x",
      "ord_in_thread": 0,
      "author": "Samantha Masunaga",
      "published": "2016-11-15T23:43:15.571+02:00",
      "title": "Boeing will move 1,600 Huntington Beach jobs to Los Angeles County",
      "text": "Boeing will move 1,600 Huntington Beach jobs to Los Angeles County Boeing Co. Allen J. Schaben / Los Angeles Times A technician inspects a GPSIIF satellite being built at Boeing's El Segundo facility in 2010. A technician inspects a GPSIIF satellite being built at Boeing's El Segundo facility in 2010. (Allen J. Schaben / Los Angeles Times) Samantha Masunaga Caption 90 seconds: 4 stories you can't miss \nLAPD will not help deport immigrants under Trump , nearly 4,000 students from L.A. Unified schools left class to protest Trump , the L.A. Auto Show kicks off today , and the porn industry predicts a bounce-back in L.A. Caption 90 seconds: 4 stories you can't miss Caption Students stage walkout to protest President-elect Trump \nHundreds of Los Angeles-area students walked out of their classrooms Monday to protest President-elect Donald Trump . \nHundreds of Los Angeles-area students walked out of their classrooms Monday to protest President-elect Donald Trump . Caption Allyson Felix hopes to help Los Angeles stay in the running for 2024 Olympics \nAllyson Felix hopes to help Los Angeles stay in the running for 2024 Olympics \nAllyson Felix hopes to help Los Angeles stay in the running for 2024 Olympics Caption Raw Video: Students walkout of Roosevelt High School \nStudents from Roosevelt High School walked out of class to join other students in an anti-Trump protest. (Mark Boster / Los Angeles Times) \nStudents from Roosevelt High School walked out of class to join other students in an anti-Trump protest. (Mark Boster / Los Angeles Times) Caption Trump protesters march in downtown L.A. for a fourth night in a row \nTrump protesters march in downtown Los Angeles for a fourth night in a row. (Luis Sinco / Los Angeles Times) \nTrump protesters march in downtown Los Angeles for a fourth night in a row. (Luis Sinco / Los Angeles Times) \nFor more business news, follow me @smasunaga",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [
          {
            "name": "allen j. schaben",
            "sentiment": "neutral"
          },
          {
            "name": "samantha masunaga",
            "sentiment": "none"
          },
          {
            "name": "donald trump",
            "sentiment": "none"
          },
          {
            "name": "trump",
            "sentiment": "none"
          },
          {
            "name": "allyson felix",
            "sentiment": "none"
          },
          {
            "name": "mark boster",
            "sentiment": "none"
          },
          {
            "name": "luis sinco",
            "sentiment": "none"
          }
        ],
        "organizations": [
          {
            "name": "boeing",
            "sentiment": "positive"
          },
          {
            "name": "huntington beach",
            "sentiment": "positive"
          },
          {
            "name": "los angeles county boeing co",
            "sentiment": "positive"
          },
          {
            "name": "roosevelt high school",
            "sentiment": "none"
          },
          {
            "name": "lapd",
            "sentiment": "none"
          },
          {
            "name": "trump",
            "sentiment": "none"
          },
          {
            "name": "los angeles times)  trump",
            "sentiment": "none"
          },
          {
            "name": "roosevelt high school  students",
            "sentiment": "none"
          },
          {
            "name": "los angeles times",
            "sentiment": "none"
          },
          {
            "name": "los angeles times) caption trump",
            "sentiment": "none"
          },
          {
            "name": "trump  hundreds of los angeles-area",
            "sentiment": "none"
          },
          {
            "name": "l.a. auto show",
            "sentiment": "none"
          }
        ],
        "locations": [
          {
            "name": "los angeles county",
            "sentiment": "none"
          },
          {
            "name": "l.a.",
            "sentiment": "none"
          },
          {
            "name": "los angeles",
            "sentiment": "none"
          }
        ]
      },
      "crawled": "2016-11-15T23:43:15.571+02:00"
    },
    {
      "thread": {
        "uuid": "32bdcb02cd0d54c3ac95d0fda983db0c38473e12",
        "url": "http://omgili.com/ri/jHIAmI4hxg_qt1gNqLxTetFU_lbtFPMFhFc9u96bj4CYd7Yri75dCkjxj9eoWFktPCNAJNAibgg.jHjRFyKhouSs00hR4nl6yKq0Cr3CgpWqgHQgY3GJNg--",
        "site_full": "www.nextbigfuture.com",
        "site": "nextbigfuture.com",
        "site_section": "http://nextbigfuture.com/feeds/posts/default",
        "site_categories": [
          "entertainment",
          "blogs"
        ],
        "section_title": "Next Big Future",
        "title": "Boeing and Saab are making a fighter that beats the best Russian SU-35 and would be ten times cheaper to operate than the F-35",
        "title_full": "Boeing and Saab are making a fighter that beats the best Russian SU-35 and would be ten times cheaper to operate than the F-35",
        "published": "2016-11-16T22:12:28.596+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "news",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "https://1.bp.blogspot.com/-R6nPZT8ur3Q/WCy2iB3b_gI/AAAAAAABP2Y/E-bZxa4TiKgGtay02qk9rTMf8rYmauGNwCLcB/w1200-h630-p-nu/turnratefighter.png",
        "performance_score": 0,
        "domain_rank": 62402,
        "social": {
          "facebook": {
            "likes": 0,
            "comments": 0,
            "shares": 0
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "32bdcb02cd0d54c3ac95d0fda983db0c38473e12",
      "url": "http://omgili.com/ri/jHIAmI4hxg_qt1gNqLxTetFU_lbtFPMFhFc9u96bj4CYd7Yri75dCkjxj9eoWFktPCNAJNAibgg.jHjRFyKhouSs00hR4nl6yKq0Cr3CgpWqgHQgY3GJNg--",
      "ord_in_thread": 0,
      "author": "noreply@blogger.com (brian wang)",
      "published": "2016-11-16T22:12:28.596+02:00",
      "title": "Boeing and Saab are making a fighter that beats the best Russian SU-35 and would be ten times cheaper to operate than the F-35",
      "text": "Facebook twitter Google November 16, 2016 Boeing and Saab are making a fighter that beats the best Russian SU-35 and would be ten times cheaper to operate than the F-35 Twitter Simulation show the Swedish Gripen E fighter shooting down the best Russian Su-35 fighter at almost the same rate that the F-22 does. The Gripen E is estimated to be able to shoot down 1.6 Su-35s for every Gripen E lost, the F-22 is slightly better at 2.0 Su-35s shot down per F-22 lost. In turn the Su-35 is better than the F-35, shooting down 2.4 F-35s for each Su-35 shot down. The Su-35 slaughters the F-18 Super Hornet at the rate of eight to one, Turning, and carrying a gun, remains as important as it has ever been. Most missiles miss in combat and the fighter aircraft will go on to the merge. Assuming that pilot skill is equal, a 2° per second advantage in sustained turn rate will enable the more agile fighter to dominate the engagement. A high instantaneous turn rate is vital in being able to dodge the air-to-air missiles in the first place. The aircraft on the upper right quadrant of the graph will have a higher survival rate. The ones on the lower left quadrant will produce more widows. The Gripen E has a U.S.-made engine, the GE F414, which is also the engine of the F-18 Super Hornet. The Swedish Air Force is buying its Gripen Es for $43 million per copy, less than one third of the price of the F-35. Its operating cost per hour is less than a tenth of that of the F-35’s. It is designed to carry more weapons further, and to track multiple threats using the latest type of radar. Weapons include guided glide bombs, long-range air-to-air missiles and heavy anti-ship armaments. It also has a 27 mm Mauser BK27 gun, which can be used in air-to-surface attacks against land and sea targets. Like others in the range, the Gripen E has a delta wing and fly-by-wire flight avionics. But unlike some others in the line, it has a greater fuel capacity, 20 per cent more thrust, more pylons, in-flight refuelling capability and increased take-off weight. It has a 15.2 meter (50ft) long body has a wingspan of 8.6 metres (28ft) which allows it to manage a take-off weight of 16,500 kg (36.376lb). It can reach Mach 2 (1,522 mph, 2,450 km/h) at high altitude with a turnaround time between missions of just ten minutes. Combat radius: 800 km (497 mi, 432 nmi) Ferry range: 3,200 km (1,983 mi) with drop tanks The aircraft's sensors include an Active Electronically Scanned Array (AESA) radar, Infra-Red Search and Track (IRST), Electronic Warfare (EW) suite and data link technology. Read more: http://www.dailymail.co.uk/sciencetech/article-3605595/Saab-rolls-latest-generation-fighter-Gripen-E-travels-1-522-mph-improved-sensors-weaponry-range.html#ixzz4QCdi9MAB Follow us: @MailOnline on Twitter | DailyMail on Facebook The latest version of the Gripen fighter jet was unveiled in May 2016 by Swedish aircraft maker, Saab. Boeing is a partner in the aircraft. The Gripen E prototype 39-8 'Smart Fighter', the aircraft is aimed at markets not yet cleared to buy the troubled Lockheed Martin F-35 Joint Strike Fighter. The E fighter, the sixth variant in the Gripen family, is slightly bigger than previous versions, has a stronger engine and updated radar systems. Stealth is very expensive and Russia and China are shifting to radar that can detect stealth Shaping provides 90 percent of the stealth of the invisibility cloak of a stealth aircraft with the remaining 10 percent coming from the RAM coating. The operational doctrine of the F-22 is based on the F-22 flying around without its radar on and not making any other electronic emissions either. At the same time it is vacuuming up the electronic emissions of enemy aircraft, triangulating their position and then pouncing at a time of its choosing. The world has moved on from that. Stealth, as practiced by the F-22 and F-35, is optimized on radar in the X band from 7.0 to 11.2 gigahertz. Detection in other parts of the electromagnetic spectrum has improved a lot over the last twenty years. Chief of these is infrared search and track (IRST) which enables an F-35 to be detected from its engine exhaust from over 60 miles away. The latest iteration of the Su-27 Flanker family, the Su-35, has IRST and L band radar on its wings. L band and lower frequency radars can see stealthy aircraft over 100 miles away. So an Su-35 can see a F-35 well before the F-35 can detect it. Stealth, as an end in itself, has outlived its usefulness, and maintaining that RAM coating is killing the budget for no good reason. SOURCES - Daily Caller, Daily Mail UK, Saab, Wikipedia Author:",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [],
        "organizations": [
          {
            "name": "google",
            "sentiment": "positive"
          },
          {
            "name": "saab",
            "sentiment": "positive"
          },
          {
            "name": "boeing",
            "sentiment": "positive"
          },
          {
            "name": "ge",
            "sentiment": "none"
          },
          {
            "name": "daily mail uk",
            "sentiment": "none"
          },
          {
            "name": "ram",
            "sentiment": "none"
          },
          {
            "name": "air force",
            "sentiment": "none"
          },
          {
            "name": "lockheed martin",
            "sentiment": "none"
          },
          {
            "name": "wikipedia",
            "sentiment": "none"
          }
        ],
        "locations": [
          {
            "name": "russia",
            "sentiment": "none"
          },
          {
            "name": "china",
            "sentiment": "none"
          }
        ]
      },
      "crawled": "2016-11-16T22:12:28.596+02:00"
    },
    {
      "thread": {
        "uuid": "27f9e9c5289472602726b22e6af1c539b0ba2661",
        "url": "http://omgili.com/ri/SEMpReyPU44KlvwzRwyfGVbRMrrtIZeGDzvSc7qGEAZYg1hIT0bnLNaDPw0NeHDDzAnLjsQHGdCuWhDvn2ObmpP4RGGZiLD3",
        "site_full": "lifestyle.inquirer.net",
        "site": "inquirer.net",
        "site_section": "http://lifestyle.inquirer.net/feed",
        "site_categories": [],
        "section_title": "Inquirer lifestyle",
        "title": "PAL brings home a new Boeing 777",
        "title_full": "PAL brings home a new Boeing 777",
        "published": "2016-11-19T03:00:00.000+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "news",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "http://lifestyle.inquirer.net/files/2016/11/Philippine-Airlines.jpg",
        "performance_score": 0,
        "domain_rank": 813,
        "social": {
          "facebook": {
            "likes": 0,
            "comments": 0,
            "shares": 0
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "27f9e9c5289472602726b22e6af1c539b0ba2661",
      "url": "http://omgili.com/ri/SEMpReyPU44KlvwzRwyfGVbRMrrtIZeGDzvSc7qGEAZYg1hIT0bnLNaDPw0NeHDDzAnLjsQHGdCuWhDvn2ObmpP4RGGZiLD3",
      "ord_in_thread": 0,
      "author": "fkatigbak",
      "published": "2016-11-19T03:00:00.000+02:00",
      "title": "PAL brings home a new Boeing 777",
      "text": "PAL brings home a new Boeing 777 Business class amenities include lie-flat seats, slippers, ottoman, seat chat Philippine Daily Inquirer / 04:00   Last stages of assembly at Boeing factory in Everett, Washington. CONTRIBUTED PHOTOS \nEVERETT, WASHINGTON—The mood was celebratory when Philippine Airlines (PAL) executives, along with journalists, boarded the flag carrier’s brand-new Boeing 777 on its flight home to Manila on Oct. 28. \nAfter all, it’s not every day you get to witness the delivery of the world’s biggest twin-engine long-range plane—and actually board it on its maiden flight some 5,600 miles (9,012 kilometers) across the Pacific. \n“I hope we will have a very enjoyable experience flying on this plane,” said a beaming Jaime Bautista, PAL president and chief operating officer, who led some 40 PAL executives and media members as the plane’s very first passengers. ADVERTISEMENT \nWith its luxurious cabin amenities and state-of-the-art entertainment, the new 777 would hopefully elevate PAL into a five-star airline. \n“I’m sure our passengers will love this airplane because the 777 has proven to be the best aircraft for trans-Pacific operations,” Bautista said. On Nov. 2, it made its first commercial flight to Vancouver. \nPAL Senior Vice President Siegfred Mison noted the lucky 7’s—it will be PAL’s seventh 777, bringing its fleet to 79 on its 75th year. \n“We’re all excited to bring the new PAL family member home,” PAL spokesperson Cielo Villaluna said. \nShe assured us that the new plane was not flying for the first time; it went on a test flight around the Seattle area. A four-member flight crew led by Capt. James Conner had been in Seattle for weeks in preparation for the flight. Everett Delivery Center and operations VP for Boeing Jeff Klemann, PAL president-COO Jaime Bautista, president and chief commercial officer for Intrepid Aviation Doug Winter, and Boeing SVP for new airplane programs Gerry Aubrey Fr. Alex Pablo blesses the new Boeing 777 with PAL president-COO Jaime Bautista at the Boeing Everett Delivery Center in Washington. \nCalm hues \nCapt. Manuel Antonio Tamayo—who flew Pope Francis to Rome at the end of the Pontiff’s historic visit to Manila in January 2015—was also on board, this time to do his job as official of the Civil Aviation Authority of the Philippines. \nAs we were ushered into the plane, calm hues of beige and blue greeted us in the business class section. \nThe 370-seat twin aisle plane has 42 business class seats and 328 economy seats, in the same configuration as PAL’s six other 777s. This new plane, we were told, has bigger legroom and the latest Panasonic eX3 in-flight entertainment. \nAs we settled in our seats (and took tons of photos), our cabin crew, led by purser Angelo Chingcuangco, flight attendant Haydee Enriquez and flight steward Jericho Lee, began distributing welcome drinks and overnight kits. \nAnd yes, they have slippers on board, in addition to fluffier pillows with the PAL logo in gold monogram. \n“We have a seat chat,” Chingcuangco said as he demonstrated how to send messages to another passenger on the 18.5-inch touchscreen. \nBecause space and privacy are premium for business class, the main attraction here is the new 100-percent lie-flat seat, which converts into a full flat bed with a longer pitch of 78 inches. There are retractable dividers you can pull for more privacy. The PAL family’s new Boeing 777 flies its trans-Pacific routes. The Philippines’ coastal geography is the inspiration for the plane’s interiors. This new plane has bigger legroom and the latest Panasonic eX3 in-flight entertainment. \nInspiration \nAs if all that personal space is not enough, there’s even an ottoman, in attractive blue leather cover, at the foot of the seat. That’s more room for personal items you want handy. Or it can be a bed extension. \nThe Philippines’ coastal geography was the inspiration for the plane’s interiors, said Eulalia Paz, PAL aircraft cabin development manager. \nThe wall partitions, she said, were in light shades and wavy patterns reminiscent of the country’s sandy beaches. The blue carpet was adorned with banig (woven mat) pattern. \nPaz said top-of-the-line chameleon fabric was used for the seats, which gives the illusion of changing blue, green and orange colors. \n“For the business class, we wanted our passengers to feel the ambiance of exclusivity and premium,” said Ian San Gabriel, PAL corporate marketing manager. \nAnd yet, Paz said the economy section is not far behind in look and feel. The seats have a 34-inch pitch, longer by an inch than those in older planes, and can recline by six inches. PAL aircraft cabin development manager Eulalia Paz says the country’s coastal geography and sandy beaches were the inspiration for the plane’s interiors, with top-of-the-line fabric used for the business class seats. From your seat, you can chat with another passenger. The 11.1-inch monitors can be tilted for comfortable viewing. \nExtra touch \nAs in business class, economy seats have touch-screen seat-back monitors. The 11.1-inch monitors in economy can be tilted for more comfortable viewing. \nAn extra touch for economy is the coat hanger near the monitor, as well as the armrest you can pull up for easier row exit. \n“We want our passengers to enjoy the comfort, entertainment, hot meals and of course the warm hospitality of our cabin crew,” Paz said. “Everything revolves around the brand equity ‘the heart of the Filipino.’” Amenities include overnight kit and slippers. Privacy and comfort are guaranteed in the business class section that boasts 100-percent lie-flat seats. \nA few hours earlier, officials of Boeing and Intrepid Aviation, which leased the airplane to PAL, led the turnover and blessing at the Everett Delivery Center, part of Boeing’s sprawling 415-hectare plant in the US northwest, which churns out thousands of wide-body airplanes such as the 777. \nThe delivery was auspicious for both companies—PAL is celebrating its 75th anniversary and Boeing its 100th, and between them is a partnership as long as PAL’s existence. \nIn 1946, PAL used a DC 4 to fly 40 American servicemen to California (on a 48-hour flight!), making it the first Asian airline to fly across the Pacific. \nThe decades of goodwill were evident, as Boeing gave a red-carpet reception to PAL, and no amount of anti-US rhetoric from President Duterte is likely to make a dent on the partnership. \n“We’re committed to stick with you for the next 75 years,” Jeffrey Haber, Boeing regional director, said while raising his wine glass for a toast. \nChristian Hartshorn, sales director, said they never fail to get a “Wow!” whenever they delivered a 777. “Here’s your Triple Seven, and she’s beautiful,” Hartshorn said as he showed the new plane. \n“This is a fantastic airplane and we’re proud to deliver it to you today,” Brad Zaback, Boeing vice president said at the ceremony. \nBy fantastic, Zadack refers to the 777’s specs: the most preferred twin-aisle airplane of all time, outselling its Airbus competitor 4 to 1—with 1,891 ordered as of September this year, and 1,320 in use by 68 airlines. It can fly longer (up to 14,900 kms), carry more cargo (equivalent to 1,200 balikbayan boxes), is 2 percent more fuel-efficient, and powered by the world’s most powerful engine, a GE90-115B. \nAll that advanced Boeing engineering seemed to work perfectly as the plane quietly cruised for the 13-hour flight from Washington to Manila. \nSince it was not a commercial flight, meals and drinks were served on plastic ware. But who cares? This was a historic moment, and Bautista was soon celebrating the milestone with everyone on board, sipping wine as we savored riding home in a $250-million megaplane.",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [
          {
            "name": "bautista",
            "sentiment": "none"
          },
          {
            "name": "paz",
            "sentiment": "none"
          },
          {
            "name": "haydee enriquez",
            "sentiment": "none"
          },
          {
            "name": "manuel antonio tamayo",
            "sentiment": "none"
          },
          {
            "name": "jericho lee",
            "sentiment": "none"
          },
          {
            "name": "pope francis",
            "sentiment": "none"
          },
          {
            "name": "christian hartshorn",
            "sentiment": "none"
          },
          {
            "name": "chingcuangco",
            "sentiment": "none"
          },
          {
            "name": "siegfred mison",
            "sentiment": "none"
          },
          {
            "name": "angelo chingcuangco",
            "sentiment": "none"
          },
          {
            "name": "james conner",
            "sentiment": "none"
          },
          {
            "name": "hartshorn",
            "sentiment": "none"
          },
          {
            "name": "jeff klemann",
            "sentiment": "none"
          },
          {
            "name": "cielo villaluna",
            "sentiment": "none"
          },
          {
            "name": "gerry aubrey fr",
            "sentiment": "none"
          },
          {
            "name": "ian san gabriel",
            "sentiment": "none"
          },
          {
            "name": "jeffrey haber",
            "sentiment": "none"
          },
          {
            "name": "brad zaback",
            "sentiment": "none"
          },
          {
            "name": "zadack",
            "sentiment": "none"
          },
          {
            "name": "eulalia paz",
            "sentiment": "none"
          },
          {
            "name": "president-coo jaime bautista",
            "sentiment": "none"
          },
          {
            "name": "duterte",
            "sentiment": "none"
          },
          {
            "name": "jaime bautista",
            "sentiment": "none"
          },
          {
            "name": "alex pablo",
            "sentiment": "none"
          }
        ],
        "organizations": [
          {
            "name": "boeing",
            "sentiment": "positive"
          },
          {
            "name": "panasonic",
            "sentiment": "none"
          },
          {
            "name": "everett delivery center",
            "sentiment": "none"
          },
          {
            "name": "philippine daily inquirer",
            "sentiment": "none"
          },
          {
            "name": "philippine airlines",
            "sentiment": "none"
          },
          {
            "name": "boeing everett delivery center",
            "sentiment": "none"
          },
          {
            "name": "pal",
            "sentiment": "none"
          },
          {
            "name": "intrepid aviation",
            "sentiment": "none"
          },
          {
            "name": "intrepid aviation doug winter",
            "sentiment": "none"
          },
          {
            "name": "civil aviation authority",
            "sentiment": "none"
          },
          {
            "name": "airbus",
            "sentiment": "none"
          },
          {
            "name": "boeing svp",
            "sentiment": "none"
          }
        ],
        "locations": [
          {
            "name": "california",
            "sentiment": "none"
          },
          {
            "name": "everett delivery center",
            "sentiment": "none"
          },
          {
            "name": "philippines",
            "sentiment": "none"
          },
          {
            "name": "us",
            "sentiment": "none"
          },
          {
            "name": "washington",
            "sentiment": "none"
          },
          {
            "name": "seattle",
            "sentiment": "none"
          },
          {
            "name": "pacific",
            "sentiment": "none"
          },
          {
            "name": "washington",
            "sentiment": "none"
          },
          {
            "name": "everett",
            "sentiment": "none"
          },
          {
            "name": "rome",
            "sentiment": "none"
          },
          {
            "name": "vancouver",
            "sentiment": "none"
          },
          {
            "name": "manila",
            "sentiment": "none"
          }
        ]
      },
      "crawled": "2016-11-19T06:05:47.399+02:00"
    },
    {
      "thread": {
        "uuid": "5116cb06614b9e4c0d673fb2038640e6004c3288",
        "url": "http://omgili.com/ri/.wHSUbtEfZT6PMgB31z.ZaD2evE3nyl9mxbTWVprhBTZRktRdBVBHK9OT4NP82yJd.vniFp7CNO56WOKs7XzYH7iyrlMv7jXzaT73M88Cn5c78heHQ2uqIt0yTJdZBbyHcsueGNl4mE-",
        "site_full": "www.flightglobal.com",
        "site": "flightglobal.com",
        "site_section": "http://www.flightglobal.com/rss/aerospace-news-rss/",
        "site_categories": [
          "business"
        ],
        "section_title": "news",
        "title": "Boeing sees large narrowbodies appeal in Asia",
        "title_full": "Boeing sees large narrowbodies appeal in Asia",
        "published": "2016-11-21T12:32:58.974+02:00",
        "replies_count": 0,
        "participants_count": 0,
        "site_type": "news",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "",
        "performance_score": 0,
        "domain_rank": 42189,
        "social": {
          "facebook": {
            "likes": 0,
            "comments": 0,
            "shares": 0
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "5116cb06614b9e4c0d673fb2038640e6004c3288",
      "url": "http://omgili.com/ri/.wHSUbtEfZT6PMgB31z.ZaD2evE3nyl9mxbTWVprhBTZRktRdBVBHK9OT4NP82yJd.vniFp7CNO56WOKs7XzYH7iyrlMv7jXzaT73M88Cn5c78heHQ2uqIt0yTJdZBbyHcsueGNl4mE-",
      "ord_in_thread": 0,
      "author": "",
      "published": "2016-11-21T12:32:58.974+02:00",
      "title": "Boeing sees large narrowbodies appeal in Asia",
      "text": "Boeing sees large narrowbodies appeal in Asia Boeing sees large narrowbodies appeal in Asia 21 November, 2016 BY: Ellis Taylor Manila \nBoeing expects that larger variants of the 737, or even a new middle-of-the-market aircraft will have major appeal to operators in Asia-Pacific. \nSpeaking during a presentation at the Association of Asia Pacific Airlines’ annual Assembly of Presidents, senior vice-president of sales in Asia-Pacific and India Dinesh Keskar, said that carriers in the region, especially those in Oceania, “have a significant interest in the middle of the market airplane”. \nHe noted that low-cost carriers Lion Air and VietJet have already shown great interest in the 737-9, and are also expected to show similar interest in a future 757 replacement aircraft that would have a range of 4,500nm and capacity of around 250 seats. \n“When you have that kind of situation, you always start looking at the lowest seat-mile costs and obviously if you have more seats it will give you that, for anybody who wants anything bigger than the 737 Max,” Keskar added. \nFor now though, Boeing is continuing to study the market and has not yet made any decisions on what option it will chose to compete against Airbus’s A321neoLR, which the manufacturer has put forward as a natural replacement for the ageing 757. \nAt the same event, Keskar presented Boeing’s Current Market Outlook for southeast Asia and Oceania. \nThe airframer forecasts that Southeast Asia will need 3,860 new aircraft worth $565 billion over the next 20 years, of which 77% will be narrowbody aircraft. \n“This is because of the LCC domination and because of the number of hours that the flights are,” said Keskar. \nAs for the Oceania market, Boeing expects that it will need 1,020 new aircraft valued at $160 billion over the next 20 years. They will be comprised of 800 single-aisle jets, 130 small widebodies and 90 medium-sized widebodies. It also sees no demand for large widebodies in the region. \n“Clearly we think that the single-aisle airplane is going to be the major airplane in the market there, said Keskar. Related Content",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [
          {
            "name": "dinesh keskar",
            "sentiment": "none"
          },
          {
            "name": "keskar",
            "sentiment": "none"
          }
        ],
        "organizations": [
          {
            "name": "boeing",
            "sentiment": "positive"
          },
          {
            "name": "association of asia pacific airlines",
            "sentiment": "none"
          },
          {
            "name": "lion air",
            "sentiment": "none"
          },
          {
            "name": "airbus",
            "sentiment": "none"
          },
          {
            "name": "lcc",
            "sentiment": "none"
          },
          {
            "name": "ellis taylor manila  boeing",
            "sentiment": "none"
          }
        ],
        "locations": [
          {
            "name": "asia",
            "sentiment": "none"
          },
          {
            "name": "asia-pacific",
            "sentiment": "none"
          },
          {
            "name": "oceania",
            "sentiment": "none"
          },
          {
            "name": "southeast asia",
            "sentiment": "none"
          },
          {
            "name": "india",
            "sentiment": "none"
          }
        ]
      },
      "crawled": "2016-11-21T12:32:58.974+02:00"
    },
    {
      "thread": {
        "uuid": "75400b253b441bfc20130734d781a47d39d55625",
        "url": "http://omgili.com/ri/jHIAmI4hxg9drpy6c2vVhZqVcJvbTdS.o9TLUuJEKPAIEFEPlUghSCi.4b1mfPMkALuAmgES3gUJ59u2hYl4v3GrQlxvI3Fl",
        "site_full": "www.sltrib.com",
        "site": "sltrib.com",
        "site_section": "http://www.sltrib.com/rss/feed/",
        "site_categories": [
          "news"
        ],
        "section_title": "Latest Stories - The Salt Lake Tribune",
        "title": "Boeing taps GE veteran to lead its jet unit",
        "title_full": "Boeing taps GE veteran to lead its jet unit",
        "published": "2016-11-23T12:49:00.702+02:00",
        "replies_count": 0,
        "participants_count": 0,
        "site_type": "blogs",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "http://www.sltrib.com/csp/mediapool/sites/shared/assets/img/tribune1200x630.jpg",
        "performance_score": 0,
        "domain_rank": 8518,
        "social": {
          "facebook": {
            "likes": 0,
            "comments": 0,
            "shares": 0
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "75400b253b441bfc20130734d781a47d39d55625",
      "url": "http://omgili.com/ri/jHIAmI4hxg9drpy6c2vVhZqVcJvbTdS.o9TLUuJEKPAIEFEPlUghSCi.4b1mfPMkALuAmgES3gUJ59u2hYl4v3GrQlxvI3Fl",
      "ord_in_thread": 0,
      "author": "",
      "published": "2016-11-23T12:49:00.702+02:00",
      "title": "Boeing taps GE veteran to lead its jet unit",
      "text": "Boeing taps GE veteran to lead its jet unit By JULIE JOHNSSON Bloomberg News First Published Nov 22 2016 07:15PM • Updated 3 hours ago Share This Article Boeing is turning to an outsider for the first time to head the commercial airplanes division, replacing Ray Conner with Kevin McAllister, a 27-year veteran of General Electric's aviation business. McAllister, 53, former chief executive of GE Aviation Services, assumed the leadership of Boeing's largest business on Monday, according to a statement by the planemaker. Conner, 61, will stay on as vice chairman through 2017. The company also promoted Stan Deal to the role of president and CEO of Boeing Global Services, creating a third division that combines customer-service groups within the commercial airplane and defense units. Boeing CEO Dennis Muilenburg sees the potential to build a $50 billion business by bolstering service offerings, from providing spare parts to conducting round-the-clock maintenance. VIDEOS TOP JOBS \"We've always said that growing services was a key part of our strategy,\" Muilenburg told reporters during a conference call Monday. The latest leadership changes underscore that \"actions follow words,\" he said. Muilenburg, who took over last year, has made a series of management shifts that place the company's largest businesses under executives with backgrounds in services. The latest move reshapes the manufacturer's largest business with new leadership amid a turbulent market for commercial aircraft. The Chicago-based company announced Oct. 14 that Ihssane Mounir would replace the retiring John Wojick, a key Conner deputy, early next year as chief airplane salesman. With McAllister, Boeing gains an executive with deep ties to airlines worldwide, including some who are exclusively Airbus Group SE customers, and a reputation for using data to analyze airlines' wants and needs. He'd been viewed as a potential successor to David Joyce, who heads GE Aviation and is a vice chairman, said Rick Kennedy, a spokesman for GE. McAllister has been GE's \"face\" to all of its airline customers for 15 years, first leading the sales team and more recently as the head of the unit selling long-term service contracts and spare parts. The business is a major source of profit for GE, accumulating a backlog of services worth more than $120 billion, Kennedy said. McAllister is a \"very solid guy with a great background in aviation,\" said Richard Aboulafia, an aerospace analyst at Teal Group in Fairfax, Virginia. \"He's a big customer and part of their biggest industrial partner company, too. That's a unique combination.\" A materials engineer by training and University of Pittsburgh graduate, McAllister will be the first outsider to lead Boeing Commercial Airplanes since the unit was formed in 1965. The company selected McAllister after considering a mix of external and internal candidates to succeed Conner. McAllister has worked closely with Boeing over the years, Muilenburg said. \"I'm not sure I'd call him an outsider,\" the CEO said. \"He's been very, very close to us for a couple of decades.\" While McAllister masters the nuances of Boeing's culture and works to earn the respect of its factory workers and engineers, he also will face crucial product-strategy decisions. Perhaps the most critical is the call expected next year on Boeing's first all-new airplane since the 787 Dreamliner: a new plane family aimed at the market gap between Boeing's largest single-aisle and smallest twin-aisle jetliners. Through his role at GE, McAllister \"saw both the challenges and failures of the 787,\" Howard Rubel, an aerospace analyst at Jefferies, said by phone. \"So, he knows how hard it is to run an airplane company. He saw how hard it was to launch a new engine.\" McAllister also will be under pressure to bolster margins as the planemaker slows production of the 777, its second-largest source of profit. He may also have to navigate potential fall-out from the economic penalties President-elect Donald Trump has threatened to impose on China, Boeing's largest overseas market. Conner has served as corporate vice chairman since 2013, and president and CEO of commercial airplanes since 2012. A 39-year Boeing veteran, he led the division during an era of historic jetliner sales, then warned workers that tougher times and cost reductions lay ahead. During his watch, record output at Boeing's factories boosted the segment's revenue to $66 billion, up 34 percent from 2012. He is a throwback, known for close ties forged with customers as the planemaker's former sales chief. A native of Burien, Wash., a working-class suburb south of Seattle, Conner joined his father and brother at Boeing in 1977, landing a job as a mechanic building 727 jetliners. Conner will help smooth the transition to a new generation of leaders, Muilenburg said, while helping Deal knit together the government and commercial services businesses. Conner will also stay \"engaged in our product development activities, including the production transformation under way,\" Muilenburg said. Deal, 52, who was rumored to be an heir to Conner, had served as senior vice-president of Boeing's Commercial Aviation Services business since 2014. His new business will have about 20,000 employees and will maintain a headquarters staff of a \"couple dozen\" in Dallas. The lines between Deal's new unit and Boeing airplane and defense divisions will be blurry in places, with some customer-facing groups staying in place inside the current business units. Deal's current operation has more than 12,000 employees and provides airlines and leasing companies with wide ranging support services, from maintenance training to digital crew scheduling. Another 13,000 employees support military and government customers worldwide.",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [
          {
            "name": "julie johnsson",
            "sentiment": "positive"
          },
          {
            "name": "dennis muilenburg",
            "sentiment": "none"
          },
          {
            "name": "donald trump",
            "sentiment": "none"
          },
          {
            "name": "ihssane mounir",
            "sentiment": "none"
          },
          {
            "name": "conner",
            "sentiment": "none"
          },
          {
            "name": "richard aboulafia",
            "sentiment": "none"
          },
          {
            "name": "ray conner",
            "sentiment": "none"
          },
          {
            "name": "mcallister",
            "sentiment": "none"
          },
          {
            "name": "howard rubel",
            "sentiment": "none"
          },
          {
            "name": "rick kennedy",
            "sentiment": "none"
          },
          {
            "name": "john wojick",
            "sentiment": "none"
          },
          {
            "name": "kennedy",
            "sentiment": "none"
          },
          {
            "name": "kevin mcallister",
            "sentiment": "none"
          },
          {
            "name": "stan deal",
            "sentiment": "none"
          },
          {
            "name": "david joyce",
            "sentiment": "none"
          },
          {
            "name": "muilenburg",
            "sentiment": "none"
          }
        ],
        "organizations": [
          {
            "name": "boeing",
            "sentiment": "positive"
          },
          {
            "name": "ge",
            "sentiment": "positive"
          },
          {
            "name": "bloomberg news",
            "sentiment": "positive"
          },
          {
            "name": "teal group",
            "sentiment": "none"
          },
          {
            "name": "airbus group",
            "sentiment": "none"
          },
          {
            "name": "ge aviation services",
            "sentiment": "none"
          },
          {
            "name": "general electric",
            "sentiment": "none"
          },
          {
            "name": "boeing global services",
            "sentiment": "none"
          },
          {
            "name": "commercial aviation services",
            "sentiment": "none"
          },
          {
            "name": "university of pittsburgh",
            "sentiment": "none"
          },
          {
            "name": "ge aviation",
            "sentiment": "none"
          },
          {
            "name": "jefferies",
            "sentiment": "none"
          }
        ],
        "locations": [
          {
            "name": "burien",
            "sentiment": "none"
          },
          {
            "name": "fairfax",
            "sentiment": "none"
          },
          {
            "name": "seattle",
            "sentiment": "none"
          },
          {
            "name": "virginia",
            "sentiment": "none"
          },
          {
            "name": "wash.",
            "sentiment": "none"
          },
          {
            "name": "dallas",
            "sentiment": "none"
          },
          {
            "name": "china",
            "sentiment": "none"
          }
        ]
      },
      "crawled": "2016-11-23T12:49:00.702+02:00"
    },
    {
      "thread": {
        "uuid": "24c451d8e966fa7b307661b96c969f83b24db4cd",
        "url": "http://omgili.com/ri/jHIAmI4hxg8y5ia1l.boMj1MVMXIPC0kWs94YxFs6mxqJq3AZrIKij_Lc3Q6r5Jd.H4E733kpykq5shkGSuGZIMi1KLUR1w_ljWsZ_mVnvADCjLnfjErHFN5vTYsOeI.7k9kJg9XSKs-",
        "site_full": "www.seattletimes.com",
        "site": "seattletimes.com",
        "site_section": "http://seattletimes.nwsource.com/rss/mostreadarticles.xml",
        "site_categories": [
          "news"
        ],
        "section_title": "The Seattle Times The Seattle Times",
        "title": "Speaking of Business: ‘A bold move, uncharacteristic of Boeing’",
        "title_full": "Speaking of Business: ‘A bold move, uncharacteristic of Boeing’",
        "published": "2016-11-26T18:14:19.113+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "news",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "http://static.seattletimes.com/wp-content/uploads/2016/11/a6106966-b34c-11e6-878c-45bcccf32957-1560x1040.jpg",
        "performance_score": 0,
        "domain_rank": 3285,
        "social": {
          "facebook": {
            "likes": 0,
            "comments": 0,
            "shares": 0
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "24c451d8e966fa7b307661b96c969f83b24db4cd",
      "url": "http://omgili.com/ri/jHIAmI4hxg8y5ia1l.boMj1MVMXIPC0kWs94YxFs6mxqJq3AZrIKij_Lc3Q6r5Jd.H4E733kpykq5shkGSuGZIMi1KLUR1w_ljWsZ_mVnvADCjLnfjErHFN5vTYsOeI.7k9kJg9XSKs-",
      "ord_in_thread": 0,
      "author": "Seattle Times staff",
      "published": "2016-11-26T18:14:19.113+02:00",
      "title": "Speaking of Business: ‘A bold move, uncharacteristic of Boeing’",
      "text": "Speaking of Business: ‘A bold move, uncharacteristic of Boeing’ Originally published November 26, 2016 at 8:00 am Shoppers have their hands full as they try to grab the best deals at Best Buy on Black Friday in Dartmouth, Mass. (Peter Pereira/AP) The week’s business quotes address the new Boeing Commercial Airplanes CEO, holiday shopping and Apple’s lag in China. Share story",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [
          {
            "name": "peter pereira/ap",
            "sentiment": "none"
          }
        ],
        "organizations": [
          {
            "name": "boeing",
            "sentiment": "positive"
          },
          {
            "name": "apple",
            "sentiment": "none"
          },
          {
            "name": "best buy",
            "sentiment": "none"
          }
        ],
        "locations": [
          {
            "name": "mass.",
            "sentiment": "none"
          },
          {
            "name": "dartmouth",
            "sentiment": "none"
          },
          {
            "name": "china",
            "sentiment": "none"
          }
        ]
      },
      "crawled": "2016-11-26T18:14:19.113+02:00"
    },
    {
      "thread": {
        "uuid": "e5b2f6069b5f3c0880f8d3b2a2e81131d12ef569",
        "url": "http://omgili.com/ri/8HG_hanVOKyZWWt1fkZVQZpvM3ErML1jA8zHiY5Mc9oy5ylt1VvGf0lEfdnhLduSy51wmPS5jPk-",
        "site_full": "prsync.com",
        "site": "prsync.com",
        "site_section": "http://prsync.com/rss/",
        "site_categories": [
          "business"
        ],
        "section_title": "PR sync",
        "title": "Triple milestone",
        "title_full": "Triple milestone",
        "published": "2016-12-02T15:51:00.000+02:00",
        "replies_count": 0,
        "participants_count": 0,
        "site_type": "news",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "",
        "performance_score": 0,
        "domain_rank": 17518,
        "social": {
          "facebook": {
            "likes": 0,
            "comments": 0,
            "shares": 0
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "e5b2f6069b5f3c0880f8d3b2a2e81131d12ef569",
      "url": "http://omgili.com/ri/8HG_hanVOKyZWWt1fkZVQZpvM3ErML1jA8zHiY5Mc9oy5ylt1VvGf0lEfdnhLduSy51wmPS5jPk-",
      "ord_in_thread": 0,
      "author": "",
      "published": "2016-12-02T15:51:00.000+02:00",
      "title": "Triple milestone",
      "text": "Triple milestone Boeing - Friday, December 2, 2016. Our latest 787 delivery can claim three big milestones. It's the first for Air France, the 50th for AerCap, and the 500th Dreamliner to roll off our production lines. The 787-9 landed today in Paris and will be deployed on Air France's Paris to Cairo route starting in January. The Air France-KLM Group has ordered a total of 18 787-9s and seven 787-10s, with an additional 12 787-9s leased through AerCap. Congratulations to Air France, AerCap and to all our 787 employees on this triple milestone airplane. About Boeing \nBoeing is the world’s leading aerospace company and the largest manufacturer of commercial jetliners and military aircraft. Additionally, Boeing designs and manufactures rotorcraft, electronic and defense systems, missiles, satellites, launch vehicles and advanced information and communication systems. \nAs a major service provider to NASA, Boeing operates the Space Shuttle and International Space Station. The company also provides numerous military and commercial airline support services.",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [
          {
            "name": "aercap",
            "sentiment": "none"
          }
        ],
        "organizations": [
          {
            "name": "boeing",
            "sentiment": "positive"
          },
          {
            "name": "air france-klm group",
            "sentiment": "none"
          },
          {
            "name": "space shuttle",
            "sentiment": "none"
          },
          {
            "name": "nasa",
            "sentiment": "none"
          },
          {
            "name": "air france",
            "sentiment": "none"
          },
          {
            "name": "boeing  boeing",
            "sentiment": "none"
          },
          {
            "name": "500th dreamliner",
            "sentiment": "none"
          }
        ],
        "locations": [
          {
            "name": "cairo",
            "sentiment": "none"
          },
          {
            "name": "international space station",
            "sentiment": "none"
          },
          {
            "name": "air france",
            "sentiment": "none"
          },
          {
            "name": "paris",
            "sentiment": "none"
          }
        ]
      },
      "crawled": "2016-12-02T17:08:53.379+02:00"
    },
    {
      "thread": {
        "uuid": "db743f2f556b6b17e8dfb1daeff77b651a177e99",
        "url": "http://omgili.com/ri/snFTpiOKdJW2bzXjNEMbhXIYyO3CSOTk2NMWKfKB5oaRVFk7mQn.06OKCA4v..f1U3u1biY9hVGQGsHC7YnfcKIvDIpdGmxW_Q12jfSnYWotoSH0K87nMKzoKQfpEdIvhxuytxQgMK0-",
        "site_full": "news.iheart.com",
        "site": "iheart.com",
        "site_section": "",
        "site_categories": [
          "media"
        ],
        "section_title": "",
        "title": "Trump Takes Calculated Shot at Boeing | Rush Limbaugh | 590 KQNT",
        "title_full": "Trump Takes Calculated Shot at Boeing | Rush Limbaugh | 590 KQNT",
        "published": "2016-12-06T16:44:00.000+02:00",
        "replies_count": 0,
        "participants_count": 0,
        "site_type": "news",
        "country": "US",
        "spam_score": 0.555,
        "main_image": "http://i.iheart.com/v3/url/aHR0cDovL3d3dy5ydXNoaW1nLmNvbS9jaW1hZ2VzLy9tZWRpYS9pbWFnZXMyL3RydW1wLXRob3VnaHRzLWJvZWluZy1jbGludG9uLWNyaW1lLzE1NjcyMTYtMS1lbmctR0IvVHJ1bXAtVGhvdWdodHMtQm9laW5nLUNsaW50b24tQ3JpbWUuanBn?ops=",
        "performance_score": 0,
        "domain_rank": 1524,
        "social": {
          "facebook": {
            "likes": 0,
            "comments": 0,
            "shares": 0
          },
          "gplus": {
            "shares": 1
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "db743f2f556b6b17e8dfb1daeff77b651a177e99",
      "url": "http://omgili.com/ri/snFTpiOKdJW2bzXjNEMbhXIYyO3CSOTk2NMWKfKB5oaRVFk7mQn.06OKCA4v..f1U3u1biY9hVGQGsHC7YnfcKIvDIpdGmxW_Q12jfSnYWotoSH0K87nMKzoKQfpEdIvhxuytxQgMK0-",
      "ord_in_thread": 0,
      "author": "",
      "published": "2016-12-06T16:44:00.000+02:00",
      "title": "Trump Takes Calculated Shot at Boeing | Rush Limbaugh | 590 KQNT",
      "text": "Trump Takes Calculated Shot at Boeing 1 hour ago share \nRUSH:He knows exactly what he's doing and is doing it for a reason. He's doing this on purpose. There is an objective to this. The left just can't help themselves, though. They have to cast this guy... They have to portray him as somebody that's a walking mental midget, that literally has no idea what he's done here by winning the presidency, that has no idea how to talk, has no idea how to behave. They continue to make the mistake of plugging him into their model. They're plugging him into what they think an accomplished politician is, and he's not that, he's never been that, and he's not going to be that. Before Rush Limbaugh began broadcasting on network radio more than 25 years ago, political talk was often dry, hackneyed, and boring. Rush Limbaugh's lively, humorous, and just plain fun program has rocketed his show to the most listened-to long form program in the history of network radio. Contact ",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [
          {
            "name": "limbaugh",
            "sentiment": "none"
          }
        ],
        "organizations": [
          {
            "name": "boeing",
            "sentiment": "positive"
          },
          {
            "name": "trump",
            "sentiment": "positive"
          }
        ],
        "locations": []
      },
      "crawled": "2016-12-06T21:32:26.316+02:00"
    },
    {
      "thread": {
        "uuid": "538b7312529fbe1f090a67665364c21873a09968",
        "url": "http://omgili.com/ri/jHIAmI4hxg_ScoimW67Wq8bSaq4wH9Dr6UgPRjTaFS78w9WnjPcflBnVeMhJLw1fi3A8M.BladLgQs0mSc_EeSOggcDPuiQMIT.KICE96ic-",
        "site_full": "www.chicagotribune.com",
        "site": "chicagotribune.com",
        "site_section": "http://www.mcall.com/business/rss2.0.xml",
        "site_categories": [
          "news"
        ],
        "section_title": "LV Business Cycle - The Morning Call",
        "title": "Boeing sweats under Trump spotlight as SoftBank feels warmth",
        "title_full": "Boeing sweats under Trump spotlight as SoftBank feels warmth - The Morning Call",
        "published": "2016-12-07T17:33:00.000+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "news",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "http://www.trbimg.com/img-58482c78/turbine/ct-boeing-softbank-trump-20161207",
        "performance_score": 0,
        "domain_rank": 1272,
        "social": {
          "facebook": {
            "likes": 0,
            "comments": 0,
            "shares": 0
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "538b7312529fbe1f090a67665364c21873a09968",
      "url": "http://omgili.com/ri/jHIAmI4hxg_ScoimW67Wq8bSaq4wH9Dr6UgPRjTaFS78w9WnjPcflBnVeMhJLw1fi3A8M.BladLgQs0mSc_EeSOggcDPuiQMIT.KICE96ic-",
      "ord_in_thread": 0,
      "author": "mcall.com",
      "published": "2016-12-07T17:33:00.000+02:00",
      "title": "Boeing sweats under Trump spotlight as SoftBank feels warmth",
      "text": "First came Ford and Carrier. Now Boeing and SoftBank are experiencing the power of Donald Trump 's Twitter feed.\nThe president-elect jumped into corporate affairs again Tuesday, tweeting first to criticize one company and then to hail another. He began at 8:52 a.m. New York time by calling out Boeing Co. over costs to develop new Air Force One jets. Just over five hours later he celebrated a $50 billion investment in the U.S. by Japanese telecommunications firm SoftBank Group Corp.\nThe tweets, coming after Trump last week announced a deal with United Technologies Corp. to cancel plans to close a U.S. factory, dominated news and moved markets even as details in both cases remained sketchy and the impacts unclear. Trump again showed a willingness to use his bully pulpit to criticize or congratulate companies over actions affecting American workers and government spending.\n\"This is extraordinary,\" said Mohan Tatikonda, a professor at Indiana University 's Kelley School of Business. \"For a president to get involved at the level of spot locations, spot companies, spot plants, is I think unprecedented.\"\nThis is extraordinary. For a president to get involved at the level of spot locations, spot companies, spot plants, is I think unprecedented. — Mohan Tatikonda, a professor at Indiana University's Kelley School of Business. The president-elect's moves had consequences for the market, with Boeing falling as much as 1.5 percent before regular trading Tuesday. The shares rose less than 0.1 percent to $152.24 at the close in New York. SoftBank's American depositary receipts climbed 3 percent to $30.99.\nSprint Corp., which is controlled by SoftBank and is the No. 4 U.S. wireless carrier, rose 1.5 percent to $8.17 at the close. T-Mobile US Inc., which has long been mentioned as a possible merger partner for Sprint, rose 1.8 percent to $55.99 on speculation that SoftBank Chief Masayoshi Son's pledges could aid an eventual deal.\nA president who's too eager to pick winners and losers may prompt business owners to seek special treatment in Washington instead of focusing on improving operations, said Anne Krueger, an economics professor at Johns Hopkins University's School of Advanced International Studies.\n\"The rule of law is what prevents crony capitalism, and the minute you have the president-elect, politicians or bureaucrats meeting with business owners to dispense special favors it unlevels the playing field,\" said Krueger, a former first deputy director of the International Monetary Fund . \"We all ought to be screaming now because if we don't, we're going to be a third-world country before we know it.\"\nCarrier union leader says Trump's big deal is a lie Danielle Paquette The Secret Service agents told the Carrier workers to stay put, so Chuck Jones sat in the factory conference room for nearly three hours, waiting for president-elect Donald Trump . He'd grown used to this suspense.\nSeven months earlier, at a campaign rally in Indianapolis, Trump had pledged to save...\nThe Secret Service agents told the Carrier workers to stay put, so Chuck Jones sat in the factory conference room for nearly three hours, waiting for president-elect Donald Trump . He'd grown used to this suspense.\nSeven months earlier, at a campaign rally in Indianapolis, Trump had pledged to save...\n(Danielle Paquette) Trump's tweet about Air Force One -- \"Cancel order!\" he said -- came days after Boeing Chief Executive Officer Dennis Muilenburg called on him and Congress to ensure that U.S. companies have the tools to compete in a global economy. Trump said costs for the presidential aircraft program could exceed $4 billion.\nBoeing, the largest U.S. exporter, is currently working under a $170 million contract \"to help determine the capabilities of this complex military aircraft,\" spokesman Todd Blecher said in an e-mail.\nBoeing executives told officials on Trump's transition team that the cost of a new version of Air Force One could be lowered if the government agrees to reduce its technical requirements, Bloomberg News reported. On Wednesday, Trump said he spoke to Boeing and would work to reduce the program's costs.\nTrump's tough tweet goal: Rattle Boeing Robert Reed It didn't take too long for President-elect Donald Trump to send a strong message to Boeing CEO Dennis Muilenburg.\nAs reported in today's column , the Chicago-based aerospace and defense giant is waiting to see how the incoming Trump administration will affect its business. Such concern especially...\nIt didn't take too long for President-elect Donald Trump to send a strong message to Boeing CEO Dennis Muilenburg.\nAs reported in today's column , the Chicago-based aerospace and defense giant is waiting to see how the incoming Trump administration will affect its business. Such concern especially...\n(Robert Reed) \"We're going to get the prices down and if we don't get the prices down, we're not going to order them. We're going to stick with what we have,\" he said in a phone interview with NBC.\nThe Pentagon already is budgeting $3.2 billion for research and development, military construction and acquisition of two of the Air Force One planes through fiscal 2021, said Kevin Brancato, the lead government contracts analyst for Bloomberg Government. Boeing 747-8 planes average about $225 million each, he said, which means most of the expenses will go to outfitting the planes with special capabilities for presidential use. They include advanced communications and classified defensive abilities that make them flying fortresses.\nTrump's willingness to attack the program -- one of the most visible symbols of the American presidency -- and go after specific companies generates uncertainty over the scrutiny government contractors may face under the new administration, said Jeff Windau, an Edward Jones analyst.\n\"That's something that investors are at least taking notice of today,\" he said.\nIntervention of this magnitude has little precedent, but past president such as Lyndon Johnson and John F. Kennedy were known for such practices. Johnson, for instance, fought inflation and targeted high prices on products as varied as eggs, steel and televisions.\n'Cancel order!' Trump tweets Air Force One deal 'out of control'; Boeing says it'll deliver 'best value' W.J. Hennigan President-elect Donald Trump took aim at Air Force One on Tuesday, criticizing the cost of the iconic 747 jumbo jet that has served as the president's flying White House and projected America's might wherever it lands.\nThe aircraft used by President Obama, built by Chicago-based Boeing Co., have been...\nPresident-elect Donald Trump took aim at Air Force One on Tuesday, criticizing the cost of the iconic 747 jumbo jet that has served as the president's flying White House and projected America's might wherever it lands.\nThe aircraft used by President Obama, built by Chicago-based Boeing Co., have been...\n(W.J. Hennigan) Johnson's impact was limited. But he didn't have Twitter.\n\"Mr. Trump's leadership style and communication style is abetted by the social media capabilities we have today,\" Tatikonda said. \"With Mr. Trump we will continue to see different kinds of executive models and ways of leadership than we've ever seen before.\"\nFollowing a series of meetings Tuesday with business leaders, the president-elect tweeted that SoftBank will invest in the U.S. and create 50,000 new jobs. Son, CEO of the Tokyo-based telecommunications company, told reporters the funding would go to \"new companies, startup companies in the United States.\" The money will come from SoftBank's previously announced $100 billion technology fund, Bloomberg News reported.\nTrump followed up the tweet with a second saying the company \"would never do this had we (Trump) not won the election!\" On Sunday, Vice President-elect Mike Pence said on ABC's \"This Week\" that Trump would decide whether to intervene with specific companies \"on a day-by-day basis.\"\nWhile Trump has turned Twitter into a powerful tool, the companies in his sights may not do the same.\n\"I know the right answer is not going to be tweet back, so don't expect us to be doing that,\" David Melcher, president and chief executive officer of the Aerospace Industries Association trade group, said after Trump's Boeing statement. \"The president-elect is going to have to decide how he wants to use that tool.\"\nWith assistance from Mike Dorning Thomas Black Alan Levin and Ben Brody",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [
          {
            "name": "trump",
            "sentiment": "positive"
          },
          {
            "name": "donald trump",
            "sentiment": "positive"
          },
          {
            "name": "dennis muilenburg",
            "sentiment": "none"
          },
          {
            "name": "danielle paquette",
            "sentiment": "none"
          },
          {
            "name": "krueger",
            "sentiment": "none"
          },
          {
            "name": "ben brody",
            "sentiment": "none"
          },
          {
            "name": "edward jones",
            "sentiment": "none"
          },
          {
            "name": "w.j. hennigan",
            "sentiment": "none"
          },
          {
            "name": "kevin brancato",
            "sentiment": "none"
          },
          {
            "name": "chuck jones",
            "sentiment": "none"
          },
          {
            "name": "todd blecher",
            "sentiment": "none"
          },
          {
            "name": "tatikonda",
            "sentiment": "none"
          },
          {
            "name": "mike dorning thomas black alan levin",
            "sentiment": "none"
          },
          {
            "name": "john f. kennedy",
            "sentiment": "none"
          },
          {
            "name": "— mohan tatikonda",
            "sentiment": "none"
          },
          {
            "name": "lyndon johnson",
            "sentiment": "none"
          },
          {
            "name": "obama",
            "sentiment": "none"
          },
          {
            "name": "masayoshi son",
            "sentiment": "none"
          },
          {
            "name": "johnson",
            "sentiment": "none"
          },
          {
            "name": "david melcher",
            "sentiment": "none"
          },
          {
            "name": "mohan tatikonda",
            "sentiment": "none"
          },
          {
            "name": "anne krueger",
            "sentiment": "none"
          },
          {
            "name": "jeff windau",
            "sentiment": "none"
          },
          {
            "name": "mike pence",
            "sentiment": "none"
          },
          {
            "name": "robert reed",
            "sentiment": "none"
          }
        ],
        "organizations": [
          {
            "name": "softbank",
            "sentiment": "positive"
          },
          {
            "name": "boeing",
            "sentiment": "positive"
          },
          {
            "name": "ford",
            "sentiment": "positive"
          },
          {
            "name": "johns hopkins university's school of advanced international studies",
            "sentiment": "none"
          },
          {
            "name": "trump",
            "sentiment": "none"
          },
          {
            "name": "congress",
            "sentiment": "none"
          },
          {
            "name": "indiana university",
            "sentiment": "none"
          },
          {
            "name": "rattle boeing robert reed",
            "sentiment": "none"
          },
          {
            "name": "bloomberg news",
            "sentiment": "none"
          },
          {
            "name": "the aerospace industries association",
            "sentiment": "none"
          },
          {
            "name": "softbank group corp",
            "sentiment": "none"
          },
          {
            "name": "pentagon",
            "sentiment": "none"
          },
          {
            "name": "united technologies corp.",
            "sentiment": "none"
          },
          {
            "name": "abc",
            "sentiment": "none"
          },
          {
            "name": "sprint corp.",
            "sentiment": "none"
          },
          {
            "name": "t-mobile us inc.",
            "sentiment": "none"
          },
          {
            "name": "boeing co.",
            "sentiment": "none"
          },
          {
            "name": "nbc",
            "sentiment": "none"
          },
          {
            "name": "white house",
            "sentiment": "none"
          },
          {
            "name": "bloomberg government",
            "sentiment": "none"
          },
          {
            "name": "secret service",
            "sentiment": "none"
          },
          {
            "name": "international monetary fund",
            "sentiment": "none"
          },
          {
            "name": "sprint",
            "sentiment": "none"
          },
          {
            "name": "kelley school of business",
            "sentiment": "none"
          }
        ],
        "locations": [
          {
            "name": "united states",
            "sentiment": "none"
          },
          {
            "name": "america",
            "sentiment": "none"
          },
          {
            "name": "new york",
            "sentiment": "none"
          },
          {
            "name": "washington",
            "sentiment": "none"
          },
          {
            "name": "u.s.",
            "sentiment": "none"
          },
          {
            "name": "indianapolis",
            "sentiment": "none"
          }
        ]
      },
      "crawled": "2016-12-07T18:47:59.933+02:00"
    }
  ],
  "totalResults": 12,
  "moreResultsAvailable": 0,
  "next": "/search?token=c6052904-f312-436b-a6d8-d915084ac866&format=json&ts=1481129279933&q=language%3A%28english%29+thread.country%3AUS+organization.positive%3A%22boeing%22",
  "requestsLeft": 680
}