{
  "posts": [
    {
      "thread": {
        "uuid": "cf1776213a83459d7d01c7b2dabfa15382fb6f2b",
        "url": "http://omgili.com/ri/.wHSUbtEfZTQldr3JPG4.fS7exl_ihbzWv1diQJ9hUFcJNvJDMN88h5gTlvMaPqVBozLdU07X1c1SBIfsee0hV4DZ5HZlG.b",
        "site_full": "ricochet.com",
        "site": "ricochet.com",
        "site_section": "https://ricochet.com/main-feed/feed/",
        "site_categories": [
          "entertainment",
          "education"
        ],
        "section_title": "Ricochet",
        "title": "What temperature should the planet Be?",
        "title_full": "What temperature should the planet Be?",
        "published": "2016-12-01T09:01:53.478+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "blogs",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "https://7373-presscdn-0-43-pagely.netdna-ssl.com/wp-content/uploads/2016/07/Ricochet-Share.png",
        "performance_score": 0,
        "domain_rank": 57447,
        "social": {
          "facebook": {
            "likes": 0,
            "comments": 0,
            "shares": 0
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "cf1776213a83459d7d01c7b2dabfa15382fb6f2b",
      "url": "http://omgili.com/ri/.wHSUbtEfZTQldr3JPG4.fS7exl_ihbzWv1diQJ9hUFcJNvJDMN88h5gTlvMaPqVBozLdU07X1c1SBIfsee0hV4DZ5HZlG.b",
      "ord_in_thread": 0,
      "author": "Dr. Bastiat",
      "published": "2016-12-01T09:01:53.478+02:00",
      "title": "What temperature should the planet Be?",
      "text": "50 COMMENTS \nReading Richard Fulmer’s excellent post about Exxon being accused of holding illegal opinions on global warming reminded me of my response to my incredulous friends who just can’t believe that I DON’T BELIEVE IN SCIENCE. My skepticism of the global warming issue produces such a strong response that I have developed a simple, reasonable set of questions to pose to my friends, which express my uncertainty: What do you think the correct temperature of the world is? Should that temperature always be the same, or is some variation acceptable (or even healthy)? Who gets to pick that temperature? Mosquitoes? Polar bears? Camels? Plankton? What’s best for one may not be ideal for another. Note that right now, we believe that it is cooler than it has been for 90% of the time since the last Ice Age. So it is likely to be getting warmer over the next few hundred years, if everything evens out statistically. This, of course, is presuming that we are not entering another Ice Age now, or if something else happens – hard to say. Would it be better if it got warmer, or if it got cooler? Are you sure? Also note that we have only been collecting satellite data on planet temperatures for the past couple decades. Our satellite data continues to improve, we think – it was of dubious accuracy in the beginning of the space age. Before that, we looked at a bunch of thermometers of varying accuracy in various locations and averaged them together somehow. So we’re judging climate trends which occur over the course of hundreds of millions of years based on 10-20 years’ worth of “data” which we think might be close to accurate. Until we improve it next year. The difference between that and pure guessing is not much. Do you think it’s likely that our understanding of climate science 100 years from now will be the same as it is now? Are we sure about all this? Remember that just 20-30 years ago we were certain that the next Ice Age was imminent. Perhaps we were right then. Perhaps we’re right now. Perhaps there’s some other possibility we haven’t thought of yet. All we know is that our 5-10 year models that we’ve done over the past several decades have all been no better than pure guessing – usually wrong. In my job as a doctor, I would not make a decision on patient care based on such inconsistent data. That’s not called settled science. That’s called malpractice. The primary source of energy on this planet is the Sun. Previous variations in temperatures have been mostly linked to changes in solar output. Will the output of the sun increase in the next 10 years? 100 years? 1,000 years? Or will it decrease? Are you sure? Are there any major volcanic eruptions scheduled in the next couple hundred years? If so, what impact will that have on the weather? Are you sure? The most potent greenhouse gas is not CO2 – not even close. We believe that the most potent greenhouse gas is, by far, water vapor. What factors control the amount of water vapor in the atmosphere? We have no idea. So, suppose we figured out how to install a thermostat on the planet. And we could make it cooler if we decided it was too warm. Or warmer if we decided it was too cold. Should we do that? If so, who’s in charge of the thermostat? Are you sure? We’ve spent enormous amounts of time & energy “improving” our environment via importing Japanese Beetles, or moving snakes to change squirrel populations, or protecting forests by putting out small fires, etc – our record is dismal. There are always unforeseen variables. As it turns out, the complexity of our environment is close to infinite, like the arrogance of those who claim to understand it all. Should PEOPLE, who currently can’t figure out which bathroom to use, be in control of the entire planet? Are you sure? \nOnce my friends understand my concerns, they generally will at least cut me a little slack. And if I persist in looking at the problem logically, my friends will generally change the subject. Which is fine with me. Because when it comes to climate science (ie, understanding the whole world), I don’t know what I’m talking about. And neither do they. That is one thing I am absolutely sure of. Upvoted by R> Members Recommended 16 recommendations The post What temperature should the planet Be? was written by Ricochet member Dr. Bastiat and upvoted to the Main Feed by member recommendations. Any member can write posts on the Member Feed . If a post receives enough member recommendations it will be promoted to the Main Feed. Become a member to get your posts published on the home page as well. Members have made 50 comments.",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [
          {
            "name": "richard fulmer",
            "sentiment": "positive"
          },
          {
            "name": "ricochet",
            "sentiment": "none"
          },
          {
            "name": "bastiat",
            "sentiment": "none"
          }
        ],
        "organizations": [
          {
            "name": "exxon",
            "sentiment": "positive"
          }
        ],
        "locations": []
      },
      "crawled": "2016-12-01T09:01:53.478+02:00"
    }
  ],
  "totalResults": 1,
  "moreResultsAvailable": 0,
  "next": "/search?token=c6052904-f312-436b-a6d8-d915084ac866&format=json&ts=1480575713478&q=language%3A%28english%29+thread.country%3AUS+organization.positive%3A%22Exxon%22",
  "requestsLeft": 1041
}
