{
  "posts": [
    {
      "thread": {
        "uuid": "4a3ef14135ae9dc4701b04119e5072245ea2806a",
        "url": "http://omgili.com/ri/0xd.sZhj5je1vLRWuceEFw3YjSnooRhm4sbpASBVqJYHAYigIv40ggO0FXKBES52jrOd8JIq0GC9MQYM.j_apg--",
        "site_full": "ca.reuters.com",
        "site": "reuters.com",
        "site_section": "",
        "site_categories": [
          "news"
        ],
        "section_title": "",
        "title": "Exclusive: McDonald's to keep up to 25 percent stake in China, HK stores - source | Business | Reuters",
        "title_full": "Exclusive: McDonald's to keep up to 25 percent stake in China, HK stores - source | Business | Reuters",
        "published": "2016-12-06T17:17:00.000+02:00",
        "replies_count": 0,
        "participants_count": 0,
        "site_type": "news",
        "country": "US",
        "spam_score": 0.028,
        "main_image": "",
        "performance_score": 0,
        "domain_rank": 408,
        "social": {
          "facebook": {
            "likes": 0,
            "comments": 0,
            "shares": 0
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "4a3ef14135ae9dc4701b04119e5072245ea2806a",
      "url": "http://omgili.com/ri/0xd.sZhj5je1vLRWuceEFw3YjSnooRhm4sbpASBVqJYHAYigIv40ggO0FXKBES52jrOd8JIq0GC9MQYM.j_apg--",
      "ord_in_thread": 0,
      "author": "",
      "published": "2016-12-06T17:17:00.000+02:00",
      "title": "Exclusive: McDonald's to keep up to 25 percent stake in China, HK stores - source | Business | Reuters",
      "text": "[ - ] Text [ + ] \nBy Elzio Barreto \nHONG KONG (Reuters) - McDonald's Corp MCD.N is looking to raise $1 billion to $2 billion with the sale of its China and Hong Kong stores after the U.S. fast-food chain decided to keep \"a significant minority stake in the business,\" a person with direct knowledge of the plans said on Tuesday. \nThe company has picked a consortium led by private-equity firm Carlyle Group LP CG.O and Chinese conglomerate CITIC Group Corp [CITIC.UL] to buy the stores and its decision to retain a stake of up to 25 percent lowered the price tag for the business from up to $3 billion expected previously, said the person, who declined to be identified because details of the deal are not public. \nMcDonald's wants exposure to future growth in the world's second-largest economy which is why it decided to maintain the stake, the person said. The company will also keep for now its stores in South Korea, which it previously also wanted to sell, the person added. \nA McDonald's spokeswoman in Shanghai declined to comment. Carlyle declined to comment and CITIC did not immediately respond to a Reuters request for comment. \nMcDonald's in March said it was reorganizing operations in the region, looking for strategic partners in China, Hong Kong and South Korea as it switches to a less capital-intensive franchise model. \nMcDonald's owns most of its more than 2,800 restaurants in the three markets. It is offering a 20-year franchise to buyers with a 10-year extension option. \nThe Chinese and Hong Kong stores attracted bids from a variety of parties, including TPG Capital Management LP [TPG.UL] - which teamed up with mini-market operator Wumart Stores Inc - and real estate firm Sanpower Group Co Ltd [SPGCL.UL], which owns British department store House of Fraser Ltd [HFPLC.UL], Reuters previously reported. \nThe sale comes at time when fast-food operators including McDonald's and Yum Brands Inc YUM.N are recovering from a series of food-supply scandals in China that have undermined their performance. Continued... ",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [
          {
            "name": "elzio barreto",
            "sentiment": "negative"
          },
          {
            "name": "carlyle",
            "sentiment": "none"
          }
        ],
        "organizations": [
          {
            "name": "reuters",
            "sentiment": "negative"
          },
          {
            "name": "mcdonald",
            "sentiment": "negative"
          },
          {
            "name": "mcdonald's corp",
            "sentiment": "neutral"
          },
          {
            "name": "carlyle group lp cg.o",
            "sentiment": "none"
          },
          {
            "name": "yum brands inc",
            "sentiment": "none"
          },
          {
            "name": "tpg capital management lp",
            "sentiment": "none"
          },
          {
            "name": "citic group corp",
            "sentiment": "none"
          },
          {
            "name": "wumart stores inc",
            "sentiment": "none"
          },
          {
            "name": "citic",
            "sentiment": "none"
          },
          {
            "name": "house of fraser ltd",
            "sentiment": "none"
          },
          {
            "name": "sanpower group co ltd",
            "sentiment": "none"
          }
        ],
        "locations": [
          {
            "name": "hk",
            "sentiment": "none"
          },
          {
            "name": "hong kong",
            "sentiment": "none"
          },
          {
            "name": "china",
            "sentiment": "none"
          },
          {
            "name": "hong kong",
            "sentiment": "none"
          },
          {
            "name": "u.s.",
            "sentiment": "none"
          },
          {
            "name": "shanghai",
            "sentiment": "none"
          },
          {
            "name": "south korea",
            "sentiment": "none"
          }
        ]
      },
      "crawled": "2016-12-07T20:56:34.656+02:00"
    },
    {
      "thread": {
        "uuid": "e169cb7b1e1834357d860cba94cc26083a592e62",
        "url": "http://omgili.com/ri/.wHSUbtEfZTetKdOEAflMwwFRwZedCI1EIJqVTy3Ol5.GrXgtEcpHVlx1MmWgvKiWdQxYD08c4EafM4hD4tzabfkwBLMONhDbB9IqgHE8DANCxKT70fa7pBWCFt5FpRNbjSsiZrkHAj16eK0Gbx287XFJUsSgYRsxeXTlWzAdiMdCKqRzlAvT.fUFgkPrAXksPqwLGZCUYbksMfirLwW5g--",
        "site_full": "www.zacks.com",
        "site": "zacks.com",
        "site_section": "http://feed.zacks.com/commentary/AllStories/rss",
        "site_categories": [
          "finance"
        ],
        "section_title": "Zacks Investment Research - All Commentary Articles",
        "title": "The Zacks Analyst Blog Highlights: Booz Allen Hamilton Holding, McDonald's, Regions Financial and Regeneron Pharmaceuticals",
        "title_full": "The Zacks Analyst Blog Highlights: Booz Allen Hamilton Holding, McDonald's, Regions Financial and Regeneron Pharmaceuticals",
        "published": "2016-12-07T21:02:29.805+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "blogs",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "https://staticx-tuner.zacks.com/images/articles/main/bigstock-stock-numbers.jpg",
        "performance_score": 0,
        "domain_rank": 8414,
        "social": {
          "facebook": {
            "likes": 0,
            "comments": 0,
            "shares": 0
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "e169cb7b1e1834357d860cba94cc26083a592e62",
      "url": "http://omgili.com/ri/.wHSUbtEfZTetKdOEAflMwwFRwZedCI1EIJqVTy3Ol5.GrXgtEcpHVlx1MmWgvKiWdQxYD08c4EafM4hD4tzabfkwBLMONhDbB9IqgHE8DANCxKT70fa7pBWCFt5FpRNbjSsiZrkHAj16eK0Gbx287XFJUsSgYRsxeXTlWzAdiMdCKqRzlAvT.fUFgkPrAXksPqwLGZCUYbksMfirLwW5g--",
      "ord_in_thread": 0,
      "author": "Zacks Equity Research",
      "published": "2016-12-07T21:02:29.805+02:00",
      "title": "The Zacks Analyst Blog Highlights: Booz Allen Hamilton Holding, McDonald's, Regions Financial and Regeneron Pharmaceuticals",
      "text": "Trades from $ 3 For Immediate Release Chicago, IL – December 07, 2016 – Zacks.com announces the list of stocks featured in the Analyst Blog. Every day the Zacks Equity Research analysts discuss the latest news and events impacting stocks and the financial markets. Stocks recently featured in the blog include Booz Allen Hamilton Holding Corporation (NYSE:( BAH - Free Report ) – Free Report ), McDonald's Corporation (NYSE:( MCD - Free Report ) – Free Report ), Regions Financial Corporation (NYSE:( RF - Free Report ) – Free Report ) and Regeneron Pharmaceuticals, Inc. (NASDAQ:( REGN - Free Report ) – Free Report ). Today, Zacks is promoting its ''Buy'' stock recommendations. Get #1Stock of the Day pick for free . Here are highlights from Tuesday’s Analyst Blog: Play the Trump Factor with These 4 Large-Caps 2016 was a year full of surprises and uncertainty with the markets facing volatility in the face of economic and political pressure. However, the volatility that was experienced in the run-up to the elections has subsided somewhat. As we know, key indices reacted favorably to the surprise win of Donald Trump with some sectors in particular clocking major gains. Although the market is relatively stable now, a certain element of uncertainty still remains regarding the extent to which President-elect Trump will be able to implement the promises made by him during elections. Moreover, analysts and market watchers expect a Fed rate hike next week while the commencement of the Brexit process, scheduled to start by Mar 2017, will keep the markets volatile. In such a scenario, it makes sense to diversify your portfolio by investing in some blue-chip stocks -- these large-cap stocks (market cap of more than $5 billion) are companies that have a proven track record and represent a certain level of financial strength, resilience and stability. With the help of the Zacks Stock Screener , we have zeroed in on 4 large-cap stocks – these companies have a favorable Zacks Rank - #1 (Strong Buy) or #2 (Buy), have witnessed positive estimate revisions (over the last 4 weeks) and have encouraging growth prospects. Moreover, these stocks have a good VGM style score , a useful tool that allows investors to gain an insight into a stock’s strengths and weaknesses. While “V” stands for Value, “G” stands for Growth and “M” for Momentum -- the score is a weighted combination of these three metrics. Our research shows that stocks with VGM Scores of ‘A’ or ‘B’ when combined with a Zacks Rank #1 or 2 make solid investment choices. You can see the complete list of today’s Zacks #1 Rank stocks here . While selecting these stocks, we have also focused on sectors that stand to benefit under a Trump presidency assuming he is able to deliver on his promises. Play It Safe with These Large-Cap Stocks Booz Allen Hamilton Holding Corporation (NYSE:( BAH - Free Report ) – Free Report ) : McLean, VA-based Booz Allen Hamilton Holding Corporation provides management and technology, consulting, and engineering services to the U.S. and international governments, major corporations, and not-for-profit organizations. The company’s second quarter fiscal 2017 results were better-than-expected with both earnings and revenues surpassing expectations. Following the release of second quarter fiscal 2017 results, BAH raised the lower end of its previously issued guidance range and now expects revenues to grow in the range of 3-5% and earnings in the range of $1.68 to $1.75 per share. The company had previously guided towards revenue growth of 2-5% and earnings per share of $1.65 to $1.75. The Zacks Rank #2 stock has a VGM score of A and has been witnessing upward revisions in earnings estimates over the last 30 days for both fiscal 2017 and 2018. Government services firms like BAH are expected to benefit from the Trump administration in the long run once favorable policies are in place including potential tax cuts and increased government spending. A look at BAH’s performance shows that the company has outperformed the Zacks-categorized Government Services industry with the company gaining 21.6% versus the industry gain of 13.6%. Shares have been on an upswing ever since election results were announced. McDonald's Corporation (NYSE:( MCD - Free Report ) – Free Report ) : While the selection of a restaurant stock may come as a bit of a surprise considering the challenges being faced by this sector (rising labor costs, increasing employee turnover, declining traffic and higher non-discretionary spending to name a few), Trump’s proposed plan to lower and simplify individual taxes could provide this sector with a much needed boost. Lower taxes mean more money to spend on dining out and other luxury items. McDonald's, the world's leading global foodservice retailer with more than 36,000 locations in 100+ countries, holds a Zacks Rank #2 and a VGM score of B. Despite soft industry conditions, the company has consistently surpassed earnings expectations so far in 2016 and has also been witnessing positive estimate revisions over the last 30 days. The company has been working on making changes to its business through its global refranchising efforts slated to complete by the end of 2018. McDonald’s has also been pretty active in rewarding shareholders through dividends and share buybacks. Last year, the company had increased its three-year cash return to shareholders target to $30 billion by the end of 2016 and is on track to achieve the same. While McDonald’s does face some near-term headwinds, longer-term an improved consumer spending scenario will bode well for the stock. Where price performance is concerned, MCD has performed better than the Zacks categorized Retail-Food & Restaurants industry which declined 0.1% year-to-date (YTD) while McDonald’s has gained 1%. Regions Financial Corporation (NYSE:( RF - Free Report ) – Free Report ) : Bank stocks were among the biggest gainers following the election results on expectations of a softer regulatory environment as well as higher interest rates and inflation following the implementation of Trump’s policies. Regions Financial’s shares are up 28.7% ever since election results were announced – the stock is up 46.1% YTD having outperformed the Zacks categorized Banks-Southeast industry which is up 32.7% YTD. RF, a Zacks Rank #2 stock with a VGM score of B, has surpassed earnings expectations in three of the last four quarters and is expected to record earnings growth of 13.8% in 2016. Regions Financial is one of the nation's largest full-service providers of consumer and commercial banking, wealth management, mortgage, and insurance products and services across the South, Midwest and Texas. Regeneron Pharmaceuticals, Inc. (NASDAQ:( REGN - Free Report ) – Free Report ) : Biotechs were also among the biggest gainers on Trump’s victory with the market expecting reduced focus on the sector’s pricing policies. Not just that, President-elect Trump’s pro-business stand is also expected to benefit the sector. Major biotech and pharma companies should gain from Trump’s proposed tax plan and proposal to repatriate corporate profits held offshore at a one-time tax rate of 10%. With focus on drug pricing expected to subside and given the possibility of repatriation of funds, hopes are up that mergers and acquisitions will pick up. Regeneron shot up 13.8% following the election results – the Zacks Rank #2 stock, which has a VGM score of B, has been witnessing positive estimate revisions for 2016 as well as 2017. The company’s flagship product, eye treatment Eylea, continues to be the key financial driver. Although Regeneron has underperfomed the Zacks categorized Medical-Biomedical Genetics industry, that could very well change as the company has quite a few catalysts in store which could boost the stock significantly. Major catalysts for the stock would be FDA approval of Dupixent, currently under priority review for atopic dermatitis with a response expected on Mar 29, 2017. Dupixent is being investigated for other indications as well including asthma, nasal polyps, and eosinophilic esophagitis. Another major catalyst would be positive cardiovascular outcomes data on PCSK9 inhibitor Praluent as this would help boost sales significantly. Regeneron is also looking to grow its ophthalmology segment and is evaluating Eylea in combination with other treatments. Confidential: Zacks' Best Investment Ideas Would you like to see a hand-picked \"all-star\" selection of investment ideas from the man who heads up Zacks' trading and investing services? Steve Reitmeister knows when key trades are about to be triggered and which of our experts has the hottest hand. Click for his selected trades right now >> Today, Zacks is promoting its ''Buy'' stock recommendations. Get #1 Stock of the Day pick for free . About Zacks Equity Research Zacks Equity Research provides the best of quantitative and qualitative analysis to help investors know what stocks to buy and which to sell for the long-term. Continuous coverage is provided for a universe of 1,150 publicly traded stocks. Our analysts are organized by industry which gives them keen insights to developments that affect company profits and stock performance. Recommendations and target prices are six-month time horizons. Strong Stocks that Should Be in the News Many are little publicized and fly under the Wall Street radar. They're virtually unknown to the general public. Yet today's 220 Zacks Rank #1 \"Strong Buys\" were generated by the stock-picking system that has nearly tripled the market from 1988 through 2015. Its average gain has been a stellar +26% per year. See these high-potential stocks free >>.",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [
          {
            "name": "booz allen hamilton holding",
            "sentiment": "negative"
          },
          {
            "name": "trump",
            "sentiment": "none"
          },
          {
            "name": "donald trump",
            "sentiment": "none"
          },
          {
            "name": "mclean",
            "sentiment": "none"
          },
          {
            "name": "steve reitmeister",
            "sentiment": "none"
          }
        ],
        "organizations": [
          {
            "name": "regeneron pharmaceuticals trades",
            "sentiment": "negative"
          },
          {
            "name": "mcdonald",
            "sentiment": "negative"
          },
          {
            "name": "regions financial",
            "sentiment": "negative"
          },
          {
            "name": "mcdonald's corporation",
            "sentiment": "none"
          },
          {
            "name": "regeneron pharmaceuticals, inc.",
            "sentiment": "none"
          },
          {
            "name": "zacks rank #",
            "sentiment": "none"
          },
          {
            "name": "booz allen hamilton holding corporation",
            "sentiment": "none"
          },
          {
            "name": "fed",
            "sentiment": "none"
          },
          {
            "name": "trump",
            "sentiment": "none"
          },
          {
            "name": "bank",
            "sentiment": "none"
          },
          {
            "name": "trump factor",
            "sentiment": "none"
          },
          {
            "name": "retail-food & restaurants",
            "sentiment": "none"
          },
          {
            "name": "government services",
            "sentiment": "none"
          },
          {
            "name": "regions financial corporation",
            "sentiment": "none"
          },
          {
            "name": "zacks",
            "sentiment": "none"
          },
          {
            "name": "zacks equity research",
            "sentiment": "none"
          },
          {
            "name": "these large-cap stocks booz allen hamilton holding corporation",
            "sentiment": "none"
          },
          {
            "name": "zacks rank",
            "sentiment": "none"
          },
          {
            "name": "fda",
            "sentiment": "none"
          },
          {
            "name": "mcd",
            "sentiment": "none"
          },
          {
            "name": "regeneron",
            "sentiment": "none"
          },
          {
            "name": "nyse",
            "sentiment": "none"
          },
          {
            "name": "zacks equity research zacks equity research",
            "sentiment": "none"
          }
        ],
        "locations": [
          {
            "name": "il",
            "sentiment": "none"
          },
          {
            "name": "chicago",
            "sentiment": "none"
          },
          {
            "name": "dupixent",
            "sentiment": "none"
          },
          {
            "name": "eylea",
            "sentiment": "none"
          },
          {
            "name": "u.s.",
            "sentiment": "none"
          },
          {
            "name": "texas",
            "sentiment": "none"
          },
          {
            "name": "south",
            "sentiment": "none"
          },
          {
            "name": "midwest",
            "sentiment": "none"
          }
        ]
      },
      "crawled": "2016-12-07T21:02:29.805+02:00"
    },
    {
      "thread": {
        "uuid": "9baae8c91c7db3e1174d3d88700e826b405e9d07",
        "url": "http://omgili.com/ri/jHIAmI4hxg_IEwR.uq8N9voedY84XGpTA.FcuJVrHkOovHuGSvp22MIBiw19QAZ9SY365zQG0f17_avNKNLBOilkQwV_L2LUugyh3loEbP0-",
        "site_full": "www.blackenterprise.com",
        "site": "blackenterprise.com",
        "site_section": "http://www.blackenterprise.com/feed/",
        "site_categories": [
          "news"
        ],
        "section_title": "Black Enterprise",
        "title": "2016 Best Companies for Diversity: McDonald’s Corporation",
        "title_full": "2016 Best Companies for Diversity: McDonald’s Corporation",
        "published": "2016-12-07T21:36:35.703+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "blogs",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "http://www.blackenterprise.com/wp-content/blogs.dir/1/files/2016/11/MCDONALDS-LOGO-e1480444772389.jpg",
        "performance_score": 0,
        "domain_rank": 60269,
        "social": {
          "facebook": {
            "likes": 0,
            "comments": 0,
            "shares": 0
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "9baae8c91c7db3e1174d3d88700e826b405e9d07",
      "url": "http://omgili.com/ri/jHIAmI4hxg_IEwR.uq8N9voedY84XGpTA.FcuJVrHkOovHuGSvp22MIBiw19QAZ9SY365zQG0f17_avNKNLBOilkQwV_L2LUugyh3loEbP0-",
      "ord_in_thread": 0,
      "author": "Lisa Fraser",
      "published": "2016-12-07T21:36:35.703+02:00",
      "title": "2016 Best Companies for Diversity: McDonald’s Corporation",
      "text": "2016 Best Companies for Diversity: McDonald’s Corporation Here's how McDonald's exercises its effort to nurture diversity and inclusion throughout the company by Lisa Fraser Posted: December 7, 2016 CEO: Steve Easterbrook \n\nThe 50 companies on this year’s Best Companies for Diversity list represents brands that recognize the value of cultivating an inclusive environment, driven by company leadership through senior management and the board of directors, as shown in the BE Registry of Corporate Directors . Some are taking a step further to engage employees during turbulent and confusing sociopolitical times. \nHere, we’d like to highlight McDonald’s Corporation, the Illinois-based hamburger fast food chain, and what it’s doing to push forward and nurture diversity and inclusion. \nMcDonald’s diversity and inclusion efforts stretch across many aspects of its business. Seventy percent of its U.S. employees are comprised of women/minorities, 45% of its franchises are women or minority-owned, and it spends over $5 billion with diverse vendor suppliers. \nThe company is often recognized as a leader in D&I by African American organizations, as well as Hispanic and women’s organizations. McDonald’s has strong and active African American networks for both employees, such as McDonald’s African American Council, and franchisees, such as the Black McDonald’s Operator Association (BMOA), as additional programs, such as 365 Black, continue to resonate throughout communities and restaurants. The company also has committed relationships with the organizations PUSH/Excel, The National Urban League, and NAACP. It also offers scholarship programs that benefit African American students pursuing their college education. \nMcDonald’s Global Women’s Initiative, developed in 2006, helps women working at various locations around the world, through empowered, localized groups, with a focus on continuous improvement. This initiative has helped to increase the representation of women as restaurant managers, thus allowing for McDonald’s to receive recognition as a top company for women by the Catalyst organization. \nPat Harris, global chief diversity officer and VP, community engagement, described McDonald’s diversity and inclusion strategy as, “Seeing differences as strengths, being engaged in our communities, and respecting and valuing everyone on both sides of the counter around the globe.” ﻿",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [
          {
            "name": "steve easterbrook",
            "sentiment": "none"
          },
          {
            "name": "lisa fraser",
            "sentiment": "none"
          },
          {
            "name": "pat harris",
            "sentiment": "none"
          }
        ],
        "organizations": [
          {
            "name": "mcdonald",
            "sentiment": "negative"
          },
          {
            "name": "mcdonald’s corporation",
            "sentiment": "neutral"
          },
          {
            "name": "mcdonald’s corporation here",
            "sentiment": "neutral"
          },
          {
            "name": "the national urban league",
            "sentiment": "none"
          },
          {
            "name": "mcdonald’s african american council",
            "sentiment": "none"
          },
          {
            "name": "mcdonald’s global women’s initiative",
            "sentiment": "none"
          },
          {
            "name": "naacp",
            "sentiment": "none"
          },
          {
            "name": "black mcdonald’s operator association",
            "sentiment": "none"
          },
          {
            "name": "best companies for diversity",
            "sentiment": "none"
          }
        ],
        "locations": [
          {
            "name": "u.s.",
            "sentiment": "none"
          }
        ]
      },
      "crawled": "2016-12-07T21:36:35.703+02:00"
    },
    {
      "thread": {
        "uuid": "baf98c224638f907f503579528644b0f2aa52109",
        "url": "http://omgili.com/ri/snFTpiOKdJW2bzXjNEMbhXIYyO3CSOTkyRfhJhqaFRlEuK6y1hmJpRDp1ggdiB3vLgm9Lju7UOki5ussayIWrVpP.5iTTsh3FOIVtmIfg9Y-",
        "site_full": "news.iheart.com",
        "site": "iheart.com",
        "site_section": "",
        "site_categories": [
          "media"
        ],
        "section_title": "",
        "title": "EJ: OMG - McDonald's Now Has Waffle Fries!!! | EJ | Y93",
        "title_full": "EJ: OMG - McDonald's Now Has Waffle Fries!!! | EJ | Y93",
        "published": "2016-12-07T20:20:00.000+02:00",
        "replies_count": 0,
        "participants_count": 0,
        "site_type": "news",
        "country": "US",
        "spam_score": 0.013,
        "main_image": "http://i.iheart.com/v3/url/aHR0cDovL2ltZy55b3V0dWJlLmNvbS92aS9BSlVoOUdTbEhzTS9ocWRlZmF1bHQuanBn?ops=",
        "performance_score": 0,
        "domain_rank": 1524,
        "social": {
          "facebook": {
            "likes": 0,
            "comments": 0,
            "shares": 0
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "baf98c224638f907f503579528644b0f2aa52109",
      "url": "http://omgili.com/ri/snFTpiOKdJW2bzXjNEMbhXIYyO3CSOTkyRfhJhqaFRlEuK6y1hmJpRDp1ggdiB3vLgm9Lju7UOki5ussayIWrVpP.5iTTsh3FOIVtmIfg9Y-",
      "ord_in_thread": 0,
      "author": "",
      "published": "2016-12-07T20:20:00.000+02:00",
      "title": "EJ: OMG - McDonald's Now Has Waffle Fries!!! | EJ | Y93",
      "text": "A photo posted by Cindy Lam (@stuffcindyeats) on Nov 24, 2016 at 5:01pm PST \nWhat up!!!! It's EJ!! Allow me to introduce myself. I am 5'9' I love long walks in the park. Oh wait. That's starting to sound like a dating profile.... Anyway. I'm originally from Jersey and have been doing this radio thing for a minute. Come along for the journey, let's do this thing together. I'll buy the popcorn and you get the tickets! ;) \nConnect with me!! I promise I'm very friendly!! Follow me!! ",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [
          {
            "name": "cindy lam",
            "sentiment": "negative"
          }
        ],
        "organizations": [
          {
            "name": "mcdonald",
            "sentiment": "negative"
          }
        ],
        "locations": [
          {
            "name": "jersey",
            "sentiment": "none"
          }
        ]
      },
      "crawled": "2016-12-07T23:04:03.505+02:00"
    },
    {
      "thread": {
        "uuid": "d785497a2f5d1e3f9f685e96d02531dc1bc5f451",
        "url": "http://omgili.com/ri/2wGaacqxApvQboY7on5a1l9L3GcBODsgg0QtL0JzN42dstbhyvXj.vUh0ZQBk_AH.83HD2GYXx5yoqnpEPIPF7fDmGReKk2f0bI5wbCAQwFZzrmvhcBS1YR.vz.777E9mJpknS_wSvA-",
        "site_full": "markets.financialcontent.com",
        "site": "financialcontent.com",
        "site_section": "http://finance.dailyherald.com/dailyherald/action/rssfeed?ChannelID=6928",
        "site_categories": [
          "finance",
          "business"
        ],
        "section_title": "Business Journals",
        "title": "McDonald's set to move HQ back to Chicago, where it all started 61 years ago",
        "title_full": "McDonald's set to move HQ back to Chicago, where it all started 61 years ago",
        "published": "2016-12-07T23:20:39.568+02:00",
        "replies_count": 0,
        "participants_count": 0,
        "site_type": "blogs",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "",
        "performance_score": 0,
        "domain_rank": 86243,
        "social": {
          "facebook": {
            "likes": 0,
            "comments": 0,
            "shares": 0
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "d785497a2f5d1e3f9f685e96d02531dc1bc5f451",
      "url": "http://omgili.com/ri/2wGaacqxApvQboY7on5a1l9L3GcBODsgg0QtL0JzN42dstbhyvXj.vUh0ZQBk_AH.83HD2GYXx5yoqnpEPIPF7fDmGReKk2f0bI5wbCAQwFZzrmvhcBS1YR.vz.777E9mJpknS_wSvA-",
      "ord_in_thread": 0,
      "author": "",
      "published": "2016-12-07T23:20:39.568+02:00",
      "title": "McDonald's set to move HQ back to Chicago, where it all started 61 years ago",
      "text": "  15:45 PM EST McDonald's set to move HQ back to Chicago, where it all started 61 years ago The iconic burger chain broke ground Tuesday on its new home, a $250 million development in the heart of the booming Fulton Market neighborhood.",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [],
        "organizations": [
          {
            "name": "mcdonald",
            "sentiment": "negative"
          }
        ],
        "locations": [
          {
            "name": "chicago",
            "sentiment": "none"
          },
          {
            "name": "fulton market",
            "sentiment": "none"
          }
        ]
      },
      "crawled": "2016-12-07T23:20:39.568+02:00"
    },
    {
      "thread": {
        "uuid": "9a5efe0dd3bb3c2774f215aa42fd8759a25f5373",
        "url": "http://omgili.com/ri/jHIAmI4hxg9BcPFu_4VOJxXOPE7_XaSqQMP_vfwCA1Ya6nJpT0HHhlGpHfcgO5KbBHGtbsZp3Hwoqmj.6t5Xb4D43xVj2axdpr1kpEr0_5DPb4rOaBzcXQ--",
        "site_full": "www.onenewspage.com",
        "site": "onenewspage.com",
        "site_section": "http://www.onenewspage.com/rss/latest/Money.rss",
        "site_categories": [
          "news",
          "entertainment",
          "education"
        ],
        "section_title": "Latest Money News on One News Page",
        "title": "McDonald's waffle fries? Yes, please",
        "title_full": "McDonald's waffle fries? Yes, please - One News Page",
        "published": "2016-12-07T23:29:45.996+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "news",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "http://cdn.newsserve.net/ONPglobe128.png",
        "performance_score": 0,
        "domain_rank": 91686,
        "social": {
          "facebook": {
            "likes": 0,
            "comments": 0,
            "shares": 0
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "9a5efe0dd3bb3c2774f215aa42fd8759a25f5373",
      "url": "http://omgili.com/ri/jHIAmI4hxg9BcPFu_4VOJxXOPE7_XaSqQMP_vfwCA1Ya6nJpT0HHhlGpHfcgO5KbBHGtbsZp3Hwoqmj.6t5Xb4D43xVj2axdpr1kpEr0_5DPb4rOaBzcXQ--",
      "ord_in_thread": 0,
      "author": "onenewspage.com",
      "published": "2016-12-07T23:29:45.996+02:00",
      "title": "McDonald's waffle fries? Yes, please",
      "text": "Could McDonald's be challenging Chick-fil-A's waffle fry excellence?",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [],
        "organizations": [
          {
            "name": "mcdonald",
            "sentiment": "negative"
          }
        ],
        "locations": []
      },
      "crawled": "2016-12-07T23:29:45.996+02:00"
    },
    {
      "thread": {
        "uuid": "def178935d9f13a17da5e1c11b2f6e3dc66b6b23",
        "url": "http://omgili.com/ri/.0rSU5LtMgzpO4vjlC8XQeUhH_9t3tbuQB9EVLZ46Umby9RMMLmnnaBqBPDsk.lJ631_xXL6GvQU.0xv.qbQ4VF71LcwP63RdsjA9XrqFdSyW1qnZuf.1CELr282gs.LyOiaHKAAd6lvsQUFdY3Fehviak2WuseD",
        "site_full": "fox6now.com",
        "site": "fox6now.com",
        "site_section": "http://fox6now.com",
        "site_categories": [
          "news"
        ],
        "section_title": "WAFFLE FRIES on the special holiday menu at McDonald’s; offered to customers in Canada – FOX6Now.com",
        "title": "WAFFLE FRIES on the special holiday menu at McDonald’s; offered to customers in Canada",
        "title_full": "WAFFLE FRIES on the special holiday menu at McDonald’s; offered to customers in Canada",
        "published": "2016-12-07T23:40:35.118+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "blogs",
        "country": "US",
        "spam_score": 0.0,
        "main_image": null,
        "performance_score": 0,
        "domain_rank": 24893,
        "social": {
          "facebook": {
            "likes": 0,
            "comments": 0,
            "shares": 0
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "def178935d9f13a17da5e1c11b2f6e3dc66b6b23",
      "url": "http://omgili.com/ri/.0rSU5LtMgzpO4vjlC8XQeUhH_9t3tbuQB9EVLZ46Umby9RMMLmnnaBqBPDsk.lJ631_xXL6GvQU.0xv.qbQ4VF71LcwP63RdsjA9XrqFdSyW1qnZuf.1CELr282gs.LyOiaHKAAd6lvsQUFdY3Fehviak2WuseD",
      "ord_in_thread": 0,
      "author": "Katie DeLong",
      "published": "2016-12-07T23:40:35.118+02:00",
      "title": "WAFFLE FRIES on the special holiday menu at McDonald’s; offered to customers in Canada",
      "text": "McDonald’s is offering a special holiday menu at its restaurants in Canada — and that menu includes waffle fries! \nThe “Seasons Cravings” menu also features a new burger — the Potato Rosti and Bacon Burger, and a Turtle Sundae with Pecans.\nThe burger features 100% Canadian beef, savoury bacon pieces, a crispy potato rosti, processed cheddar cheese and a creamy cheese sauce on a toasted bun, topped with rolled oats.\nCome in and warm up with the new Potato Rosti & Bacon Burger! #SeasonsCravings pic.twitter.com/qzy84ULJBF \n— McDonald's Canada (@McD_Canada) December 7, 2016 \n\nThe waffle fries are potatoes cut in a criss-cross design and coated with a crisp, tasty batter.\nCelebrate #FRYday with Waffle Cut Fries. They’re just here for the holidays, so try them today! #SeasonsCravings pic.twitter.com/z1DoO98anT \n— McDonald's Canada (@McD_Canada) November 25, 2016 \n\nThe sundae includes vanilla soft serve, hot fudge sauce, mini caramel Turtles pieces and a chocolate and caramel drizzle.\nCome in and warm up with the new Season’s Cravings menu. It’s only here for a short time, so try it today! #SeasonsCravings pic.twitter.com/i7iNj9ahHj \n— McDonald's Canada (@McD_Canada) December 1, 2016 \n\nTime Magazine is reporting the menu also includes a salted caramel latte and a peppermint mocha coffee.\nAccording to Time, the peppermint mocha drink will make its way to the U.S., but there are no plans at this point to bring the waffle fries stateside.",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [],
        "organizations": [
          {
            "name": "mcdonald",
            "sentiment": "negative"
          },
          {
            "name": "time magazine",
            "sentiment": "none"
          },
          {
            "name": "time",
            "sentiment": "none"
          },
          {
            "name": "mcdonald's canada",
            "sentiment": "none"
          },
          {
            "name": "bacon burger",
            "sentiment": "none"
          },
          {
            "name": "waffle cut fries",
            "sentiment": "none"
          },
          {
            "name": "potato rosti & bacon burger",
            "sentiment": "none"
          }
        ],
        "locations": [
          {
            "name": "canada mcdonald’s",
            "sentiment": "none"
          },
          {
            "name": "canada",
            "sentiment": "none"
          },
          {
            "name": "u.s.",
            "sentiment": "none"
          }
        ]
      },
      "crawled": "2016-12-07T23:40:35.118+02:00"
    },
    {
      "thread": {
        "uuid": "0153414f78d39142a73c63abb2b3e6a88b83ee3a",
        "url": "http://omgili.com/ri/DyQaNGXlfMonmSKiUSjDY9DwrSHozumRT3P8PbSK72I-",
        "site_full": "themoviebox.net",
        "site": "themoviebox.net",
        "site_section": "http://feeds.feedburner.com/themovieboxnet",
        "site_categories": [
          "entertainment"
        ],
        "section_title": "TheMovieBox.Net",
        "title": "“The Founder” New Trailer — Michael Keaton wants to launch a Fast-Food Empire in McDonald’s Biopic with Nick Offerman",
        "title_full": "“The Founder” New Trailer — Michael Keaton wants to launch a Fast-Food Empire in McDonald’s Biopic with Nick Offerman",
        "published": "2016-12-07T15:00:00.000+02:00",
        "replies_count": 0,
        "participants_count": 0,
        "site_type": "blogs",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "",
        "performance_score": 0,
        "domain_rank": 81546,
        "social": {
          "facebook": {
            "likes": 0,
            "comments": 0,
            "shares": 0
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "0153414f78d39142a73c63abb2b3e6a88b83ee3a",
      "url": "http://omgili.com/ri/DyQaNGXlfMonmSKiUSjDY9DwrSHozumRT3P8PbSK72I-",
      "ord_in_thread": 0,
      "author": "",
      "published": "2016-12-07T15:00:00.000+02:00",
      "title": "“The Founder” New Trailer — Michael Keaton wants to launch a Fast-Food Empire in McDonald’s Biopic with Nick Offerman",
      "text": "source: facebook.com   \nHe's the man who launched the McDonald's franchise. No, not Mac or Dick McDonald, the brothers who originally established the first McDonald's restaurant in San Bernardino, California in the early 1940s. The man we're talking about is Ray Kroc, a 52-year-old milkshake machine salesman from Illinois, who wheeled-and-dealed his way into purchasing a then-little-known fast-food hamburger restaurant and turning it into a worldwide phenomenon. \nMichael Keaton portrays Ray Kroc in the upcoming 1950s-set drama \"The Founder,\" which centers on the highly contentious business deal that Kroc had made with the McDonald brothers, played by \"Parks and Rec\" comedian Nick Offerman and \"American Horror Story\" and \"Zodiac\" actor John Carrol Lynch. \nFrom John Lee Hancock, the director of \"The Blind Side\" and \"Saving Mr. Banks,\" the film also stars Laura Dern, Linda Cardellini, Patrick Wilson, and B.J. Novak. \n\"The Founder\" will have a special one-week Oscar-qualifying run in Los Angeles next week on December 16, before opening nationwide on January 20, 2017. In the meantime, check out a brand-new 60-second trailer, above. \nsynopsis: THE FOUNDER is a drama that tells the true story of how Ray Kroc (Michael Keaton), a salesman from Illinois, met Mac and Dick McDonald, who were running a burger operation in 1950s Southern California. Kroc was impressed by the brothers' speedy system of making the food and saw franchise potential. He maneuvered himself into a position to be able to pull the company from the brothers and create a billion-dollar empire. \n\ndirected by John Lee Hancock \nstarring Michael Keaton, Laura Dern, Nick Offerman, John Carroll Lynch, Linda Cardellini, Patrick Wilson, B.J. Novak \nrelease date December 16, 2016 (Oscar-qualifying run), January 20, 2017 (wide) View all trailers / clips for:",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [
          {
            "name": "michael keaton",
            "sentiment": "negative"
          },
          {
            "name": "nick offerman",
            "sentiment": "negative"
          },
          {
            "name": "dick mcdo",
            "sentiment": "neutral"
          },
          {
            "name": "john carrol lynch",
            "sentiment": "none"
          },
          {
            "name": "john lee hancock",
            "sentiment": "none"
          },
          {
            "name": "john carroll lynch",
            "sentiment": "none"
          },
          {
            "name": "laura dern",
            "sentiment": "none"
          },
          {
            "name": "patrick wilson",
            "sentiment": "none"
          },
          {
            "name": "ray kroc",
            "sentiment": "none"
          },
          {
            "name": "dick mcdonald",
            "sentiment": "none"
          },
          {
            "name": "mac",
            "sentiment": "none"
          },
          {
            "name": "linda cardellini",
            "sentiment": "none"
          },
          {
            "name": "b.j. novak",
            "sentiment": "none"
          },
          {
            "name": "parks",
            "sentiment": "none"
          },
          {
            "name": "kroc",
            "sentiment": "none"
          },
          {
            "name": "banks",
            "sentiment": "none"
          }
        ],
        "organizations": [
          {
            "name": "mcdonald",
            "sentiment": "negative"
          },
          {
            "name": "mcdonald's",
            "sentiment": "none"
          }
        ],
        "locations": [
          {
            "name": "california",
            "sentiment": "none"
          },
          {
            "name": "southern california",
            "sentiment": "none"
          },
          {
            "name": "illinois",
            "sentiment": "none"
          },
          {
            "name": "san bernardino",
            "sentiment": "none"
          },
          {
            "name": "los angeles",
            "sentiment": "none"
          }
        ]
      },
      "crawled": "2016-12-08T00:23:37.454+02:00"
    },
    {
      "thread": {
        "uuid": "8cef6c95f0c5723c202ecb4a9e0ade8f5a71f781",
        "url": "http://omgili.com/ri/jHIAmI4hxg.dy4vuMh5dvR5uzuQ65nExrtwT0OaADUIWBxu19Bq53WgUWTh47Sjp0jUp6YGlD36.V52vj9hc.wx72ufJuLeX",
        "site_full": "www.eater.com",
        "site": "eater.com",
        "site_section": "http://www.eater.com/rss/index.xml",
        "site_categories": [
          "news",
          "entertainment",
          "education"
        ],
        "section_title": "Eater -  All",
        "title": "You'll Never Love Anything Like This Woman Loves the McRib",
        "title_full": "You'll Never Love Anything Like This Woman Loves the McRib",
        "published": "2016-12-08T00:53:46.757+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "blogs",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "https://cdn0.vox-cdn.com/thumbor/5B31RMECzAQY2x7q_EiMv5LoV5g=/0x0:1403x789/1600x900/cdn0.vox-cdn.com/uploads/chorus_image/image/52177465/Screen_Shot_2016_12_07_at_9.32.09_AM.0.png",
        "performance_score": 0,
        "domain_rank": 2730,
        "social": {
          "facebook": {
            "likes": 0,
            "comments": 0,
            "shares": 0
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "8cef6c95f0c5723c202ecb4a9e0ade8f5a71f781",
      "url": "http://omgili.com/ri/jHIAmI4hxg.dy4vuMh5dvR5uzuQ65nExrtwT0OaADUIWBxu19Bq53WgUWTh47Sjp0jUp6YGlD36.V52vj9hc.wx72ufJuLeX",
      "ord_in_thread": 0,
      "author": "Alex Tewfik",
      "published": "2016-12-08T00:53:46.757+02:00",
      "title": "You'll Never Love Anything Like This Woman Loves the McRib",
      "text": "You'll Never Love Anything Like This Woman Loves the McRib She even wrote a song about McDonald's weirdest sandwich share YouTube Activism typically falls into one of four categories: social, political, economic, and environmental. But where does a fervent supporter of the McRib fit in? Last year Bay Area resident Xanthe Pajarilla — quickly becoming known as the McRib Girl — spent over three minutes of her life trying to convince a city council of the novelty sandwich’s merit on the mega-chain's menu. (Back in 2014, McDonald’s left it up to its franchisees to decide whether or not they would serve the barbecue sandwich with a cult-like following). To Pajarilla’s dismay, of the 10 McDonald’s locations in her hometown of Santa Clarita, exactly zero of them sold the McRib sandwich according to the McRib finder app . The video of her plea to city council members garnered over 46,000 views. After sadly receiving “no feedback at all,” Pajarilla took to YouTube to express her disappointment in blues form with a video called The McRib Song (McRib Blues) , which she hoped would “inspire some kind of change and get the McRib back to where it belongs, here in Santa Clarita.” Today is the one-year anniversary of the McRib Blues, and Pajarilla’s videos are going viral yet again . So, now, we should all take a step backward and think: Do we feel as passionate about anything as Pajarilla feels about the McRib? Anything at all ?",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [
          {
            "name": "xanthe pajarilla",
            "sentiment": "none"
          },
          {
            "name": "pajarilla",
            "sentiment": "none"
          }
        ],
        "organizations": [
          {
            "name": "mcdonald",
            "sentiment": "negative"
          },
          {
            "name": "youtube activism",
            "sentiment": "none"
          },
          {
            "name": "youtube",
            "sentiment": "none"
          }
        ],
        "locations": [
          {
            "name": "santa clarita",
            "sentiment": "none"
          },
          {
            "name": "bay area",
            "sentiment": "none"
          }
        ]
      },
      "crawled": "2016-12-08T00:53:46.757+02:00"
    },
    {
      "thread": {
        "uuid": "58e0026248793fdcb162060a2ea3f1dcef05db16",
        "url": "http://omgili.com/ri/jHIAmI4hxg.WnoVDhJqAFWQaF2jSMz6KWBVHL948Eq4g5R_bUZ_anryejfhKUbvzbdazFeOUIm9BhJwdxPtmbP1QyAZL_qbl7cm0U9jHGRuT6zQ5ma6u.Rn.RudbnNIQOMHYHIelUVo-",
        "site_full": "www.msn.com",
        "site": "msn.com",
        "site_section": "http://www.msn.com/en-us/foodanddrink",
        "site_categories": [
          "news",
          "media"
        ],
        "section_title": "Recipes, Tips, Restaurants, Chefs &amp; News - MSN Food &amp; Drink",
        "title": "McDonald's Is Changing Its Coffee",
        "title_full": "McDonald's Is Changing Its Coffee",
        "published": "2016-12-07T02:00:00.000+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "news",
        "country": "US",
        "spam_score": 1.0,
        "main_image": "",
        "performance_score": 0,
        "domain_rank": 13,
        "social": {
          "facebook": {
            "likes": 0,
            "comments": 0,
            "shares": 0
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "58e0026248793fdcb162060a2ea3f1dcef05db16",
      "url": "http://omgili.com/ri/jHIAmI4hxg.WnoVDhJqAFWQaF2jSMz6KWBVHL948Eq4g5R_bUZ_anryejfhKUbvzbdazFeOUIm9BhJwdxPtmbP1QyAZL_qbl7cm0U9jHGRuT6zQ5ma6u.Rn.RudbnNIQOMHYHIelUVo-",
      "ord_in_thread": 0,
      "author": "Rheanna O'Neil Bellomo",
      "published": "2016-12-07T02:00:00.000+02:00",
      "title": "McDonald's Is Changing Its Coffee",
      "text": "McDonald's Is Changing Its Coffee Delish 6 hrs ago Rheanna O'Neil Bellomo Click to expand Replay Video 15 Original Victoria’s Secret Models from the Class of ‘95 Before Gigi and Kendall, there was Beverly Peele and Stephanie Seymour. ELLE 7 Times Michelle Obama Was Flawless Look back at some of Michelle Obama's most flawless moments. Vanity Fair Flawless Contouring for Your Holiday Party Get this beautiful red lipped look, perfect for the holidays. Check out @ItsIsabelBedoya on Instagram for all her latest beauty looks and tips. Seventeen McDonald's wants to give coffee sales a jolt See more videos SHARE SHARE TWEET SHARE EMAIL What to watch next 15 Original Victoria’s Secret Models from the Class of ‘95 ELLE 1:02 7 Times Michelle Obama Was Flawless Vanity Fair 1:55 Flawless Contouring for Your Holiday Party Seventeen 0:42 How to Master the Dark Red Lip This Season Seventeen 0:34 We Can’t Stop Watching This DIY Messy Crown Braid Seventeen 1:06 Jordan brand launches a new Space Jam sneaker & apparel collection Esquire 0:47 This little girl wears the cutest homemade costumes to Disneyland INSIDER 1:25 Mom gets inspired by her baby girl to lose 130 lbs People 0:53 Hygge, the Nordic trend that could help you survive 2016 Time 1:20 Angels that Strutted Down Runway Pregnant In Victoria's Secret Show Inside Edition 1:06 Every Look From The Victoria’s Secret After-Party Marie Claire 1:07 1 Blazer on 3 Girls: NYE Party Edition Seventeen 1:07 Peppermint Sugar Scrub Cubes Are a DIY Dream Gift TPSY 0:56 6 Struggles of Carrying a Clutch Seventeen 1:05 Victoria's Secret Angels Share Their Fave Healthy Snacks SELF 0:50 The Simple Facial Scrub Lemon Lovers Will Adore Allure 0:34 UP NEXT\nMcDonald's has been switching up its menu left and right recently. After introducing regional specialties like fried cheese curds and waffle fries , the brand is now setting its sights on your morning coffee.\nAccording to Bloomberg , the Golden Arches plans to totally revamp its McCafe concept, which originally launched 8 years ago. Included in the new vision are more seasonal beverages, higher-quality espresso offerings, and a coffee rewards program. A McDonald's representative even told the business site that the company will be upgrading the fleet of equipment used in McCafes, including a $12,000 espresso machine.\nWhat's more, the burger chain has already planned a $1 drip coffee and $2 small specialty-beverage deal to take on competitors like Dunkin' and Starbucks, which have attracted customers with espresso, lattes and mochas. It also intends to switch to entirely sustainable coffee sources by 2020.\n© McDonald's McDonald's Is Changing Its Coffee—Here's What You Need to Know\nAs Bloomberg suggests, McDonald's is basically looking to ride the wave of all-day breakfast , which has been touted as a success since getting relaunched last year. Plus, the company's first stand-alone McCafe in Toronto-which serves Americanos and bakes pastries in-house-could be an indicator for the future of McDonald's java. Fancy, huh?\nFollow Delish on Instagram .\nGo to MSN Home",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [
        "https://web.skype.com/share?url=http%3a%2f%2fa.msn.com%2f06%2fen-us%2fAAlhfum&lang=en-us&flow_id=eb47e304-b566-4538-9ed2-18c60ac4a1ef",
        "http://img-s-msn-com.akamaized.net/tenant/amp/entityid/AA9yZwn.img",
        "http://www.delish.com/",
        "http://b.scorecardresearch.com/b?&quot;,&quot;DomainId&quot;:",
        "https://twitter.com/share?url=http%3a%2f%2fa.msn.com%2f06%2fen-us%2fAAlhfum%3focid%3dst&text=McDonald%27s+wants+to+give+coffee+sales+a+jolt&original_referer=http%3a%2f%2fa.msn.com%2f06%2fen-us%2fAAlhfum%3focid%3dst",
        "https://www.bloomberg.com/news/articles/2016-12-05/mcdonald-s-revamps-4-billion-mccafe-brand-as-it-lags-starbucks",
        "http://instagram.com/delish",
        "http://www.delish.com/food-news/a50444/mcdonalds-has-started-serving-waffle-fries/",
        "http://img-s-msn-com.akamaized.net/tenant/amp/entityid/AA9znQg.img",
        "http://eus-streaming-video-msn-com.akamaized.net/40c829d0-851c-4afe-bee3-ba9508ea1974/3484b86a-5601-4702-b68e-e18137f19982.ism&quot;,&quot;width&quot;:&quot;&quot;,&quot;height&quot;:&quot;&quot;},{&quot;formatCode&quot;:&quot;1006&quot;,&quot;url&quot;:&quot;http://eus-streaming-video-msn-com.akamaized.net/40c829d0-851c-4afe-bee3-ba9508ea1974/3484b86a-5601-4702-b68e-e18137f19982.ism/manifest(format=m3u8-aapl)&quot;,&quot;width&quot;:&quot;&quot;,&quot;height&quot;:&quot;&quot;},{&quot;formatCode&quot;:&quot;104&quot;,&quot;url&quot;:&quot;htt",
        "https://www.linkedin.com/shareArticle?mini=true&url=http%3a%2f%2fa.msn.com%2f06%2fen-us%2fAAlhfum%3focid%3dsl&title=McDonald%27s+wants+to+give+coffee+sales+a+jolt&source=http%3a%2f%2fa.msn.com%2f06%2fen-us%2fAAlhfum%3focid%3dsl",
        "http://www.delish.com/food-news/a48055/mcdonalds-expands-all-day-breakfast-menu/",
        "http://prod-video-cms-amp-microsoft-com.akamaized.net/tenant/amp/entityid/AAleUpa?blobrefkey=en-us&$blob=1&quot;,&quot;culture&quot;:&quot;en-us&quot;}",
        "http://prod-video-cms-amp-microsoft-com.akamaized.net/tenant/amp/entityid/AAleUpa?blobrefkey=1001&$blob=1&quot;,&quot;width&quot;:&quot;&quot;,&quot;height&quot;:&quot;&quot;},{&quot;formatCode&quot;:&quot;102&quot;,&quot;url&quot;:&quot;http://prod-video-cms-amp-microsoft-com.akamaized.net/tenant/amp/entityid/AAleUpa?blobrefkey=102&$blob=1&quot;,&quot;width&quot;:&quot;640&quot;,&quot;height&quot;:&quot;360&quot;},{&quot;formatCode&quot;:&quot;103&quot;,&quot;url&quot;:&quot;http://prod-video-cms-amp-microsoft-com.akamaized.net/tenant/amp/",
        "http://prod-video-cms-amp-microsoft-com.akamaized.net/tenant/amp/entityid/AAleUpa?blobrefkey=101&$blob=1&quot;,&quot;width&quot;:&quot;320&quot;,&quot;height&quot;:&quot;180&quot;}",
        "http://img-s-msn-com.akamaized.net/tenant/amp/entityid/BB2b706.img",
        "http://www.delish.com/food-news/a50354/mcdonalds-fried-cheese-bites/",
        "http://www.johngera.com/msn/mrss/itt.xml&quot;}",
        "http://img.s-msn.com/tenant/amp/entityid/AA9zqvp.img&quot;}}"
      ],
      "entities": {
        "persons": [
          {
            "name": "beverly peele",
            "sentiment": "none"
          },
          {
            "name": "stephanie seymour",
            "sentiment": "none"
          },
          {
            "name": "gigi",
            "sentiment": "none"
          },
          {
            "name": "marie claire",
            "sentiment": "none"
          },
          {
            "name": "kendall",
            "sentiment": "none"
          },
          {
            "name": "michelle obama",
            "sentiment": "none"
          }
        ],
        "organizations": [
          {
            "name": "rheanna o'neil bellomo click",
            "sentiment": "negative"
          },
          {
            "name": "mcdonald",
            "sentiment": "negative"
          },
          {
            "name": "starbucks",
            "sentiment": "none"
          },
          {
            "name": "vanity fair flawless contouring",
            "sentiment": "none"
          },
          {
            "name": "elle",
            "sentiment": "none"
          },
          {
            "name": "victoria",
            "sentiment": "none"
          },
          {
            "name": "esquire",
            "sentiment": "none"
          },
          {
            "name": "dunkin'",
            "sentiment": "none"
          },
          {
            "name": "nye party edition seventeen 1:07 peppermint sugar scrub cubes",
            "sentiment": "none"
          },
          {
            "name": "times michelle obama was flawless vanity fair",
            "sentiment": "none"
          },
          {
            "name": "disneyland",
            "sentiment": "none"
          },
          {
            "name": "bloomberg",
            "sentiment": "none"
          }
        ],
        "locations": [
          {
            "name": "victoria",
            "sentiment": "none"
          },
          {
            "name": "mccafes",
            "sentiment": "none"
          }
        ]
      },
      "crawled": "2016-12-08T00:56:50.848+02:00"
    },
    {
      "thread": {
        "uuid": "6ba09f52d75283a7aa0cb508e6676f70978b6e71",
        "url": "http://omgili.com/ri/jHIAmI4hxg9QdGw92Ry7G9pu5K3yngPqpg4ws_KP3Okn759nuGGoOhjMljy4AMLSRwiXGTTAZH5ycBmsJ.5ooEgdhI8ylzbyvKroJrWfXqKi9Vl4I233OIMFfLGrZp8M8fwB.bog6uWZUP2gQj9j5J938cRvb84e",
        "site_full": "www.goldderby.com",
        "site": "goldderby.com",
        "site_section": "http://www.goldderby.com/feed",
        "site_categories": [
          "news",
          "entertainment"
        ],
        "section_title": "Goldderby",
        "title": "‘The Voice’ Top 4: Will the champion be Billy Gilman, Sundance Head, We` McDonald or Josh Gallagher?",
        "title_full": "‘The Voice’ Top 4: Will the champion be Billy Gilman, Sundance Head, We` McDonald or Josh Gallagher?",
        "published": "2016-12-08T01:59:17.478+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "blogs",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "//static.goldderby.com/wp-content/uploads/2016/12/Top-4.jpg",
        "performance_score": 0,
        "domain_rank": 61066,
        "social": {
          "facebook": {
            "likes": 0,
            "comments": 0,
            "shares": 0
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "6ba09f52d75283a7aa0cb508e6676f70978b6e71",
      "url": "http://omgili.com/ri/jHIAmI4hxg9QdGw92Ry7G9pu5K3yngPqpg4ws_KP3Okn759nuGGoOhjMljy4AMLSRwiXGTTAZH5ycBmsJ.5ooEgdhI8ylzbyvKroJrWfXqKi9Vl4I233OIMFfLGrZp8M8fwB.bog6uWZUP2gQj9j5J938cRvb84e",
      "ord_in_thread": 0,
      "author": "Denton Davidson",
      "published": "2016-12-08T01:59:17.478+02:00",
      "title": "‘The Voice’ Top 4: Will the champion be Billy Gilman, Sundance Head, We` McDonald or Josh Gallagher?",
      "text": "42 mins ago Trae Patton/NBC \nThe Top 4 artists on the hit NBC reality series “ The Voice ” will battle it out live on Monday, December 12 to find out who the Season 11 champion will be. Adam Levine has leading odds to win his fourth championship as a coach, with two artists competing in next week’s finale. Blake Shelton and Alicia Keys each have one artist remaining, while rookie coach Miley Cyrus failed to get anyone from her team to the end. \nOf all 11 seasons, this might be the most difficult one yet to predict. There have been so many frontrunners at various points of the season that any of them really could win. So which artist is most on pace to become the new champion of “The Voice”? Below I have put together my final power ranking after taking the entire season into consideration. Who do you think will come out on top? Make sure you vote in our predictions center before the live finale on Tuesday, December 13. \n1. Billy Gilman (Team Adam) Gilman is the quintessential comeback story. The former child protegee was a country star before he was even a teenager, but has since fallen on hard times within the industry. He is now proving that he will stop at nothing to show everyone he has what it takes to make it in the music world as an adult. His soaring ballads have performed consistently well on iTunes, including going straight to number one this week with “I Surrender.” On top of that, he has nearly 59,000 twitter followers, which is more than double everyone else in the competition – proving he has a fan base ready to make him the Season 11 champ. \n2. Sundance Head (Team Blake) The soulful country singer has proven week after week that he can make any song his own and make any song a hit. Since the live shows began, Head has consistently led the way on the iTunes charts whether he was covering songs by Alicia Keys or The Judds . His likability factor is through the roof. We must also take into account how well country artists have done on “The Voice.” Shelton is, after all, the most-crowned coach in the history of the series. My skepticism for Head winning stems from Gallagher pulling away some of the country vote (Gilman could do the same for that matter). But Head could easily be Shelton’s fifth champion. \n3. We` McDonald (Team Alicia) This teenager was a frontrunner to win “The Voice” since we first saw her blind audition, “Feeling’ Good.” But since that strong start, McDonald has been somewhat inconsistent with her performances. She has also landed somewhere in the middle of the pack most weeks on the iTunes chart. But McDonald has a secret weapon: the young vote. It’s difficult to know what kind of arsenal of fans is voting for the young soul singer, but I do know that she was voted into the top three over other artists who performed significantly better on iTunes this week (Gallagher, Christian Cuevas , and Brendan Fletcher ). She also has more Twitter followers than anyone but Gilman. If the men split the vote, there is definitely room for McDonald to sneak up and steal this competition from all of them. \n4. Josh Gallagher (Team Adam) Gallagher perhaps has more star potential post-competition than anyone on the series. His charm, good looks, stage presence and modern country sound are a Nashville record label’s dream. But he just doesn’t have the big voice to stand out in this season full of powerhouses. He had to battle his way into the finale by winning the final instant save of the season on Tuesday, which means he is going into the finale as the lowest vote-getter. As much as I like Gallagher, I think it will be nearly impossible for him to pull out a win. But don’t be surprised if he ultimately has the most successful career. Photo Gallery: ‘The Voice’ all past winners from Seasons 1-10 \nGold Derby readers just like YOU often turn out to be our smartest prognosticators, so it’s important that you give us your predictions for the finale of “The Voice.” You can continue to update and change your forecasts throughout the week, just click “Save” when you’ve settled on your choices. You’ll compete to win a $100 Amazon gift certificate, bragging rights and a place of honor on our leaderboard. Our racetrack odds change as you make your predictions, just as they do when you bet on the Emmys, Oscars, Golden Globes and more. Be sure to read our contest rules and sound off on the season of “The Voice” in our reality TV forum . Leave a Reply Your email address will not be published. Required fields are marked * Comment Email * Website",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [
          {
            "name": "billy gilman",
            "sentiment": "negative"
          },
          {
            "name": "josh gallagher",
            "sentiment": "negative"
          },
          {
            "name": "gallagher",
            "sentiment": "none"
          },
          {
            "name": "shelton",
            "sentiment": "none"
          },
          {
            "name": "team alicia",
            "sentiment": "none"
          },
          {
            "name": "gilman",
            "sentiment": "none"
          },
          {
            "name": "christian cuevas",
            "sentiment": "none"
          },
          {
            "name": "team blake",
            "sentiment": "none"
          },
          {
            "name": "blake shelton",
            "sentiment": "none"
          },
          {
            "name": "brendan fletcher",
            "sentiment": "none"
          },
          {
            "name": "miley cyrus",
            "sentiment": "none"
          },
          {
            "name": "adam levine",
            "sentiment": "none"
          },
          {
            "name": "alicia keys",
            "sentiment": "none"
          }
        ],
        "organizations": [
          {
            "name": "voice",
            "sentiment": "negative"
          },
          {
            "name": "mcdonald",
            "sentiment": "negative"
          },
          {
            "name": "nbc",
            "sentiment": "negative"
          },
          {
            "name": "amazon",
            "sentiment": "none"
          }
        ],
        "locations": [
          {
            "name": "nashville",
            "sentiment": "none"
          }
        ]
      },
      "crawled": "2016-12-08T01:59:17.478+02:00"
    },
    {
      "thread": {
        "uuid": "7cc4610e4ecbc8504476583e4b530c575ac22a15",
        "url": "http://omgili.com/ri/jHIAmI4hxg_QQwzVh21hZviuT.crgLp8UaRArCVtgXLE9yHjovrI97DA_7_bmtoWpI43X4zehJUwIAg9BUVukWHYnn7QbgsNJshvkKUh0kCyzmBvbmQq7SPG5r4b1ooS",
        "site_full": "www.fox8live.com",
        "site": "fox8live.com",
        "site_section": "http://www.fox8live.com/category/230838/news?clienttype=rss",
        "site_categories": [
          "news"
        ],
        "section_title": "FOX 8 News WVUE-TV - News",
        "title": "Sick boy granted wish to work at McDonald's for a day",
        "title_full": "Sick boy granted wish to work at McDonald's for a day",
        "published": "2016-12-07T23:51:00.000+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "news",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "http://woio.images.worldnow.com/images/12653083_G.jpg",
        "performance_score": 0,
        "domain_rank": 95866,
        "social": {
          "facebook": {
            "likes": 0,
            "comments": 0,
            "shares": 0
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "7cc4610e4ecbc8504476583e4b530c575ac22a15",
      "url": "http://omgili.com/ri/jHIAmI4hxg_QQwzVh21hZviuT.crgLp8UaRArCVtgXLE9yHjovrI97DA_7_bmtoWpI43X4zehJUwIAg9BUVukWHYnn7QbgsNJshvkKUh0kCyzmBvbmQq7SPG5r4b1ooS",
      "ord_in_thread": 0,
      "author": "Cleveland 19 Digital Team",
      "published": "2016-12-07T23:51:00.000+02:00",
      "title": "Sick boy granted wish to work at McDonald's for a day",
      "text": "Sick boy granted wish to work at McDonald's for a day 2016-12-07T16:51:19Z Jude Sanford becomes honoarty McDonald's crew member for a day. (Source: McDonald's of Akron) AKRON, OH (WOIO) - \nHe didn't want to go to Disneyland, be part of a circus or get a fantasy bedroom makeover. \nNo, Jude Sanford had a different wish. The 6-year-old lifelong McDonald's fan wanted to join other crew members at his favorite restaurant for a day. \nAnd a fast food worker he shall be. \nThe brave youngster has suffered through numerous medical procedures to address the cerebral palsy, epilepsy and partial blindness that was caused by his in utero stroke. While enduring those painful treatments, Jude often longed for his favorite meal: McDonald’s cheeseburgers. \nIn honor of Jude's upcoming birthday, a couple of Akron McDonald’s Owner/Operators, Lea and Brian Heidman, will make Jude an honorary crew member at their Medina Road restaurant Wednesday. During the celebration, which begins at 4 p.m., Jude will wear a nametag, hat and crew shirt to work a station behind the front counter. \nRonald McDonald will be at the party as well . \nHappy Birthday and good luck Jude!",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [
          {
            "name": "jude sanford",
            "sentiment": "negative"
          },
          {
            "name": "jude",
            "sentiment": "none"
          },
          {
            "name": "brian heidman",
            "sentiment": "none"
          },
          {
            "name": "lea",
            "sentiment": "none"
          },
          {
            "name": "ronald mcdonald",
            "sentiment": "none"
          }
        ],
        "organizations": [
          {
            "name": "mcdonald",
            "sentiment": "negative"
          },
          {
            "name": "akron mcdonald",
            "sentiment": "none"
          },
          {
            "name": "mcdonald's of akron",
            "sentiment": "none"
          }
        ],
        "locations": [
          {
            "name": "akron",
            "sentiment": "none"
          },
          {
            "name": "disneyland",
            "sentiment": "none"
          },
          {
            "name": "medina road",
            "sentiment": "none"
          }
        ]
      },
      "crawled": "2016-12-08T02:00:05.905+02:00"
    },
    {
      "thread": {
        "uuid": "1ce763040b05a5017251df6d07c5e00b8542f426",
        "url": "http://omgili.com/ri/jHIAmI4hxg8hvMD..mDyw6vsSxN1U_AZbDnx48atEpABaYggwDpMeslIuzHoWp2E2bW6g1KPD1YZtTOeF9L_3cCZVPg9V4xHvF8wQvN6VK8-",
        "site_full": "www.abc15.com",
        "site": "abc15.com",
        "site_section": "http://www.abc15.com/feeds/rssFeed?siteId=10008&obfType=RSS_FEED&categoryId=10001\r",
        "site_categories": [
          "news"
        ],
        "section_title": "News | KNXV",
        "title": "McDonald's debuts waffle fries in Canada",
        "title_full": "McDonald's debuts waffle fries in Canada",
        "published": "2016-12-08T02:35:30.307+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "news",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "http://sharing.abc15.com/sharescnn/photo/2016/04/16/1460825270_36357263_ver1.0_640_480.jpg",
        "performance_score": 0,
        "domain_rank": 19697,
        "social": {
          "facebook": {
            "likes": 0,
            "comments": 0,
            "shares": 0
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "1ce763040b05a5017251df6d07c5e00b8542f426",
      "url": "http://omgili.com/ri/jHIAmI4hxg8hvMD..mDyw6vsSxN1U_AZbDnx48atEpABaYggwDpMeslIuzHoWp2E2bW6g1KPD1YZtTOeF9L_3cCZVPg9V4xHvF8wQvN6VK8-",
      "ord_in_thread": 0,
      "author": "Alex Hider",
      "published": "2016-12-08T02:35:30.307+02:00",
      "title": "McDonald's debuts waffle fries in Canada",
      "text": "McDonald's is selling waffle fries in Canada 5:20 PM, Dec 7, 2016 1 min ago Next \nWatch out Chick-Fil-A. You know longer own the market on waffle fries. \nMcDonald’s restaurants in Canada are testing the new cut of french fry, according to the McDonald’s Canada account. \nAccording to USA Today , the fries are available at in most of the country’s locations through the holiday season or while supplies last. McDonald's has not said whether waffle fries will make it south to America. \nWhile most McDonald’s locations only offer the chain’s signature “World Famous” shoestring fries, the restaurant has explored other options. Earlier this year, McDonald’s tested garlic fries in northern California — and quickly sold out. \nMcDonald’s also began selling french fries topped with chocolate and pumpkin-spiced sauces in Japan in September.",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [],
        "organizations": [
          {
            "name": "mcdonald",
            "sentiment": "negative"
          },
          {
            "name": "mcdonald’s",
            "sentiment": "none"
          },
          {
            "name": "usa today",
            "sentiment": "none"
          }
        ],
        "locations": [
          {
            "name": "canada",
            "sentiment": "none"
          },
          {
            "name": "canada mcdonald's",
            "sentiment": "none"
          },
          {
            "name": "california",
            "sentiment": "none"
          },
          {
            "name": "america",
            "sentiment": "none"
          },
          {
            "name": "japan",
            "sentiment": "none"
          }
        ]
      },
      "crawled": "2016-12-08T02:35:30.307+02:00"
    },
    {
      "thread": {
        "uuid": "2d6b4285818314f64b3202c252bea8151a5ecd84",
        "url": "http://omgili.com/ri/jHIAmI4hxg8Zk1HhvmC1nH74koZr.VB3opKK7jnvv5nAdhYUQR5Ff3PHQRa94Z5GMYBQyK36XHKSKrw5jSscxbnYURnmMWj1jBeWseTI1_1032X1Z..j9ITDpGKPeAjz",
        "site_full": "www.break.com",
        "site": "break.com",
        "site_section": "http://api.breakmedia.com/content/contentFeed/get?apiRequestJson={slug:'Brk_Web_HP_Stream',responseType:'rss'}",
        "site_categories": [
          "news",
          "blogs"
        ],
        "section_title": "Homepage Timestream",
        "title": "Today In Outrage: Woman Finds Piece Of Chicken In McDonald’s McNugget!",
        "title_full": "Today In Outrage: Woman Finds Piece Of Chicken In McDonald’s McNugget!",
        "published": "2016-12-08T02:41:26.601+02:00",
        "replies_count": 0,
        "participants_count": 0,
        "site_type": "news",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "http://media11.break.com/dnet/media/342/066/3066342/today-in-outrage-woman-finds-piece-of-chicken-in-mcdonald-s-mcnuggetdefault1-1.jpg",
        "performance_score": 0,
        "domain_rank": 5025,
        "social": {
          "facebook": {
            "likes": 1,
            "comments": 0,
            "shares": 1
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 1
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "2d6b4285818314f64b3202c252bea8151a5ecd84",
      "url": "http://omgili.com/ri/jHIAmI4hxg8Zk1HhvmC1nH74koZr.VB3opKK7jnvv5nAdhYUQR5Ff3PHQRa94Z5GMYBQyK36XHKSKrw5jSscxbnYURnmMWj1jBeWseTI1_1032X1Z..j9ITDpGKPeAjz",
      "ord_in_thread": 0,
      "author": "",
      "published": "2016-12-08T02:41:26.601+02:00",
      "title": "Today In Outrage: Woman Finds Piece Of Chicken In McDonald’s McNugget!",
      "text": "Today In Outrage: Woman Finds Piece Of Chicken In McDonald’s McNugget! Favorite by PhilHaney on 30 minutes ago 367 Previous | Next \nFor Today In Outrage we go to Brooklyn, Ohio. That is where a young lady named Celeste Sperry from Cleveland just wanted to eat a box of chicken nuggets from McDonald’s without being traumatized for life. However things took a sick turn when she found an actual piece of a chicken in her frickin’ McNuggets. What kind of bullshit is that McDonald’s? \nA bit of chicken feather can been seen in the photograph above, next to where she lovingly dipped it in ranch. So not only was the nugget itself contaminated but now she wasted valuable ranch sauce on a nug destined for the trash bin. AND YOU KNOW THEY ONLY GIVE YOU ONE RANCH PACKET. Ugh. \nEarlier this week the brave girl, Celeste shared video evidence of her foul fowl encounter on Facebook where she is seen plucking out the offending FEATHER from her nugget. She proclaimed that this was enough for her to NEVER EAT CHICKEN NUGGETS AGAIN. \nFirst of all, let’s not everyone gang up on this poor girl, she has been through enough. So stop with the death threats; as she said she is not a vegetarian- she was eating CHICKEN nuggets, which FYI are not vegetarian. So let her wait for the insurance adjuster to come by and inspect her chicken nugget in peace and hopefully he will refund the $5.00 \nSecondly, is it that shocking to find a piece of feather inside of your chicken? Or maybe Americans have been conditioned to NOT want to know what McDonald’s food is made from. \nI think that Celeste has a point. When I eat at McDonald’s I expect my chicken to not come from actual animals. Everyone knows that places like Taco Bell and McyD’s use pink slime for “beef.” Chicken McNuggets, like their KFC counterparts are supposed to be created from the mutant, headless, boneless, featherless chicken like organisms .Right?! This is America damn it. If you go to a fast food restaurant you damn well not get actual chicken in your chicken nuggets. \nAnd if she thought a feather was bad, wait until she sees these 11 GROSS ITEMS FOUND IN McDONALD’S FOOD THAT WILL MAKE YOU SICK. \nWhat is the grossest thing you have ever found in your McDonald’s order? \nFollow Phil Haney on Twitter @PhilHaney More detail »",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [
          {
            "name": "philhaney",
            "sentiment": "neutral"
          },
          {
            "name": "celeste",
            "sentiment": "none"
          },
          {
            "name": "phil haney",
            "sentiment": "none"
          },
          {
            "name": "celeste sperry",
            "sentiment": "none"
          }
        ],
        "organizations": [
          {
            "name": "mcdonald",
            "sentiment": "negative"
          },
          {
            "name": "taco bell",
            "sentiment": "none"
          },
          {
            "name": "kfc",
            "sentiment": "none"
          },
          {
            "name": "facebook",
            "sentiment": "none"
          }
        ],
        "locations": [
          {
            "name": "america",
            "sentiment": "none"
          },
          {
            "name": "brooklyn",
            "sentiment": "none"
          },
          {
            "name": "cleveland",
            "sentiment": "none"
          },
          {
            "name": "ohio",
            "sentiment": "none"
          }
        ]
      },
      "crawled": "2016-12-08T02:41:26.601+02:00"
    },
    {
      "thread": {
        "uuid": "2d737b13979b73c15dee54d37af024c14d1984b1",
        "url": "http://omgili.com/ri/7aBdisT0NOoBZYWQxBpDkI5ifekzaRHLY8HTSxzBhK_Faa5JKFGkvWZEQAxlKRiTXqIxXmJNiss-",
        "site_full": "screencrush.com",
        "site": "screencrush.com",
        "site_section": "http://klaw.com/feed/",
        "site_categories": [
          "entertainment"
        ],
        "section_title": "KLAW 101 - Oklahoma's Best Country",
        "title": "'The Founder' Review: Bah Dah Bah Bah Bahhhh, I'm Not Lovin' It",
        "title_full": "'The Founder' Review: Bah Dah Bah Bah Bahhhh, I'm Not Lovin' It",
        "published": "2016-12-08T00:00:00.000+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "news",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "http://screencrush.com/files/2016/11/thefounder-michael-keaton.jpg?w=600&h=0&zc=1&s=0&a=t&q=89",
        "performance_score": 0,
        "domain_rank": 18659,
        "social": {
          "facebook": {
            "likes": 0,
            "comments": 0,
            "shares": 0
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "2d737b13979b73c15dee54d37af024c14d1984b1",
      "url": "http://omgili.com/ri/7aBdisT0NOoBZYWQxBpDkI5ifekzaRHLY8HTSxzBhK_Faa5JKFGkvWZEQAxlKRiTXqIxXmJNiss-",
      "ord_in_thread": 0,
      "author": "Matt Singer",
      "published": "2016-12-08T00:00:00.000+02:00",
      "title": "'The Founder' Review: Bah Dah Bah Bah Bahhhh, I'm Not Lovin' It",
      "text": "By Matt Singer December 7, 2016 11:00 AM | ScreenCrush The Weinstein Company \nA meal at McDonald calls to mind words like “processed,”“synthetic,”“safe,” and “familiar.” The Founder , the story of the man who transformed McDonald’s from a regional burger chain into a fast-food juggernaut, is not a particularly compelling biopic, but it’s not a bad cinematic translation of what it feels like to eat at Mickey D’s. Every beat comes straight out of the great-but-complicated man movie biography playbook. Each element seems selected to fulfill the audience’s expectations for this kind of film. In one scene, the title character screams at a franchisee for deviating from the company’s strictly mandated list of burger toppings: two pickles, a sprinkle of onions, and a squirt of ketchup and mustard. This particular owner dared to break the rules and put lettuce on their burger. Lettuce! The Founder is a movie with no lettuce. \nThe man at its center is not named McDonald. Instead, the protagonist is Ray Kroc ( Michael Keaton ), a classic sort of American figure: The eternal striver who’s never grabbed the brass ring that’s remained just out of reach. Kroc’s life as the film begins is a history of get-rich-quick schemes that have taken their sweet time leaving him almost broke. His wife Ethel (Laura Dern) is getting fed up with his outlandish dreams and constant travel. Kroc’s current gig involves selling machines that can make several milkshakes simultaneously, but nobody’s buying — except for a wildly profitable burger stand in San Bernadino, California called McDonald’s that wants six of them. Kroc can’t conceive of a place that could need to make 30 milkshakes at once, so he hops on Route 66 and heads west to see the place for himself. \nWhat he feels when he arrives at McDonald’s is something like love at first sight. The burger joint’s sibling owners — genial Mac (John Caroll Lynch) and solemn Dick ( Nick Offerman ) — give him a tour of the kitchen, which they’ve honed to a marvel of efficiency that can deliver an order of burgers, fries, and soft drink in 30 seconds or less. Over dinner later, Mac and Dick tell Kroc their story; how they rose from truck drivers in the film business to struggling drive-in owners who then reimagined their entire business around speed and family-friendly atmosphere. These sequences, giddy with the thrill of ingenuity and creativity, are the best in the entire film. \nKroc thinks the McDonald brothers’ golden arches are an untapped gold mine, and he browbeats them into a job as their head of franchising. But the McDonalds stymie Kroc at every turn, rejecting any idea he proposes that deviates from their time-tested formula or tries to swap quality for a few extra bucks in profit. That sets up a power struggle for control of the company: the actual McDonald’s founders versus the guy who founded “ McDonald’s ,” the most successful restaurant chain in the world. Unless you’ve spent the last 50 years inside a fallout shelter, you already know who wins. \nThe hook, despite the obvious ending, should be the battle of wills between the two sides, and perhaps a deep dive into the mind of an unscrupulous businessman. But The Founder , directed by John Lee Hancock ( The Blind Side , Saving Mr. Banks ) has almost no interest in Kroc’s inner life. As presented onscreen, his only belief is in the value of persistence — and The Founder barely seems to have an opinion about Kroc’s scorched-earth tactics. The guy steals a family business out from under its creators and the movie mostly treats it with a shrug. (It’s hard to believe Robert Siegel, the guy who made his reputation with dark character studies like The Wrestler and Big Fan , wrote The Founder ’s screenplay, which displays none of the psychological complexity of his earlier work.) \nAfter a string of career-revitalizing performances (The Keavival? The Keatopia?), Keaton’s work as Kroc is a disappointment. He just strikes the same note of snake-oil charm over and over, and his scenes with Dern are perfunctory at best. (When history records the definitive list of great actresses wasted in thankless supporting biopic roles, Dern will be at or near the top.) Keaton’s Midwestern accent keeps fluctuating from scene to scene too; at times it’s barely present, and at others it’s so thick he sounds like he’s auditioning to become a new member of Bill Swerski’s Superfans. He anchored back-to-back Best Picture Oscar winners, but Keaton’s hot streak stops here. \nThe strongest acting in the film belongs to Offerman, who’s perfectly cast as the uptight half of the McDonald duo. Lynch is good too as the perpetual peacemaker of the trio. Unfortunately, as Kroc marginalizes the brothers from their own company, Hancock pushes them aside in The Founder , until the story becomes a string of moves in a very one-sided financial chess game. After the reasonably interesting first third, the movie starts regurgitating a series of historical incidents it might as well have taken from Wikipedia. (Actually, you’d learn more from Wikipedia than this movie, particularly about Kroc’s romantic history, including the second of his three wives, which the film never mentions.) \nAnd that’s the big takeaway from The Founder : This movie offers very few insights, and has no apparent point beyond mythologizing the early days of a company that doesn’t exactly need assistance in the self-mythologizing department. The Founder is such a chipper and wide-eyed look at McDonald’s origin, full of bright cinematography, gleaming retro cool burger joints, and upbeat music, that it almost qualifies as corporate propaganda.",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [
          {
            "name": "bah dah bah bah bahhhh",
            "sentiment": "negative"
          },
          {
            "name": "hancock",
            "sentiment": "none"
          },
          {
            "name": "robert siegel",
            "sentiment": "none"
          },
          {
            "name": "john caroll lynch",
            "sentiment": "none"
          },
          {
            "name": "john lee hancock",
            "sentiment": "none"
          },
          {
            "name": "laura dern",
            "sentiment": "none"
          },
          {
            "name": "ray kroc",
            "sentiment": "none"
          },
          {
            "name": "michael keaton",
            "sentiment": "none"
          },
          {
            "name": "dick",
            "sentiment": "none"
          },
          {
            "name": "dern",
            "sentiment": "none"
          },
          {
            "name": "bill swerski",
            "sentiment": "none"
          },
          {
            "name": "keaton",
            "sentiment": "none"
          },
          {
            "name": "lynch",
            "sentiment": "none"
          },
          {
            "name": "mac",
            "sentiment": "none"
          },
          {
            "name": "ethel",
            "sentiment": "none"
          },
          {
            "name": "keatopia",
            "sentiment": "none"
          },
          {
            "name": "nick offerman",
            "sentiment": "none"
          },
          {
            "name": "kroc",
            "sentiment": "none"
          },
          {
            "name": "banks",
            "sentiment": "none"
          },
          {
            "name": "offerman",
            "sentiment": "none"
          },
          {
            "name": "mickey d",
            "sentiment": "none"
          }
        ],
        "organizations": [
          {
            "name": "weinstein company",
            "sentiment": "negative"
          },
          {
            "name": "mcdonald",
            "sentiment": "negative"
          },
          {
            "name": "mcdonalds",
            "sentiment": "none"
          },
          {
            "name": "wikipedia",
            "sentiment": "none"
          }
        ],
        "locations": [
          {
            "name": "california",
            "sentiment": "none"
          },
          {
            "name": "san bernadino",
            "sentiment": "none"
          }
        ]
      },
      "crawled": "2016-12-08T02:44:50.933+02:00"
    },
    {
      "thread": {
        "uuid": "2720b8e666b769fa8236f1cb7325ca906893815c",
        "url": "http://omgili.com/ri/jHIAmI4hxg9gAvGumUjqCuv_hcVVhlBM2OERG3BcSAfYjNgRCX4KHaFPkqJzcwc6JGw5qL4.U7PkJnXvq3jLLA--",
        "site_full": "www.12newsnow.com",
        "site": "12newsnow.com",
        "site_section": "",
        "site_categories": [
          "news",
          "entertainment"
        ],
        "section_title": "",
        "title": "Hacked McDonald's drive-thru delivers f-bomb | 12NewsNow.com",
        "title_full": "Hacked McDonald's drive-thru delivers f-bomb | 12NewsNow.com",
        "published": "2016-12-06T07:00:00.000+02:00",
        "replies_count": 0,
        "participants_count": 0,
        "site_type": "news",
        "country": "US",
        "spam_score": 0.001,
        "main_image": "http://content.wtsp.com/photo/2016/12/06/GettyImages-56608152_1481040446846_7257330_ver1.0_640_360.jpg",
        "performance_score": 0,
        "domain_rank": 82432,
        "social": {
          "facebook": {
            "likes": 0,
            "comments": 0,
            "shares": 0
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "2720b8e666b769fa8236f1cb7325ca906893815c",
      "url": "http://omgili.com/ri/jHIAmI4hxg9gAvGumUjqCuv_hcVVhlBM2OERG3BcSAfYjNgRCX4KHaFPkqJzcwc6JGw5qL4.U7PkJnXvq3jLLA--",
      "ord_in_thread": 0,
      "author": "",
      "published": "2016-12-06T07:00:00.000+02:00",
      "title": "Hacked McDonald's drive-thru delivers f-bomb | 12NewsNow.com",
      "text": "Hacked McDonald's drive-thru delivers f-bomb 10News WTSP , WTSP 8:41 PM. CST December 06, 2016 The drive-thru speaker system at a McDonald's in New Bern, N.C., was hacked over the weekend and a customer heard lewd comments and vulgarities. (Photo by Tim Boyle/Getty Images) (Photo: Tim Boyle, 2006 Getty Images) CONNECT TWEET LINKEDIN GOOGLE+ PINTEREST \nA drive-thru customer at a McDonald's in New Bern, N.C., got a Big Mac shock when the voice from the order kiosk reportedly used vulgarities, and the incident was posted to YouTube. \nThe first response the customer heard was a man's voice saying: \"You know, I'm actually on the toilet right now and I'm just going to serve you your food. I'm not even going to wash my hands. \n\"I'm trying to get some special sauce out right now.\" \nWARNING: Video contains vulgarities and lewd comments \nA woman's voice is then heard saying, \"Welcome to McDonald's.\" \nThen the man's voice returns and says, \"You know what, just pull forward because I'm going to give you whatever the f--- I feel like giving you.\" \nThen there is the sound of some heavy breathing. \nThe video was posted on YouTube and has received 3,800 views. \n(© 2016 WTSP) ",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [
          {
            "name": "hacked mcdonald",
            "sentiment": "negative"
          },
          {
            "name": "tim boyle",
            "sentiment": "none"
          }
        ],
        "organizations": [
          {
            "name": "mcdonald",
            "sentiment": "negative"
          },
          {
            "name": "wtsp",
            "sentiment": "negative"
          },
          {
            "name": "google",
            "sentiment": "none"
          },
          {
            "name": "youtube",
            "sentiment": "none"
          }
        ],
        "locations": [
          {
            "name": "n.c.",
            "sentiment": "none"
          },
          {
            "name": "new bern",
            "sentiment": "none"
          }
        ]
      },
      "crawled": "2016-12-08T03:32:52.751+02:00"
    },
    {
      "thread": {
        "uuid": "c322fe10e67878a69896ea69acd4a8246321d1ee",
        "url": "http://omgili.com/ri/jHIAmI4hxg8KSMTvPVjIlisnYmQDt50k3dtGZxnThm0M6rpyNO_1Bjnb1eyVLK3g",
        "site_full": "www.ooyuz.com",
        "site": "ooyuz.com",
        "site_section": "http://www.ooyuz.com/newsanalysis?term=assistant secretary",
        "site_categories": [],
        "section_title": "assistant secretary News Results and Analysis |OOYUZ",
        "title": "Creator of McDonald’s flagship sandwich, the Big Mac, dies",
        "title_full": "Creator of McDonald’s flagship sandwich, the Big Mac, dies : Related Articles | OOYUZ",
        "published": "2016-11-30T18:40:00.000+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "news",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "",
        "performance_score": 0,
        "domain_rank": 53324,
        "social": {
          "facebook": {
            "likes": 0,
            "comments": 0,
            "shares": 0
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "c322fe10e67878a69896ea69acd4a8246321d1ee",
      "url": "http://omgili.com/ri/jHIAmI4hxg8KSMTvPVjIlisnYmQDt50k3dtGZxnThm0M6rpyNO_1Bjnb1eyVLK3g",
      "ord_in_thread": 0,
      "author": "Sun-Times",
      "published": "2016-11-30T18:40:00.000+02:00",
      "title": "Creator of McDonald’s flagship sandwich, the Big Mac, dies",
      "text": "PITTSBURGH (AP) — You probably don’t know his name, but you’ve almost certainly devoured his creation: two all-beef patties, special sauce, lettuce, cheese, pickles, onions, on a sesame seed bun. Michael James “Jim” Delligatti, the McDonald’s franchisee who created the Big Mac nearly 50 years ago and saw it become perhaps the best-known fast-food sandwich in the world, died Monday at home in Pittsburgh. Delligatti, who according to his son ate at least one 540-calorie Big Mac a week for decades,.. Advertisement",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [
          {
            "name": "delligatti",
            "sentiment": "none"
          },
          {
            "name": "michael james “jim” delligatti",
            "sentiment": "none"
          }
        ],
        "organizations": [
          {
            "name": "ap",
            "sentiment": "negative"
          },
          {
            "name": "mcdonald",
            "sentiment": "negative"
          },
          {
            "name": "big mac",
            "sentiment": "negative"
          }
        ],
        "locations": [
          {
            "name": "pittsburgh",
            "sentiment": "none"
          },
          {
            "name": "pittsburgh",
            "sentiment": "none"
          }
        ]
      },
      "crawled": "2016-12-08T05:39:10.212+02:00"
    },
    {
      "thread": {
        "uuid": "dd3c978e6eb97c55725c2c8d564f92bfff9ef45f",
        "url": "http://omgili.com/ri/rPCDLkAl21QbHnfY3QFB3Fg.4dw7PnKevvCfqv1SbGPeJxbOxzg1K5QLZicVp5s6eBCz5R6C5w3ebrYlyY2gW9LGDSxSG4R50DrIWu9S6HQkwlGPwIwosA--",
        "site_full": "abc13.com",
        "site": "abc13.com",
        "site_section": "http://abc13.com/feed/",
        "site_categories": [
          "news"
        ],
        "section_title": "abc13.com RSS Feed",
        "title": "McDonald's drive through speaker hacked, pranks, profanity ensue",
        "title_full": "McDonald's drive through speaker hacked, pranks, profanity ensue",
        "published": "2016-12-08T05:55:16.261+02:00",
        "replies_count": 0,
        "participants_count": 0,
        "site_type": "news",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "http://cdn.abclocal.go.com/content/ktrk/images/cms/automation/vod/1645153_1280x720.jpg",
        "performance_score": 0,
        "domain_rank": 14923,
        "social": {
          "facebook": {
            "likes": 0,
            "comments": 0,
            "shares": 0
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "dd3c978e6eb97c55725c2c8d564f92bfff9ef45f",
      "url": "http://omgili.com/ri/rPCDLkAl21QbHnfY3QFB3Fg.4dw7PnKevvCfqv1SbGPeJxbOxzg1K5QLZicVp5s6eBCz5R6C5w3ebrYlyY2gW9LGDSxSG4R50DrIWu9S6HQkwlGPwIwosA--",
      "ord_in_thread": 0,
      "author": "",
      "published": "2016-12-08T05:55:16.261+02:00",
      "title": "McDonald's drive through speaker hacked, pranks, profanity ensue",
      "text": "<iframe width=\"476\" height=\"267\" src=\"http://abc13.com/video/embed/?pid=1645154\" frameborder=\"0\" allowfullscreen></iframe> \nA McDonald's drive through in North Carolina was hacked over the weekend. (KTRK)  47PM NEW BERN, NC -- The greeting you're probably used to when you go through the drive through is, \"hello, how may I help you?\"That's not what some customers at a McDonald's drive-through in New Bern, North Carolina got.\"You know I'm actually on the toilet right now and I'm just going to serve your food, not even going to wash my hands.\" Watch the video above to see video from the actual hack Someone was able to hack the drive through frequency, spraying profanities at customers as they tried to place their orders.At first, some thought it was a joke.But the owner of the McDonald's doesn't.\"We are investigating this matter with the help of the new Bern Police Department.\" Related Topics:",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [],
        "organizations": [
          {
            "name": "mcdonald",
            "sentiment": "negative"
          },
          {
            "name": "bern police department",
            "sentiment": "none"
          },
          {
            "name": "ktrk",
            "sentiment": "none"
          }
        ],
        "locations": [
          {
            "name": "north carolina",
            "sentiment": "none"
          },
          {
            "name": "new bern",
            "sentiment": "none"
          },
          {
            "name": "nc",
            "sentiment": "none"
          },
          {
            "name": "new bern",
            "sentiment": "none"
          }
        ]
      },
      "crawled": "2016-12-08T05:55:16.261+02:00"
    }
  ],
  "totalResults": 18,
  "moreResultsAvailable": 0,
  "next": "/search?token=c6052904-f312-436b-a6d8-d915084ac866&format=json&ts=1481169316261&q=language%3A%28english%29+thread.country%3AUS+organization.negative%3A%22McDonald%22",
  "requestsLeft": 917
}
