{
  "posts": [
    {
      "thread": {
        "uuid": "3499b77354043eb98a8936a8509ae6292e0047a6",
        "url": "http://omgili.com/ri/7aBdisT0NOrO1_KRh30qwogLBAUlEvcqid9xGeFh8PgXPiKo1rllY.oLrp5TD6NXvMi_w9VhVtM-",
        "site_full": "seekingalpha.com",
        "site": "seekingalpha.com",
        "site_section": "http://seekingalpha.com/atom.xml",
        "site_categories": [
          "business"
        ],
        "section_title": "All Articles on Seeking Alpha",
        "title": "When To Buy Verizon?",
        "title_full": "When To Buy Verizon?",
        "published": "2016-11-09T00:03:19.551+02:00",
        "replies_count": 0,
        "participants_count": 0,
        "site_type": "news",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "https://staticseekingalpha1.a.ssl.fastly.net/images/marketing_images/fair_use_logos_products/sacl_vz_verizon_communications_logo_1jpeg",
        "performance_score": 0,
        "domain_rank": 1432,
        "social": {
          "facebook": {
            "likes": 2,
            "comments": 0,
            "shares": 2
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 1
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "3499b77354043eb98a8936a8509ae6292e0047a6",
      "url": "http://omgili.com/ri/7aBdisT0NOrO1_KRh30qwogLBAUlEvcqid9xGeFh8PgXPiKo1rllY.oLrp5TD6NXvMi_w9VhVtM-",
      "ord_in_thread": 0,
      "author": "",
      "published": "2016-11-09T00:03:19.551+02:00",
      "title": "When To Buy Verizon?",
      "text": "Verizon is richly valued at the current price. \nInvestors are advised to wait for lower price levels. \nCan we see $40-$42 in the near-term? \nI recently wrote an article on AT&T (NYSE: T ) titled Here's When You Should Buy AT&T in which I discussed a safe investing level for investors. In today's article, I plan on evaluating its competitor Verizon Communications (NYSE: VZ ). I hope to cover several points in this article, both fundamental and technical, in the simplest possible manner to appeal to both seasoned and inexperienced investors. \nThis is not intended to be a bearish thesis but rather an attempt to build a case for more conservative levels to buy. \nBefore I begin, I want to say it at the outset that this stock may witness some volatility due to the pending U.S. election results. However, any resultant move is expected to be short-lived as fundamentals will eventually be the driving force of the stock price. \nWhile evaluating Verizon, it is hard not to be fascinated by the stock. It offers such a challenging case to study that one could argue for it being both fairly valued and overvalued both at the same time. \nLook at the key fundamental statistics of Verizon below. The data below compares the performance and valuation of Verizon against the industry average. As one can clearly identify, Verizon's leadership in the industry can be quickly ascertained by the outstanding fundamental metrics such as net income growth (three-year average), operating margin (TTM), net margin percent TTM, return on assets (ROA), and return on equity (ROE). \nAs a result of the industry-beating performance, Verizon is richly or at least fairly valued too. While the TTM PE ratio of 13.8 is significantly better than the industry average of 20.3, the forward PE ratio of 11.8 indicates that the stock can become expensive in the future. \nBut one metric that screams overvaluation is the price-to-book ratio. It is unfortunate that many investors have forgotten this simple yet extremely vital fundamental tool to value a stock. The closer the stock's valuation is to its book value, the better the chance of a strong return. Sadly for Verizon, the current price is a staggering 9.5x the book value. This ratio is five-fold the industry average. \nThe price also is 1.5x the sales which is expensive when compared to the industry average of 1.3x but this is understandable given the company's market leadership. \nSource: Morningstar \nNow when I look at these metrics from a historical perspective, I find that the stock's current valuation is slightly overvalued. The current P/B ratio is higher than VZ's five-year average by 2%. Verizon's five-year average of P/S ratio is 1.2. In the last three years (yes, P/CF uses three-year average), the stock had traded at an average valuation of 4.7x the cash flow. Currently, it is at 6.9 times. \nConvincingly, it can be said that the stock is slightly overvalued or at least more than fairly valued. \nSource: Morningstar \nNow, I want to discuss why an investor does not have to necessarily buy the stock now. For this reason, I have presented the 10-year key growth ratios for Verizon below. \nClick to enlarge \nSource: Morningstar \nIt is clear from the above data that the company's revenue growth has been moderating of late, with even pockets of de-growth such as fiscal 2010 in which VZ recorded a 1.15 percent loss in annual revenues. In the latest quarter, the company recorded a revenue decline of 6.7 percent. \nThe company's operating income growth has fluctuated viciously in both directions year over year. In the last quarter, the operating income dropped by 13.21 percent. Similarly, for the net income growth and the EPS growth, it can be seen that the fluctuations have been pretty destabilizing to the investors. \nThe company's cash flow from operations (quarterly) as well as the quarterly free cash flow have gone absolutely nowhere in the last decade. This is not a stock where investors have to rush to buy or the rocket takes off. One can easily adopt a wait and watch approach for conservative levels to appear with time, or so does the history suggest. \nClick to enlarge \nWhat I am trying to convey with the above evidences is that the stock is not a value buy at the current level, and the astute investor would be wise off to hold the purchase for the time being until more exciting levels emerge. \nHey, I Could Be Easily Wrong Too …… \nThere is a strong possibility that I could be all but right in my analysis. And that needs to be told as well. \nAs can be seen from the short interest data available in the YCharts above, the bearish positions are at a multi-year low, which suggests that even though I am recommending waiting for inexpensive valuations, the smart money does not agree with me. The people who are more informed than me do not believe that the stock can go significantly lower to warrant aggressive shorting. \nEven the weekly VZ price chart below tells that the stock's 17 percent decline from its recent peak of $56.95 has pushed the stock closer to its oversold valuations, and that a rally cannot be ruled out. \nClick to enlarge \nSource: TradingView \nThe 14-week MFI has a current value of 22.2243 while the 14-week RSI has a value of 33.5440. The stock has been spending time closer to the lower range of the Bollinger Bands, which often acts as the support. \nFollowing the nearly oversold conditions and with support from the BB, the stock can easily rise to the $50-$52 zone which has the 12-week, the 20-week and the 30-week simple moving averages as the immediate resistances. \nBut, What If I Am Right? \nThere is an undeniable but a small probability that the stock continues to remain depressed and even tumble further owing to a shock reaction from the U.S. election results or a broad selling in the market due to rate hike fears. In that case, what are the levels that an investor should look forward too? We already have established that the stock is slightly expensive at the current levels, but when can it be purchased at low-risk levels? \nThe answer to these questions is pretty simple. One has to look no further than the monthly Verizon price chart submitted here. \nClick to enlarge \nSource: TradingView \nThe technical chart spans the period from 2008 to date. It is clear that the stock is trading in a strong uptrend since the end of the Great Depression. The stock has been offering investors several lucrative buying opportunities, marked by the upward sloping support trendline. We saw one such opportunity in August last year when the stock plummeted to sub-$40 levels. \nI would recommend investors to keep this multi-year hardened trendline close and use any dips to this technical level for adding on more shares. As of this moment, the support provided by the trendline comes in the zone of $40.50-$41.50. \nFor those who love a hefty dividend, if the stock were to drop closer to the indicated levels, the yield would easily cross 5.5 percent. However, this drop may take its own time. \nI also have employed the Fibonacci retracements to the post-depression rally and found that the stock pierced the first strong support of 23.6 percent retracement ($48.53) in October. While the next support is the 38.2 percent retracement ($43.31), I am expecting it to pierce this but stay shy of the 50 percent retracement ($39.10). \nI do not know the reason which would cause such a dramatic fall. It could be anything, and I do not have to know. What I have to focus on is the company's fundamentals and the business but not the price which keeps on fluctuating with the investors' expectations. Essentially, I'm recommending focusing on value which will always win in the long-term rather than the price which can remain subdued in the near-term. \nConclusion \nFundamentally, Verizon is clearly pampered by the investors. The current levels are not attractive, and it would be wise to wait on the sidelines for some better investing levels. \nI do not know if we will see $40-$42 in the near term, but if we do, I believe that this range may prove to be very apt for increasing the long positions. The smart money is not bearish on the stock, but it will only serve the investors well to lower their purchase price. After all, the return on a lower purchase price for a stock will always exceed that on a higher purchase price . \nAgain, there is a risk to this range as well. I have not yet included the risk of a possible recession. If a recession were to strike the market, I am sure that the stock would not be able to sustain above the long-term support trendline, and that we could see a severe fall in the stock price. \nWhile I would not suggest selling shares then, since they would become cheap, what I would definitely advise is dollar-cost averaging and holding this stock for a period of at least 3-5 years to reap the rewards. \nNote : I cover several stocks in different sectors as well as S&P 500, crude oil, gold and silver, U.S. dollar, etc. So, if you liked this update, and would like to read more of such informative articles, please consider hitting the Follow button above. Thank you for reading! Disclosure: I/we have no positions in any stocks mentioned, and no plans to initiate any positions within the next 72 hours. I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. About this article: Expand Author payment: $35 + $0.01/page view. Authors of PRO articles receive a minimum guaranteed payment of $150-500. Become a contributor »",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [],
        "organizations": [
          {
            "name": "verizon",
            "sentiment": "positive"
          },
          {
            "name": "s&p",
            "sentiment": "none"
          },
          {
            "name": "morningstar",
            "sentiment": "none"
          },
          {
            "name": "rsi",
            "sentiment": "none"
          },
          {
            "name": "tradingview",
            "sentiment": "none"
          },
          {
            "name": "verizon communications",
            "sentiment": "none"
          },
          {
            "name": "morningstar  now",
            "sentiment": "none"
          },
          {
            "name": "nyse",
            "sentiment": "none"
          },
          {
            "name": "mfi",
            "sentiment": "none"
          },
          {
            "name": "at&t",
            "sentiment": "none"
          }
        ],
        "locations": [
          {
            "name": "u.s.",
            "sentiment": "none"
          }
        ]
      },
      "crawled": "2016-11-09T00:03:19.551+02:00"
    },
    {
      "thread": {
        "uuid": "075144ef3d0a9ee04d51821a2f2ab4dc80e23b09",
        "url": "http://omgili.com/ri/jHIAmI4hxg9O6XiDaJfj6QZF5TpweIopCEq11UIV.nMbrWxGXywh0vgkIfENhjEXGvUzOP4qXwmD1uGN5RUGQ.0jpop6R0y1oh0RNLQtGFagKCwW6SKcnfYAMDfclJ3acqCOPgb3ixI-",
        "site_full": "www.edealinfo.com",
        "site": "edealinfo.com",
        "site_section": "http://feeds.feedburner.com/edealinfo/techdeals",
        "site_categories": [],
        "section_title": "eDealinfo.com - Today's Deals on Technology Products",
        "title": "Verizon Wireless: Get $300 Verizon Credit with Trade-in Your Old Phone",
        "title_full": "Verizon Wireless: Get $300 Verizon Credit with Trade-in Your Old Phone",
        "published": "2016-11-09T02:04:31.282+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "blogs",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "",
        "performance_score": 0,
        "domain_rank": 31629,
        "social": {
          "facebook": {
            "likes": 0,
            "comments": 0,
            "shares": 0
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "075144ef3d0a9ee04d51821a2f2ab4dc80e23b09",
      "url": "http://omgili.com/ri/jHIAmI4hxg9O6XiDaJfj6QZF5TpweIopCEq11UIV.nMbrWxGXywh0vgkIfENhjEXGvUzOP4qXwmD1uGN5RUGQ.0jpop6R0y1oh0RNLQtGFagKCwW6SKcnfYAMDfclJ3acqCOPgb3ixI-",
      "ord_in_thread": 0,
      "author": "rss@edealinfo.com (edealinfo.com)",
      "published": "2016-11-09T02:04:31.282+02:00",
      "title": "Verizon Wireless: Get $300 Verizon Credit with Trade-in Your Old Phone",
      "text": "  Verizon Wireless is offering Up to $300 Verizon Credit when you trade in your Old phone. New customers will get a gift card and existing customers will get an account credit. Eligible phones for $300 trade-in value: HTC One M9, iPhone 6, iPhone 6 Plus, iPhone 6S, iPhone 6S Plus, LG G4, LG V10, Galaxy S6, Galaxy S6 edge, Galaxy S6 edge+ and Galaxy Note5. Exclusions apply. amazon Reviews",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [],
        "organizations": [
          {
            "name": "verizon credit",
            "sentiment": "positive"
          },
          {
            "name": "verizon",
            "sentiment": "positive"
          },
          {
            "name": "verizon credit with trade-in your old phone   verizon wireless",
            "sentiment": "neutral"
          },
          {
            "name": "htc",
            "sentiment": "none"
          },
          {
            "name": "lg",
            "sentiment": "none"
          }
        ],
        "locations": []
      },
      "crawled": "2016-11-09T02:04:31.282+02:00"
    },
    {
      "thread": {
        "uuid": "a0a44aac82f045fd43fcc8a7f77107ba415ac5fa",
        "url": "http://omgili.com/ri/jHIAmI4hxg9zRF2wPMMuGdHZ2sToaiO5aNBfGaxxZjUOT2fOdZcTV4jiQbi7uYFdh8TWzFmQsgXXXdHxKDoTTRFKjDkOpak3eDCIFZfJS3mT0Aq6eAL9GlyWNUzRKIjVnlF0zzcCZyqXsV5WuEdNpw--",
        "site_full": "www.gospelherald.com",
        "site": "gospelherald.com",
        "site_section": "",
        "site_categories": [
          "news",
          "religion"
        ],
        "section_title": "",
        "title": "Black Friday Deals 2016 From Verizon, AT&T, T-Mobile, And Sprint | Gospelherald.com",
        "title_full": "Black Friday Deals 2016 From Verizon, AT&T, T-Mobile, And Sprint | Gospelherald.com",
        "published": "2016-11-10T07:00:00.000+02:00",
        "replies_count": 0,
        "participants_count": 0,
        "site_type": "news",
        "country": "US",
        "spam_score": 0.195,
        "main_image": "http://www.gospelherald.com/data/images/full/8264/black-friday.jpg",
        "performance_score": 0,
        "domain_rank": 62612,
        "social": {
          "facebook": {
            "likes": 0,
            "comments": 0,
            "shares": 0
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "a0a44aac82f045fd43fcc8a7f77107ba415ac5fa",
      "url": "http://omgili.com/ri/jHIAmI4hxg9zRF2wPMMuGdHZ2sToaiO5aNBfGaxxZjUOT2fOdZcTV4jiQbi7uYFdh8TWzFmQsgXXXdHxKDoTTRFKjDkOpak3eDCIFZfJS3mT0Aq6eAL9GlyWNUzRKIjVnlF0zzcCZyqXsV5WuEdNpw--",
      "ord_in_thread": 0,
      "author": "Edwin Kee",
      "published": "2016-11-10T07:00:00.000+02:00",
      "title": "Black Friday Deals 2016 From Verizon, AT&T, T-Mobile, And Sprint | Gospelherald.com",
      "text": "Comment \nBlack Friday deals are always the perfect way to obtain what you have always wanted to own all this while, but never really managed to do so simply because you do not have the financial capacity at that particular point in time. Perhaps it is time to regroup your resources and check out the slew of upcoming Black Friday deals that will be on offer, especially if you are on the lookout for a spanking new smartphone. After all, you are sick and tired of having each subsequent smartphone operating system update pass you by simply because your device is too old to “qualify”, so let us take a look at some of the possible and upcoming Black Friday deals that are offered by the four major mobile carriers in the US. \nT-Mobile Black Friday, BOGO deals It seems that Black Friday has started early for those who do not mind being tethered down with T-Mobile. This weekend alone, you will be able to take advantage of a BOGO (Buy One Get One) deal, and the smartphone that is being put up on offer would be the flagship Samsung Galaxy S7. Yes sir, pick up a couple of Galaxy S7s for yourself and your other half for the price of one at T-Mobile. This might mean that there is a large stock of Samsung Galaxy S7s left in T-Mobile’s inventory, which would mean that the carrier would like to shift whatever remaining stock that they have in hand. It is a pretty sweet deal, and if you still have faith in Samsung after the Galaxy Note 7 exploding fiasco, then you might want to consider picking up the Galaxy S7 which is a very good phone. The BOGO deal will require you to pick up the Samsung Galaxy S7 with T-Mobile’s Equipment Installment Plan (EIP), and it kicks off this Friday, November 11 at 6:00am PT all the way until Sunday, November 13 at 11:59pm PT. \nVerizon Black Friday deals When it comes to Verizon , you might not find too many smartphone deals available, although there will be plenty of accessories on offer on the cheap. The Sony SmartBand for Android can now be yours for just $29.99 from $99.99, while the Altec Lansing Life Jacket Waterproof Bluetooth Speaker has a $75 discount to $74.99. Those who want an entry level LG Lancet can pick it up for $120 a pop, while the Android 7.0 Nougat candidate, the Motorola Moto X (2nd Gen.) can be yours for $499.99. The Apple iPhone 6 will retail for $549.99, while the 16GB Microsoft Lumia 735 will go for $192 a pop, with the now defunct BlackBerry Z30 device retailing for $99.98, and the Samsung Galaxy Core Prime carrying a $144 sticker price. These are all pre-Black Friday deals, so do expect more in due time. \nSprint's deals Sprint has remained pretty much mum when it comes to their Black Friday deals this year, and so far, their Black Friday flyer has yet to be released so we are unable to determine just what kind of goodies that they have in store. However, you can always hit refresh on their promotions page just in case something good pops up suddenly. \nAT&T is also rather quiet AT&T has no Black Friday flyers out just yet, so we too, are in the dark as to what they offer for the upcoming Black Friday \"celebrations\", but we do know that they have some pretty standard deals lined up at the moment including the 32GB LG G5 that will retail for $688.99 unlocked, while the unlocked iPhone 7 with 32GB of internal memory will go for $649.99 apiece. If you want something free, then the LG G Pad F8 can be yours without having to drop a single penny -- although that comes with a 2-year contract. There is their deals page to look forward to if you like. \nWhat Black Friday deals would you like to see the most? ",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [],
        "organizations": [
          {
            "name": "verizon",
            "sentiment": "positive"
          },
          {
            "name": "sprint",
            "sentiment": "positive"
          },
          {
            "name": "t-mobile",
            "sentiment": "positive"
          },
          {
            "name": "at&t",
            "sentiment": "positive"
          },
          {
            "name": "samsung galaxy core",
            "sentiment": "none"
          },
          {
            "name": "verizon black",
            "sentiment": "none"
          },
          {
            "name": "samsung galaxy",
            "sentiment": "none"
          },
          {
            "name": "lg lancet",
            "sentiment": "none"
          },
          {
            "name": "sony",
            "sentiment": "none"
          },
          {
            "name": "bogo",
            "sentiment": "none"
          },
          {
            "name": "apple",
            "sentiment": "none"
          },
          {
            "name": "microsoft",
            "sentiment": "none"
          },
          {
            "name": "motorola moto",
            "sentiment": "none"
          },
          {
            "name": "altec lansing life jacket waterproof bluetooth",
            "sentiment": "none"
          },
          {
            "name": "samsung",
            "sentiment": "none"
          }
        ],
        "locations": [
          {
            "name": "us",
            "sentiment": "none"
          }
        ]
      },
      "crawled": "2016-11-10T23:33:03.696+02:00"
    },
    {
      "thread": {
        "uuid": "ec67fd755c79b117d880066f4529427efa1acd99",
        "url": "http://omgili.com/ri/.0rSU5LtMgxPOWeLQAZ1kyOt_H97h9FN2LmckX19klbhUWTUYQM6niMvVgyd9CqFYlJ_RWge8dk-",
        "site_full": "fortwayne.craigslist.org",
        "site": "craigslist.org",
        "site_section": "http://fortwayne.craigslist.org/search/sss?format=rss",
        "site_categories": [],
        "section_title": "craigslist fort wayne | for sale search",
        "title": "LG Tablet from Verizon $250",
        "title_full": "LG Tablet from Verizon $250",
        "published": "2016-11-13T22:49:22.450+02:00",
        "replies_count": 0,
        "participants_count": 0,
        "site_type": "blogs",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "https://images.craigslist.org/00c0c_6ft4on62RYi_600x450.jpg",
        "performance_score": 0,
        "domain_rank": 71,
        "social": {
          "facebook": {
            "likes": 0,
            "comments": 0,
            "shares": 0
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "ec67fd755c79b117d880066f4529427efa1acd99",
      "url": "http://omgili.com/ri/.0rSU5LtMgxPOWeLQAZ1kyOt_H97h9FN2LmckX19klbhUWTUYQM6niMvVgyd9CqFYlJ_RWge8dk-",
      "ord_in_thread": 0,
      "author": "",
      "published": "2016-11-13T22:49:22.450+02:00",
      "title": "LG Tablet from Verizon $250",
      "text": "  Hi i have a nice LG tablet from Verizon This tablet is in excellent working condition. This tablet comes with box that came with and comes with charger and screen protectors. Christmas is coming this is a perfect gift. Im selling this for $250 if your intrested text me at show contact info thanks and have a great day. do NOT contact me with unsolicited services or offers post id: 5874725620",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [],
        "organizations": [
          {
            "name": "verizon",
            "sentiment": "positive"
          },
          {
            "name": "lg tablet",
            "sentiment": "positive"
          }
        ],
        "locations": []
      },
      "crawled": "2016-11-13T22:49:22.450+02:00"
    },
    {
      "thread": {
        "uuid": "0435f9d52e7c4fb66d7bcee5c57f00d17a043f98",
        "url": "http://omgili.com/ri/_DuQb1SwTFphuXTNCrcC1rydWWfzW619w7zNemN.SGunww84Z.gVTxjCbsLrmjUrkgCLqmKOsUU-",
        "site_full": "grandrapids.craigslist.org",
        "site": "craigslist.org",
        "site_section": "http://grandrapids.craigslist.org/search/sss?format=rss",
        "site_categories": [],
        "section_title": "craigslist grand rapids | for sale search",
        "title": "Iphone 6s - 64 gig $375",
        "title_full": "Iphone 6s - 64 gig $375",
        "published": "2016-11-14T02:42:59.057+02:00",
        "replies_count": 0,
        "participants_count": 0,
        "site_type": "blogs",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "https://images.craigslist.org/01212_c01T5bHtkXK_600x450.jpg",
        "performance_score": 0,
        "domain_rank": 71,
        "social": {
          "facebook": {
            "likes": 0,
            "comments": 0,
            "shares": 0
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "0435f9d52e7c4fb66d7bcee5c57f00d17a043f98",
      "url": "http://omgili.com/ri/_DuQb1SwTFphuXTNCrcC1rydWWfzW619w7zNemN.SGunww84Z.gVTxjCbsLrmjUrkgCLqmKOsUU-",
      "ord_in_thread": 0,
      "author": "",
      "published": "2016-11-14T02:42:59.057+02:00",
      "title": "Iphone 6s - 64 gig $375",
      "text": "QR Code Link to This Post Selling my silver iPhone 6s. Verizon, 64 gig, clean ESN, great condition.   5851345710",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [],
        "organizations": [
          {
            "name": "verizon",
            "sentiment": "positive"
          }
        ],
        "locations": []
      },
      "crawled": "2016-11-14T02:42:59.057+02:00"
    },
    {
      "thread": {
        "uuid": "48d4b3abf852135bb5699eef83c1ca355a15b2c9",
        "url": "http://omgili.com/ri/jHIAmI4hxg.aX6RsjGyewe2esD1hjPoJI2nZzQD5.S4scpjQmbU03zsQUw54lbmuLkCwuRA7E3S2eqH_VYtj_Mfj3uaYM78IY0A.JCBdegSj5pH8BrIePg--",
        "site_full": "www.androidcentral.com",
        "site": "androidcentral.com",
        "site_section": "http://www.androidcentral.com/",
        "site_categories": [
          "news",
          "tech"
        ],
        "section_title": "Android Central - Android Forums, News, Reviews, Help and Android Wallpapers",
        "title": "Verizon builds on IoT division, acquires 'smart city' tech firm",
        "title_full": "Verizon builds on IoT division, acquires 'smart city' tech firm",
        "published": "2016-11-14T21:03:48.648+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "blogs",
        "country": "US",
        "spam_score": 0.0,
        "main_image": null,
        "performance_score": 0,
        "domain_rank": 1053,
        "social": {
          "facebook": {
            "likes": 0,
            "comments": 0,
            "shares": 0
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "48d4b3abf852135bb5699eef83c1ca355a15b2c9",
      "url": "http://omgili.com/ri/jHIAmI4hxg.aX6RsjGyewe2esD1hjPoJI2nZzQD5.S4scpjQmbU03zsQUw54lbmuLkCwuRA7E3S2eqH_VYtj_Mfj3uaYM78IY0A.JCBdegSj5pH8BrIePg--",
      "ord_in_thread": 0,
      "author": "Marc Lagace",
      "published": "2016-11-14T21:03:48.648+02:00",
      "title": "Verizon builds on IoT division, acquires 'smart city' tech firm",
      "text": "Verizon is hoping to make our city street corners smarter in the not-too-distant future.\nVerizon made a move to expand it's IoT business today, announcing the acquisition of LQD WiFi LLC., a private company based in New York that designed and developed publicly-accessible smart hubs . Branded as Palo, they are street-level kiosk-style structures that offers a range of services such as local community information, wayfinding, public safety announcements, and transit updates via 46-inch touchscreens, as well as providing free public wi-fi, security cameras, and emergency calling. The full terms of the transaction were not disclosed.\n\nLQD Founder and CEO Randy Ramusack explained the value their Palo kiosks are designed to add to communities:\n\"We designed Palo, from day one, to be part of the community, offering Wi-Fi, public safety features and a unique, interactive community engagement platform. Palo's human-scale touch screen lets users explore and connect with the local community creating multiple ways to engage, through an innovative, purposeful and curated experience.\"\nThis latest acquisition represents another huge step towards Verizon's goal of expanding its IoT business into the realm of developing \"smart cities\". Mike Lanman, senior vice president, Enterprise Products and Internet of Things at Verizon, touched on the value LQD's technology will add to Verizon's portfolio in the release:\n\"LQD's Palo technology hubs capture Verizon's vision of delivering citizen engagement experiences by connecting people with their communities while providing critical security, transportation and wayfinding solutions as well as Wi-Fi capabilities. This transaction uniquely positions us to utilize our unmatched infrastructure, platforms and network at scale to deploy elegant and engaging community technology hubs that connect, inform, inspire and support people where they live, work and play.\"\nIt might be some time before you see these Palo kiosks popping up in your town — unless you happen to live in the city of New Rochelle, New York, where LQD has a contract in place to run a pilot program to test their technology.\n",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [
          {
            "name": "palo",
            "sentiment": "none"
          },
          {
            "name": "mike lanman",
            "sentiment": "none"
          },
          {
            "name": "randy ramusack",
            "sentiment": "none"
          }
        ],
        "organizations": [
          {
            "name": "verizon",
            "sentiment": "positive"
          },
          {
            "name": "lqd",
            "sentiment": "none"
          },
          {
            "name": "enterprise products",
            "sentiment": "none"
          },
          {
            "name": "lqd wifi llc.",
            "sentiment": "none"
          }
        ],
        "locations": [
          {
            "name": "palo",
            "sentiment": "none"
          },
          {
            "name": "new york",
            "sentiment": "none"
          },
          {
            "name": "new rochelle",
            "sentiment": "none"
          }
        ]
      },
      "crawled": "2016-11-14T21:03:48.648+02:00"
    },
    {
      "thread": {
        "uuid": "d482e964609a7cee3b48727c6cf2fbe0e937d560",
        "url": "http://omgili.com/ri/rPCDLkAl21Ri5dOD7Tifp7LwIBlBh1wwxBJUcDrMHPDhyY7sDVy.BOy_Yb7Oz6VtoJ4PNcrHuViBby.hr9_EBmrVi1Cs1XJwgU_9K9AiUSw3IsPG8mxhe16KVV_eL5hXiT5Ivraq2Y0-",
        "site_full": "arstechnica.com",
        "site": "arstechnica.com",
        "site_section": "http://feeds.arstechnica.com/arstechnica/index/",
        "site_categories": [
          "blogs"
        ],
        "section_title": "Ars Technica",
        "title": "Verizon buys LQD WiFi, a company that builds urban smart hubs",
        "title_full": "Verizon buys LQD WiFi, a company that builds urban smart hubs | Ars Technica",
        "published": "2016-11-15T17:14:00.452+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "blogs",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "https://cdn.arstechnica.net/wp-content/uploads/2016/11/Screen-Shot-2016-11-15-at-9.33.46-AM-760x380.png",
        "performance_score": 0,
        "domain_rank": 1109,
        "social": {
          "facebook": {
            "likes": 49,
            "comments": 0,
            "shares": 49
          },
          "gplus": {
            "shares": 2
          },
          "pinterest": {
            "shares": 1
          },
          "linkedin": {
            "shares": 39
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "d482e964609a7cee3b48727c6cf2fbe0e937d560",
      "url": "http://omgili.com/ri/rPCDLkAl21Ri5dOD7Tifp7LwIBlBh1wwxBJUcDrMHPDhyY7sDVy.BOy_Yb7Oz6VtoJ4PNcrHuViBby.hr9_EBmrVi1Cs1XJwgU_9K9AiUSw3IsPG8mxhe16KVV_eL5hXiT5Ivraq2Y0-",
      "ord_in_thread": 0,
      "author": "Valentina Palladino",
      "published": "2016-11-15T17:14:00.452+02:00",
      "title": "Verizon buys LQD WiFi, a company that builds urban smart hubs",
      "text": "Verizon could soon be making its presence known nearby with beacon-like smart hubs. The company announced it has acquired the NYC-based startup LQD WiFi , which makes a kiosk system called Palo that delivers free Wi-Fi, community and location information, and emergency alerts to city dwellers. Palo renderings appear similar to the Link NYC kiosks that are slowly infiltrating the five boroughs to provide similar kinds of information to New York City residents.\nBoth Palo and Link NYC have established roots. LQD WiFi's founder and CEO Randy Ramusack worked at Microsoft Switzerland and Microsoft UK before starting the company, and Link NYC came out of the Intersection project of Google’s Sidewalk Labs. Currently there are Link NYC kiosks throughout Manhattan and parts of Queens, and more have been planned for the metro area in the coming months. We tested one of the kiosks out a few months ago and it worked pretty well, providing directions via Google Maps and free Wi-Fi. However, Link NYC recently had to disable the web browsing feature on its kiosks due to reports of \"lewd acts\" committed by users.\nPalo appears to differ slightly from Link NYC in its design. Link NYC kiosks basically have a tablet installed on one side where you can search for the information you need. Palo kiosks, on the other hand, have 46-inch LCD touchscreens with interactive transit maps, real-time schedules, public safety information, and more. \"We designed Palo, from day one, to be part of the community, offering Wi-Fi, public safety features and a unique, interactive community engagement platform,\" Ramusack wrote in the statement. \"Palo's human-scale touch screen lets users explore and connect with the local community creating multiple ways to engage, through an innovative, purposeful and curated experience.\"\nLQD WiFi isn't the first IoT company Verizon has purchased. In fact, it's just one on a list that has been growing recently: Verizon has bought Sensity Systems (smart LED lights), Telogis (connected cars), and Fleetmatics (workforce management), among others. Not only does LDQ WiFi give Verizon a physical outlet to show off its Wi-Fi services in cities around the country, but Verizon can also sell advertisements that continuously scroll on those 46-inch LCDs.\nIt'll take some time for Verizon and LQD WiFi to bring these kiosks to multiple cities. According to the announcement, New Rochelle, NY is the first city to partner with LQD WiFi, so it will likely be the first city to have Palo systems installed. The financial details of Verizon's acquisition of LQD WiFi have not been disclosed.",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [
          {
            "name": "randy ramusack",
            "sentiment": "none"
          },
          {
            "name": "telogis",
            "sentiment": "none"
          },
          {
            "name": "ramusack",
            "sentiment": "none"
          }
        ],
        "organizations": [
          {
            "name": "verizon",
            "sentiment": "positive"
          },
          {
            "name": "lqd wifi",
            "sentiment": "positive"
          },
          {
            "name": "sensity systems",
            "sentiment": "none"
          },
          {
            "name": "google maps",
            "sentiment": "none"
          },
          {
            "name": "microsoft",
            "sentiment": "none"
          },
          {
            "name": "google",
            "sentiment": "none"
          },
          {
            "name": "link nyc",
            "sentiment": "none"
          }
        ],
        "locations": [
          {
            "name": "queens",
            "sentiment": "none"
          },
          {
            "name": "new york city",
            "sentiment": "none"
          },
          {
            "name": "palo",
            "sentiment": "none"
          },
          {
            "name": "manhattan",
            "sentiment": "none"
          },
          {
            "name": "ny",
            "sentiment": "none"
          },
          {
            "name": "new rochelle",
            "sentiment": "none"
          }
        ]
      },
      "crawled": "2016-11-15T17:14:00.452+02:00"
    },
    {
      "thread": {
        "uuid": "de97aa3b787d7b12998fbc580e97e247bfe948cb",
        "url": "http://omgili.com/ri/8HG_hanVOKwq8nocvHwyr9Q8gtVTpfUYuDot09GXad8sixVAVPR0_fzSMhKtZJONyWX_hVQ.tKomvRptUodyF5pnQJ.zI_ay",
        "site_full": "pocketnow.com",
        "site": "pocketnow.com",
        "site_section": "http://pocketnow.com",
        "site_categories": [],
        "section_title": "Pocketnow",
        "title": "Bah humbug? Plans call for Verizon fees to be waived closer to Black Friday",
        "title_full": "Bah humbug? Plans call for Verizon fees to be waived closer to Black Friday",
        "published": "2016-11-15T21:46:02.521+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "blogs",
        "country": "US",
        "spam_score": 0.0,
        "main_image": null,
        "performance_score": 0,
        "domain_rank": 16051,
        "social": {
          "facebook": {
            "likes": 0,
            "comments": 0,
            "shares": 0
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "de97aa3b787d7b12998fbc580e97e247bfe948cb",
      "url": "http://omgili.com/ri/8HG_hanVOKwq8nocvHwyr9Q8gtVTpfUYuDot09GXad8sixVAVPR0_fzSMhKtZJONyWX_hVQ.tKomvRptUodyF5pnQJ.zI_ay",
      "ord_in_thread": 0,
      "author": "Jules Wang",
      "published": "2016-11-15T21:46:02.521+02:00",
      "title": "Bah humbug? Plans call for Verizon fees to be waived closer to Black Friday",
      "text": "The one big gift that you can ask from Verizon this holiday season? Fewer fees . But we know that it can’t just suddenly get off of its nickeling and diming habits so easily, so instead, we’ll settle for a fee waiver period. If a leaked email screenshot from PhoneArena tells the truth, that’s the most we can ask for.\nFrom November 17 through the 23rd, activation and upgrade fees will be waived for all applicable customers. Yes, even you, early upgrader or iPhone Upgrade Program upgrader . You’ll just need to bag up a new 4G-capable smartphone in that week on a device payment plan.\nAll this is not to say that the Checkmark can’t help you check items off your holiday shopping list — it has phone deals , too.\n\n \nThe post Bah humbug? Plans call for Verizon fees to be waived closer to Black Friday appeared first on Pocketnow .\n",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [
          {
            "name": "phonearena",
            "sentiment": "none"
          }
        ],
        "organizations": [
          {
            "name": "verizon",
            "sentiment": "positive"
          }
        ],
        "locations": []
      },
      "crawled": "2016-11-15T21:46:02.521+02:00"
    },
    {
      "thread": {
        "uuid": "3f1f872d0291b3155a85294bf60829bbfed9cf67",
        "url": "http://omgili.com/ri/.wHSUbtEfZS2zRe1PZr6bfCm.0GE0o3YSPwJLtDqK.hkLdZstmdsEXEBt7wewe_1d99fpeSZw6n2hVcRwWuXag--",
        "site_full": "techcrunch.com",
        "site": "techcrunch.com",
        "site_section": "",
        "site_categories": [
          "news"
        ],
        "section_title": "",
        "title": "Like by smiling? Facebook acquires emotion detection startup FacioMetrics | TechCrunch",
        "title_full": "Like by smiling? Facebook acquires emotion detection startup FacioMetrics | TechCrunch",
        "published": "2016-11-17T07:06:36.992+02:00",
        "replies_count": 0,
        "participants_count": 0,
        "site_type": "news",
        "country": "US",
        "spam_score": 0.013,
        "main_image": "https://tctechcrunch2011.files.wordpress.com/2016/11/faciometrics-app.png?w=764&amp;h=400&amp;crop=1",
        "performance_score": 8,
        "domain_rank": 697,
        "social": {
          "facebook": {
            "likes": 895,
            "comments": 1,
            "shares": 895
          },
          "gplus": {
            "shares": 51
          },
          "pinterest": {
            "shares": 4
          },
          "linkedin": {
            "shares": 404
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "3f1f872d0291b3155a85294bf60829bbfed9cf67",
      "url": "http://omgili.com/ri/.wHSUbtEfZS2zRe1PZr6bfCm.0GE0o3YSPwJLtDqK.hkLdZstmdsEXEBt7wewe_1d99fpeSZw6n2hVcRwWuXag--",
      "ord_in_thread": 0,
      "author": "Josh Constine",
      "published": "2016-11-17T07:06:36.992+02:00",
      "title": "Like by smiling? Facebook acquires emotion detection startup FacioMetrics | TechCrunch",
      "text": "Like by smiling? Facebook acquires emotion detection startup FacioMetrics Posted Verizon acquires SocialRadar to buff up MapQuest’s location data \nFacebook could one day build facial gesture controls for its app thanks to the acquisition of a Carnegie Mellon University spinoff company called FacioMetrics . The startup made an app called Intraface that could detect seven different emotions in people’s faces, but it’s been removed from the app stores. \nThe acquisition aligns with a surprising nugget of information Facebook slipped into a 32-bullet point briefing sent to TechCrunch this month. Regarding its plans for applying its artificial intelligence research, Facebook wrote (emphasis mine): \n“Future applications of deep learning platform on mobile : Gesture-based controls, recognize facial expressions and perform related actions “ \nIt’s not hard to imagine Facebook one day employing FacioMetrics’ tech and its own AI to let you add a Like or one of its Wow/Haha/Angry/Sad emoji reactions by showing that emotion with your face. \nThat’s probably a long way off, though. \nFor now, Facebook tells me it will use FacioMetrics to enhance its Snapchat selfie Lens-style augmented reality face masks that are making their way into its videos and Live broadcasts : \n“How people share and communicate is changing and things like masks and other effects allow people to express themselves in fun and creative ways. We’re excited to welcome the Faciometrics team who will help bring more fun effects to photos and videos and build even more engaging sharing experiences on Facebook .” FacioMetrics’ app can detect happiness in this person’s face \nThere are already some Facebook and Snapchat selfie masks that react to you opening your mouth or raising your eyebrows. FacioMetrics’ tech could add tons of new ways to trigger animated effects in your videos. \nFacebook is playing catchup to Snapchat in the AR game, and it could use all the talent it can buy. The social giant wouldn’t disclose the price it paid for FacioMetrics. But the startup’s founder Fernando De la Torre, an associate research professor at robots-and-self-driving car college Carnegie Mellon, wrote that : \nWe started FacioMetrics to respond to the increasing interest and demand for facial image analysis – with all kinds of applications including augmented/virtual reality, animation, audience reaction measurement, and others. We began our research at Carnegie Mellon University developing state-of-the-art computer vision and machine learning algorithms for facial image analysis. Over time, we have successfully developed and integrated this cutting-edge technology into battery-friendly and efficient mobile applications, and also created new applications of this technology. \nNow, we’re taking a big step forward by joining the team at Facebook. \nThe Greensburg Tribune Review spotted the acquisition, and reports that De la Torre’s research and app could be used to spot drowsy drivers, automatically analyze focus groups, detect depression, and improve avatars in video games. That last part could come in help, since Facebook’s Oculus division is also working on making life-like avatars that convey emotions via “VR emoji” . For example, shaking your fist in the air inside Oculus would make your avatar’s face turn angry. \nIf Facebook wants to be the home for all our sentimental social content, teaching computers to understand our emotions could definitely come in handy. 0 ",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [
          {
            "name": "fernando de la torre",
            "sentiment": "none"
          },
          {
            "name": "carnegie mellon",
            "sentiment": "none"
          },
          {
            "name": "de la torre",
            "sentiment": "none"
          }
        ],
        "organizations": [
          {
            "name": "verizon",
            "sentiment": "positive"
          },
          {
            "name": "mapquest",
            "sentiment": "none"
          },
          {
            "name": "greensburg tribune review",
            "sentiment": "none"
          },
          {
            "name": "carnegie mellon university",
            "sentiment": "none"
          },
          {
            "name": "facebook",
            "sentiment": "none"
          }
        ],
        "locations": []
      },
      "crawled": "2016-11-17T07:06:36.992+02:00"
    },
    {
      "thread": {
        "uuid": "e556f943937485ec97088d254869d06b00ad356d",
        "url": "http://omgili.com/ri/jHIAmI4hxg_uBcn5s23N.EYCeGhnaa9niXyuRcY0fEr_b2Yuk3wxOTv2GBNSODf2o.X4_l9DWDjCzd0f7DFoS8WMq3W5efBJskuVMFLkVwD7zAzFV.vSIEwACSfSG_Wllra2jmCruao-",
        "site_full": "www.phonearena.com",
        "site": "phonearena.com",
        "site_section": "http://phonearena.com/rss/rss_news.php",
        "site_categories": [
          "news",
          "shopping",
          "tech"
        ],
        "section_title": "Phone Arena - Latest News",
        "title": "The best value-for-money phones you can now get on Verizon",
        "title_full": "The best value-for-money phones you can now get on Verizon",
        "published": "2016-11-21T18:30:24.822+02:00",
        "replies_count": 0,
        "participants_count": 0,
        "site_type": "news",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "http://i-cdn.phonearena.com/images/article/88041-image/The-best-value-for-money-phones-you-can-now-get-on-Verizon.jpg",
        "performance_score": 0,
        "domain_rank": 1728,
        "social": {
          "facebook": {
            "likes": 0,
            "comments": 0,
            "shares": 0
          },
          "gplus": {
            "shares": 1
          },
          "pinterest": {
            "shares": 1
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "e556f943937485ec97088d254869d06b00ad356d",
      "url": "http://omgili.com/ri/jHIAmI4hxg_uBcn5s23N.EYCeGhnaa9niXyuRcY0fEr_b2Yuk3wxOTv2GBNSODf2o.X4_l9DWDjCzd0f7DFoS8WMq3W5efBJskuVMFLkVwD7zAzFV.vSIEwACSfSG_Wllra2jmCruao-",
      "ord_in_thread": 0,
      "author": "",
      "published": "2016-11-21T18:30:24.822+02:00",
      "title": "The best value-for-money phones you can now get on Verizon",
      "text": "The best value-for-money phones you can now get on Verizon The best value-for-money phones you can now get on Verizon Posted: Tags : Verizon - Verizon + Motorola - Motorola + Samsung - Samsung + Apple - Apple + Picks - Picks + The holiday season is nearing its zenith, and our wallets are already sighing with relief that they will soon become much thinner and have to hold much less bills that will be offloaded during these shopping-crazed times. If you are in the market for a new phone as a subscriber to America's largest carrier, there are a couple of Benjamins to be saved by scoring one of Verizon's current value-for-money propositions, instead of tying the knot with a two-year installment plan only looking for the biggest names in the biz. Check out some of the unsung handset heroes that offer the most bang for the buck on Verizon. Motorola Moto Z Play Droid Verizon has had its retail pricing for the wonderful Moto Z Play Droid set at $408 since inception, which is still a very good tag, but now made the deal even better if you pay on installments (we know, right). You can get the Z Play Droid for just $10 a month for a two-year period, after a $7 bill credit. This essentially gets you the phone for $240 if you pay on installments, and you aren't getting a doozy here. The Z Play Droid is slim, compact, with 4K video recording chops, the ability to use the Moto Mods , and one of the longest-lasting batteries we've tested on a phone - definitely nothing to sniff at for ten bucks a month. Moto Z Play Droid Review Popular galleries",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [],
        "organizations": [
          {
            "name": "verizon",
            "sentiment": "positive"
          },
          {
            "name": "motorola moto z play droid verizon",
            "sentiment": "none"
          },
          {
            "name": "motorola",
            "sentiment": "none"
          },
          {
            "name": "samsung",
            "sentiment": "none"
          }
        ],
        "locations": [
          {
            "name": "america",
            "sentiment": "none"
          }
        ]
      },
      "crawled": "2016-11-21T18:30:24.822+02:00"
    },
    {
      "thread": {
        "uuid": "36afe1a81cadaf43e8fc0eb14bbb8b8cdef8e971",
        "url": "http://omgili.com/ri/jHIAmI4hxg_ZZEJxw_HVLIVMnaJd1bQMlnaaNDSg36OZw3qbPZovHEc3jG7horu0etSSYOD_faQD4JHl5QjJeJhzQYUXs337ce.dkuJh73PNrxVfy0tpbn0xlC0KP4HQNCmqGfX7jDb.KNK1zUKWulwudlpCfGxXiyhQmgagraB5OLCZJdbvEDdduDeg8PHOOsxDyln4saXoqZWyEuU_vw--",
        "site_full": "www.prnewswire.com",
        "site": "prnewswire.com",
        "site_section": "http://www.prnewswire.com/rss/rss/financial-services/venture-capital-news.rss",
        "site_categories": [
          "education",
          "business"
        ],
        "section_title": "PR Newswire:",
        "title": "Verizon customers connect with friends and family in Japan for free following powerful earthquake",
        "title_full": "Verizon customers connect with friends and family in Japan for free following powerful earthquake",
        "published": "2016-11-22T03:06:26.402+02:00",
        "replies_count": 0,
        "participants_count": 0,
        "site_type": "news",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "https://photos.prnewswire.com/prnvar/20160527/373129LOGO",
        "performance_score": 0,
        "domain_rank": 3190,
        "social": {
          "facebook": {
            "likes": 3,
            "comments": 0,
            "shares": 3
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "36afe1a81cadaf43e8fc0eb14bbb8b8cdef8e971",
      "url": "http://omgili.com/ri/jHIAmI4hxg_ZZEJxw_HVLIVMnaJd1bQMlnaaNDSg36OZw3qbPZovHEc3jG7horu0etSSYOD_faQD4JHl5QjJeJhzQYUXs337ce.dkuJh73PNrxVfy0tpbn0xlC0KP4HQNCmqGfX7jDb.KNK1zUKWulwudlpCfGxXiyhQmgagraB5OLCZJdbvEDdduDeg8PHOOsxDyln4saXoqZWyEuU_vw--",
      "ord_in_thread": 0,
      "author": "",
      "published": "2016-11-22T03:06:26.402+02:00",
      "title": "Verizon customers connect with friends and family in Japan for free following powerful earthquake",
      "text": "Verizon customers connect with friends and family in Japan for free following powerful earthquake News provided by Nov 21, 2016, 19:59   NEW YORK   More than 160,000 Verizon employees worldwide want to support our friends and family in Japan who have been impacted by the powerful earthquake near Fukushima. Verizon is offering free wireless and wireline calling from the U.S. to Japan to connect with family and friends. Home wireline telephone customers will incur no charges to Japan from their U.S. landlines on November 21 through 23, 2016 (applicable taxes and surcharges will apply). Wireless users will incur no charges for texts or international long distance calls originating from the U.S. to Japan on November 21 through 23, 2016 (applicable taxes and surcharges will apply). Verizon Communications Inc. (NYSE, Nasdaq: VZ ), headquartered in New York City , has a diverse workforce of 162,000 and generated nearly $132 billion in 2015 revenues. Verizon operates America's most reliable wireless network, with 113.7 million retail connections nationwide. The company also provides communications and entertainment services over mobile broadband and the nation's premier all-fiber network, and delivers integrated business solutions to customers worldwide. VERIZON'S ONLINE NEWS CENTER: News releases, feature stories, executive biographies and media contacts are available at Verizon's online News Center at www.verizon.com/news /. News releases are also available through an RSS feed. To subscribe, visit www.verizon.com/about/rss-feeds / . Media contact:",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [],
        "organizations": [
          {
            "name": "verizon",
            "sentiment": "positive"
          },
          {
            "name": "verizon communications inc.",
            "sentiment": "none"
          },
          {
            "name": "nyse",
            "sentiment": "none"
          }
        ],
        "locations": [
          {
            "name": "japan",
            "sentiment": "none"
          },
          {
            "name": "new york city",
            "sentiment": "none"
          },
          {
            "name": "america",
            "sentiment": "none"
          },
          {
            "name": "fukushima",
            "sentiment": "none"
          },
          {
            "name": "u.s.",
            "sentiment": "none"
          }
        ]
      },
      "crawled": "2016-11-22T03:06:26.402+02:00"
    },
    {
      "thread": {
        "uuid": "cb23f45d3fb5bd1bd207e3f8372cc2b85fab02d4",
        "url": "http://omgili.com/ri/2wGaacqxApvQboY7on5a1l9L3GcBODsgg0QtL0JzN42dstbhyvXj.vUh0ZQBk_AH.83HD2GYXx7TAaZMSwXxQgPQza_WtYDLmH0vl333xcgWbE.0KG8zGbYNcINvWcGydlSoop.SZF7z01R1k_vdm8ullt1Go4upwqlytvtKXZopONTsyBKoJYIQgtB712svQNHvS1be6gT2Q3zkwuwmyQ--",
        "site_full": "markets.financialcontent.com",
        "site": "financialcontent.com",
        "site_section": "http://markets.financialcontent.com/heraldnet/action/rssfeed?ChannelID=3197",
        "site_categories": [
          "finance",
          "business"
        ],
        "section_title": "PR Newswire",
        "title": "Verizon customers connect with friends and family in Japan for free following powerful earthquake",
        "title_full": "Verizon customers connect with friends and family in Japan for free following powerful earthquake",
        "published": "2016-11-22T03:40:35.820+02:00",
        "replies_count": 0,
        "participants_count": 0,
        "site_type": "news",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "",
        "performance_score": 0,
        "domain_rank": 86243,
        "social": {
          "facebook": {
            "likes": 0,
            "comments": 0,
            "shares": 0
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "cb23f45d3fb5bd1bd207e3f8372cc2b85fab02d4",
      "url": "http://omgili.com/ri/2wGaacqxApvQboY7on5a1l9L3GcBODsgg0QtL0JzN42dstbhyvXj.vUh0ZQBk_AH.83HD2GYXx7TAaZMSwXxQgPQza_WtYDLmH0vl333xcgWbE.0KG8zGbYNcINvWcGydlSoop.SZF7z01R1k_vdm8ullt1Go4upwqlytvtKXZopONTsyBKoJYIQgtB712svQNHvS1be6gT2Q3zkwuwmyQ--",
      "ord_in_thread": 0,
      "author": "",
      "published": "2016-11-22T03:40:35.820+02:00",
      "title": "Verizon customers connect with friends and family in Japan for free following powerful earthquake",
      "text": "  19:59 PM EST Verizon customers connect with friends and family in Japan for free following powerful earthquake \nNEW YORK   More than 160,000 Verizon employees worldwide want to support our friends and family in Japan who have been impacted by the powerful earthquake near Fukushima. Verizon is offering free wireless and wireline calling from the U.S. to Japan to connect with family and friends. Home wireline telephone customers will incur no charges to Japan from their U.S. landlines on November 21 through 23, 2016 (applicable taxes and surcharges will apply). Wireless users will incur no charges for texts or international long distance calls originating from the U.S. to Japan on November 21 through 23, 2016 (applicable taxes and surcharges will apply). \n\nVerizon Communications Inc. (NYSE, Nasdaq: VZ), headquartered in New York City , has a diverse workforce of 162,000 and generated nearly $132 billion in 2015 revenues. Verizon operates America's most reliable wireless network, with 113.7 million retail connections nationwide. The company also provides communications and entertainment services over mobile broadband and the nation's premier all-fiber network, and delivers integrated business solutions to customers worldwide. \nVERIZON'S ONLINE NEWS CENTER: News releases, feature stories, executive biographies and media contacts are available at Verizon's online News Center at www.verizon.com/news /. News releases are also available through an RSS feed. To subscribe, visit www.verizon.com/about/rss-feeds / . \nMedia contact:",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [],
        "organizations": [
          {
            "name": "verizon",
            "sentiment": "positive"
          },
          {
            "name": "verizon communications inc.",
            "sentiment": "none"
          },
          {
            "name": "nyse",
            "sentiment": "none"
          }
        ],
        "locations": [
          {
            "name": "japan",
            "sentiment": "none"
          },
          {
            "name": "new york city",
            "sentiment": "none"
          },
          {
            "name": "america",
            "sentiment": "none"
          },
          {
            "name": "fukushima",
            "sentiment": "none"
          },
          {
            "name": "u.s.",
            "sentiment": "none"
          },
          {
            "name": "new york",
            "sentiment": "none"
          }
        ]
      },
      "crawled": "2016-11-22T03:40:35.820+02:00"
    },
    {
      "thread": {
        "uuid": "4a7cc569b35546b5d592dd79d6aa3d707ab597a2",
        "url": "http://omgili.com/ri/3_Ka6nIrU.X3wjBvy0zZdlK87DjiU1c8VxM.WfczTqQa9Oh5AVBb_LR_aI8I2dR5I2aHqyrLR86VR76LXoRFHwbENAASnDLtklp6S.4nXCgktWHrxke8yg36rofMMt6k",
        "site_full": "khon2.com",
        "site": "khon2.com",
        "site_section": "http://khon2.com",
        "site_categories": [
          "news"
        ],
        "section_title": "Verizon offers customers free calls to Japan following earthquake – KHON2",
        "title": "Verizon offers customers free calls to Japan following earthquake",
        "title_full": "Verizon offers customers free calls to Japan following earthquake",
        "published": "2016-11-22T04:23:53.463+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "blogs",
        "country": "US",
        "spam_score": 0.0,
        "main_image": null,
        "performance_score": 0,
        "domain_rank": 58642,
        "social": {
          "facebook": {
            "likes": 0,
            "comments": 0,
            "shares": 0
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "4a7cc569b35546b5d592dd79d6aa3d707ab597a2",
      "url": "http://omgili.com/ri/3_Ka6nIrU.X3wjBvy0zZdlK87DjiU1c8VxM.WfczTqQa9Oh5AVBb_LR_aI8I2dR5I2aHqyrLR86VR76LXoRFHwbENAASnDLtklp6S.4nXCgktWHrxke8yg36rofMMt6k",
      "ord_in_thread": 0,
      "author": "Web Staff",
      "published": "2016-11-22T04:23:53.463+02:00",
      "title": "Verizon offers customers free calls to Japan following earthquake",
      "text": "Verizon is offering free wireless and wireline calling from the U.S. to Japan to connect with family and friends who have been impacted by the powerful earthquake near Fukushima.\nHome wireline telephone customers will incur no charges to Japan from their U.S. landlines on November 21 through 23, 2016 (applicable taxes and surcharges will apply).\nWireless users will incur no charges for texts or international long distance calls originating from the U.S. to Japan on November 21 through 23, 2016 (applicable taxes and surcharges will apply).",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [],
        "organizations": [
          {
            "name": "verizon",
            "sentiment": "positive"
          }
        ],
        "locations": [
          {
            "name": "u.s.",
            "sentiment": "none"
          },
          {
            "name": "japan",
            "sentiment": "none"
          },
          {
            "name": "fukushima",
            "sentiment": "none"
          }
        ]
      },
      "crawled": "2016-11-22T04:23:53.463+02:00"
    },
    {
      "thread": {
        "uuid": "1b7f98dbb5260f8256947280565d8c8786369e22",
        "url": "http://omgili.com/ri/jHIAmI4hxg9WE61BxCzrwlujmthb6jkyyhIIUd40il3SGnWLhd.OsoeV1KQDKmc48PraoabeyjCRlhv6pDMLNUQqq3Nv8V2EewqEyKC_9n09_jI4V1.z9kDFKu2ExwhPph_fd0jfYYsV1EG14fdFhXk7sL0aMCrC",
        "site_full": "www.verizon.com",
        "site": "verizon.com",
        "site_section": "http://www.verizon.com/about/news/verizon-news-releases.xml",
        "site_categories": [
          "business"
        ],
        "section_title": "Verizon News Releases Feed",
        "title": "Verizon customers connect with friends and family in Japan for free following powerful earthquake",
        "title_full": "Verizon customers connect with friends and family in Japan for free following powerful earthquake",
        "published": "2016-11-22T07:45:00.000+02:00",
        "replies_count": 0,
        "participants_count": 0,
        "site_type": "news",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "",
        "performance_score": 0,
        "domain_rank": 528,
        "social": {
          "facebook": {
            "likes": 34,
            "comments": 0,
            "shares": 34
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 899
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "1b7f98dbb5260f8256947280565d8c8786369e22",
      "url": "http://omgili.com/ri/jHIAmI4hxg9WE61BxCzrwlujmthb6jkyyhIIUd40il3SGnWLhd.OsoeV1KQDKmc48PraoabeyjCRlhv6pDMLNUQqq3Nv8V2EewqEyKC_9n09_jI4V1.z9kDFKu2ExwhPph_fd0jfYYsV1EG14fdFhXk7sL0aMCrC",
      "ord_in_thread": 0,
      "author": "",
      "published": "2016-11-22T07:45:00.000+02:00",
      "title": "Verizon customers connect with friends and family in Japan for free following powerful earthquake",
      "text": "Verizon customers connect with friends and family in Japan for free following powerful earthquake Media contacts @JNels \nNEW YORK - More than 160,000 Verizon employees worldwide want to support our friends and family in Japan who have been impacted by the powerful earthquake near Fukushima. Verizon is offering free wireless and wireline calling from the U.S. to Japan to connect with family and friends. \nHome wireline telephone customers will incur no charges to Japan from their U.S. landlines on November 21 through 23, 2016 (applicable taxes and surcharges will apply). \nWireless users will incur no charges for texts or international long distance calls originating from the U.S. to Japan on November 21 through 23, 2016 (applicable taxes and surcharges will apply). Tags:",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [],
        "organizations": [
          {
            "name": "verizon",
            "sentiment": "positive"
          }
        ],
        "locations": [
          {
            "name": "japan",
            "sentiment": "none"
          },
          {
            "name": "fukushima",
            "sentiment": "none"
          },
          {
            "name": "u.s.",
            "sentiment": "none"
          },
          {
            "name": "new york",
            "sentiment": "none"
          }
        ]
      },
      "crawled": "2016-11-22T10:36:46.547+02:00"
    },
    {
      "thread": {
        "uuid": "467482164d203fa203b5c2946cb248dbc042a95f",
        "url": "http://omgili.com/ri/jHIAmI4hxg.aX6RsjGyewXaF650x_J7FQ3_xTZytttSY7c8lgSwXkx2u69R.Bw9L2bCLtyXfjJjZvbgcacCHuCdzCUjHnvvjxxEzW3F7yDg-",
        "site_full": "www.androidauthority.com",
        "site": "androidauthority.com",
        "site_section": "http://www.androidauthority.com",
        "site_categories": [
          "news",
          "tech"
        ],
        "section_title": "Android Authority",
        "title": "Google Pixel and Pixel XL see huge discounts at Verizon this Black Friday",
        "title_full": "Google Pixel and Pixel XL see huge discounts at Verizon this Black Friday",
        "published": "2016-11-23T02:02:11.820+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "blogs",
        "country": "US",
        "spam_score": 0.0,
        "main_image": null,
        "performance_score": 6,
        "domain_rank": 1848,
        "social": {
          "facebook": {
            "likes": 654,
            "comments": 0,
            "shares": 654
          },
          "gplus": {
            "shares": 17
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "467482164d203fa203b5c2946cb248dbc042a95f",
      "url": "http://omgili.com/ri/jHIAmI4hxg.aX6RsjGyewXaF650x_J7FQ3_xTZytttSY7c8lgSwXkx2u69R.Bw9L2bCLtyXfjJjZvbgcacCHuCdzCUjHnvvjxxEzW3F7yDg-",
      "ord_in_thread": 0,
      "author": "Jimmy Westenberg",
      "published": "2016-11-23T02:02:11.820+02:00",
      "title": "Google Pixel and Pixel XL see huge discounts at Verizon this Black Friday",
      "text": "\nIf you don’t mind being locked into a two-year payment plan, Verizon has a really, really good deal on the Google Pixel and Pixel XL .\nFrom this Thursday, November 24 through Friday, November 25, Verizon is selling the 32GB Google Pixel and Pixel XL for an incredibly low $10 per month, while the 128GB Pixel and Pixel XL are going for just $15 per month. That means, essentially, both 32GB models will cost you only $240 in all, and the 128GB versions will cost only $360. As you may recall, the 32GB Pixel and Pixel XL normally start at a hefty $649 and $769, respectively, making this one of the best Pixel deals we’ve seen thus far.\n\nThis is one of the best Pixel deals we've seen thus far\nBefore we get too excited, there’s a hefty dose of fine print we should talk about first. To get the deal, you’ll need to purchase your Pixel or Pixel XL on a standard device payment plan. After roughly 2-3 months, Verizon will start applying monthly bill credits to your account to make up for the discount. So, if you were to buy the 32GB Pixel on a payment plan, for instance, you’d get a total of $409 ($649 full retail price – $240) spread out over 24 months. In order to get the full discount, that line will need to be active for the full 24 months.\nSo no, you’re not getting these phones for $10 or $15 per month the simple way. But if you can get past the few caveats listed above, you’ll end up saving yourself quite a bit of money in the long run.\nDon’t miss: Black Friday 2016: best tech deals \nThis deal will be available both online and in-store, so you can even buy your new Google phone from the comfort of your home.\nIf the Pixel phones aren’t for you, Verizon is also letting new customers take $200 off any Android smartphone priced $400 or higher when they switch to Verizon or add a line from November 24-27. Alternatively, current customers can save $100 on any Android phone priced $400 or higher. In both cases, you’ll need to activate your new phone on a payment plan to get the discount.\nOh, and one other thing – Verizon, just like many other retailers, is selling the Google Home for just $99, which is a steal.\nNext: Best Verizon Android phones (November 2016) 7 hours ago ",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [],
        "organizations": [
          {
            "name": "google pixel",
            "sentiment": "positive"
          },
          {
            "name": "verizon",
            "sentiment": "positive"
          },
          {
            "name": "google",
            "sentiment": "none"
          },
          {
            "name": "google home",
            "sentiment": "none"
          }
        ],
        "locations": []
      },
      "crawled": "2016-11-23T02:02:11.820+02:00"
    },
    {
      "thread": {
        "uuid": "1a5b81970f28fbc0a7b4c9708cb0e31e91fc7bea",
        "url": "http://omgili.com/ri/_0JOtn.4SCoRuTimvW9_CzARX_VsCtcIcC2XvguYoF20yVE9dlzGzfciLmgdYaU5KqB2_wQI.30-",
        "site_full": "bgr.com",
        "site": "bgr.com",
        "site_section": "http://bgr.com",
        "site_categories": [
          "news",
          "tech"
        ],
        "section_title": "BGR",
        "title": "Verizon takes on T-Mobile with great iPhone 7 Black Friday sale of its own",
        "title_full": "Verizon takes on T-Mobile with great iPhone 7 Black Friday sale of its own",
        "published": "2016-11-24T22:10:14.809+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "blogs",
        "country": "US",
        "spam_score": 0.0,
        "main_image": null,
        "performance_score": 0,
        "domain_rank": 2702,
        "social": {
          "facebook": {
            "likes": 75,
            "comments": 0,
            "shares": 75
          },
          "gplus": {
            "shares": 3
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 3
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "1a5b81970f28fbc0a7b4c9708cb0e31e91fc7bea",
      "url": "http://omgili.com/ri/_0JOtn.4SCoRuTimvW9_CzARX_VsCtcIcC2XvguYoF20yVE9dlzGzfciLmgdYaU5KqB2_wQI.30-",
      "ord_in_thread": 0,
      "author": "Chris Smith",
      "published": "2016-11-24T22:10:14.809+02:00",
      "title": "Verizon takes on T-Mobile with great iPhone 7 Black Friday sale of its own",
      "text": "T-Mobile came out with a great iPhone 7 Black Friday sale earlier this week, and Sprint was quick to respond with its own special sale. Verizon, which already announced a great Google Pixel deal the other day, is now back with an iPhone 7 offer to take on its rivals. \nContinue reading... \nTrending right now: \nAll the best deals you’ll find in Walmart’s big Black Friday 2016 sale, which is now live Amazon’s massive Black Friday 2016 sale is live, and these are the best deals so far Target’s Black Friday 2016 sale is now live ",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [],
        "organizations": [
          {
            "name": "verizon",
            "sentiment": "positive"
          },
          {
            "name": "sprint",
            "sentiment": "positive"
          },
          {
            "name": "t-mobile",
            "sentiment": "positive"
          },
          {
            "name": "google pixel",
            "sentiment": "none"
          },
          {
            "name": "target’s black",
            "sentiment": "none"
          },
          {
            "name": "walmart",
            "sentiment": "none"
          },
          {
            "name": "amazon",
            "sentiment": "none"
          }
        ],
        "locations": []
      },
      "crawled": "2016-11-24T22:10:14.809+02:00"
    },
    {
      "thread": {
        "uuid": "1f372a4aed55a8a3064c21a0426962e9c98aeeae",
        "url": "http://omgili.com/ri/.wHSUbtEfZQCQhqJT8i7wVeUZd2wT97VIHv0L_5PoS5bSZZPsxwqfj.07_wx4aCKWNL_ZhKSqZlmPr0D6LvA2SBf3bOrI1onZhQj_K8FDdOse.N5g80DHQ--",
        "site_full": "news.yahoo.com",
        "site": "yahoo.com",
        "site_section": "https://news.yahoo.com/sitemap/stories/4.xml",
        "site_categories": [
          "news"
        ],
        "section_title": "",
        "title": "Verizon takes on T-Mobile with great iPhone 7 Black Friday sale of its own",
        "title_full": "Verizon takes on T-Mobile with great iPhone 7 Black Friday sale of its own",
        "published": "2016-11-25T04:09:00.000+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "news",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "https://s.yimg.com/uu/api/res/1.2/VUjVlx3k_345_qF7_evUBw--/aD02MTU7dz02MjQ7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_US/News/BGR_News/iphone-7-1.jpg?quality=98&amp;strip=all",
        "performance_score": 0,
        "domain_rank": 5,
        "social": {
          "facebook": {
            "likes": 0,
            "comments": 0,
            "shares": 0
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "1f372a4aed55a8a3064c21a0426962e9c98aeeae",
      "url": "http://omgili.com/ri/.wHSUbtEfZQCQhqJT8i7wVeUZd2wT97VIHv0L_5PoS5bSZZPsxwqfj.07_wx4aCKWNL_ZhKSqZlmPr0D6LvA2SBf3bOrI1onZhQj_K8FDdOse.N5g80DHQ--",
      "ord_in_thread": 0,
      "author": "BGR News",
      "published": "2016-11-25T04:09:00.000+02:00",
      "title": "Verizon takes on T-Mobile with great iPhone 7 Black Friday sale of its own",
      "text": "T-Mobile came out with a great iPhone 7 Black Friday sale earlier this week, and Sprint was quick to respond with its own special sale. Verizon, which already announced a great Google Pixel deal the other day, is now back with an iPhone 7 offer to take on its rivals.\nDEAL ALERT: The best Black Friday sale of the year is now live\nStarting on Thanksgiving, Verizon will let buyers purchase one of the hottest smartphones of the year for $0 when bought with an installment plan. You’ll also have to trade in one of the 13 eligible phones. In addition to the iPhone 7 and iPhone 7 Plus, the Pixel, Pixel XL, Moto Z Droid, Moto Z Droid Force, Galaxy S7 Edge, and Galaxy S7 are also included in the deal.\nHowever, you’ll have to turn in one of the following devices to take advantage of the deal: iPhone 6S, iPhone 6S Plus, iPhone 7, iPhone 7 Plus, Galaxy S6, Galaxy S6 edge, Galaxy S6 edge Plus, Galaxy S7, Galaxy S7 edge, Note5, LG V20, LG G5, and Moto Droid Turbo 2.\nHere are the rest of Verizon’s Black Friday deals as listed in its press release:\nSmartphones\nGet an iPhone 7, iPhone 7 Plus, Pixel, Phone by Google, Pixel XL, Phone by Google, Moto Z Droid, Moto Z Droid Force, Samsung S7 Edge, Samsung S7 at no cost with no money down when you trade in one of 13 eligible phones.* Valid through Sunday. Get a $200 Visa prepaid card when you switch to Verizon and purchase a smartphone on device payment. Valid for up to four lines. That’s $800 back when you switch four lines. Valid through Sunday. Get our best smartphones, like Google Pixel, for only $10 per month with no-trade-in required and no money down—our lowest prices ever. Valid Thursday and Friday online and Friday in-store only. Get savings when you switch to Verizon. Save up to $200 off all Android smartphones $400 and more. Existing customers can get $100 off when they upgrade. Valid through Sunday. Tablets\nGet our lowest price ever on an iPad Mini2 32 GB. Pick one up for $99 with a new two-year agreement….without any other required iPhone purchase. Valid Thursday and Friday online and in stores Friday. Get as Ellipsis 10 for $49 with a new two-year agreement – a big screen tablet with big value. Valid Thursday and Friday online and in stores Friday. Save on iPads all weekend: get $250 off an iPad with the purchase of an iPhone. Valid through Sunday. Get the Ellipsis 8HD for just $79 or the Ellipsis 10 for only $99. Valid through Sunday. Accessories (offers valid through Friday)\nSave $100 on UE BOOM 2 (Black Friday price: $99.99) Save $50 on Beats urBeats (Black Friday price: $49.99) Save $20 on Fitbit charge 2 and get a $25 Visa prepaid card via mail-in rebate (Black Friday price: $129.99) Accessories (offers valid through Sunday)\nSave $100 on LG Tone Platinum (Black Friday weekend price: $99.99) Save $100 on Harmon Kardon Onyx Bluetooth Speaker (Black Friday weekend price: $99.99) Save $75 on Beats Solo 3 Wireless On-Ear Headphones (Black Friday weekend price: $224.99) Save $70 on UE MEGABOOM (Black Friday weekend price: $229.99) Save $40 on FitBit Charge HR (Black Friday weekend price: $89.99) Save $35 on Mophie Powerstation XL (Black Friday weekend price: $34.99) Save $50 on NestCam (Black Friday weekend price: $149.99) Save $30 on Google Home (Black Friday weekend price: $99.99) Save $30 on FitBit Alta and get a $10 Visa prepaid card via mail-in rebate (Black Friday weekend price: $99.99) Buy two cases and get a third case free (of equal or lesser value; limit one per customer.) Trending right now:\nAll the best deals you’ll find in Walmart’s big Black Friday 2016 sale, which is now live Amazon’s massive Black Friday 2016 sale is live, and these are the best deals so far Target’s Black Friday 2016 sale is now live See the original version of this article on BGR.com",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [
        "https://bgr.com/2016/11/24/black-friday-iphone-7-deals/",
        "https://bgr.com/2016/11/24/walmart-black-friday-deals-2016-top-sales-now/",
        "https://bgr.com/2016/11/24/amazon-black-friday-2016-deals-now-live-best-of/",
        "https://www.amazon.com/b/?node=384082011&tag=b0c55yh-20",
        "https://bgr.com/2016/11/23/sprint-black-friday-2016-deals-vs-t-mobile/",
        "https://bgr.com/2016/11/24/target-black-friday-2016-deals-now-live/",
        "https://bgr.com/2016/11/22/t-mobile-black-friday-2016-deals-iphone-7-galaxy-s7/"
      ],
      "entities": {
        "persons": [
          {
            "name": "moto z droid",
            "sentiment": "none"
          }
        ],
        "organizations": [
          {
            "name": "verizon",
            "sentiment": "positive"
          },
          {
            "name": "sprint",
            "sentiment": "positive"
          },
          {
            "name": "t-mobile",
            "sentiment": "positive"
          },
          {
            "name": "moto z droid force",
            "sentiment": "none"
          },
          {
            "name": "google pixel",
            "sentiment": "none"
          },
          {
            "name": "fitbit charge hr",
            "sentiment": "none"
          },
          {
            "name": "harmon kardon onyx bluetooth speaker (black",
            "sentiment": "none"
          },
          {
            "name": "target’s black",
            "sentiment": "none"
          },
          {
            "name": "fitbit alta",
            "sentiment": "none"
          },
          {
            "name": "walmart",
            "sentiment": "none"
          },
          {
            "name": "lg tone platinum",
            "sentiment": "none"
          },
          {
            "name": "ellipsis",
            "sentiment": "none"
          },
          {
            "name": "ue megaboom",
            "sentiment": "none"
          },
          {
            "name": "nestcam",
            "sentiment": "none"
          },
          {
            "name": "amazon",
            "sentiment": "none"
          },
          {
            "name": "google",
            "sentiment": "none"
          },
          {
            "name": "google home",
            "sentiment": "none"
          },
          {
            "name": "lg",
            "sentiment": "none"
          },
          {
            "name": "samsung",
            "sentiment": "none"
          }
        ],
        "locations": []
      },
      "crawled": "2016-11-25T14:05:20.495+02:00"
    },
    {
      "thread": {
        "uuid": "4867947c6e9eec59a36c2d656f100119dcc34621",
        "url": "http://omgili.com/ri/.wHSUbtEfZQCR4GWh90giYJ9nPRvkrAwXQ8NmAV3FKt_mBFrhFETN.85by8oCm5Yu37FCv4wSlx.W4qv3mn020rf3.iGgNIOvJifRq2VNpf85j143ivBzQ--",
        "site_full": "www.yahoo.com",
        "site": "yahoo.com",
        "site_section": "http://news.yahoo.com/rss",
        "site_categories": [
          "news",
          "education"
        ],
        "section_title": "Yahoo News - Latest News & Headlines",
        "title": "Verizon takes on T-Mobile with great iPhone 7 Black Friday sale of its own",
        "title_full": "Verizon takes on T-Mobile with great iPhone 7 Black Friday sale of its own",
        "published": "2016-11-26T02:00:00.000+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "news",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "https://s.yimg.com/uu/api/res/1.2/VUjVlx3k_345_qF7_evUBw--/aD02MTU7dz02MjQ7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_US/News/BGR_News/iphone-7-1.jpg?quality=98&amp;strip=all",
        "performance_score": 0,
        "domain_rank": 5,
        "social": {
          "facebook": {
            "likes": 3,
            "comments": 0,
            "shares": 3
          },
          "gplus": {
            "shares": 1
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "4867947c6e9eec59a36c2d656f100119dcc34621",
      "url": "http://omgili.com/ri/.wHSUbtEfZQCR4GWh90giYJ9nPRvkrAwXQ8NmAV3FKt_mBFrhFETN.85by8oCm5Yu37FCv4wSlx.W4qv3mn020rf3.iGgNIOvJifRq2VNpf85j143ivBzQ--",
      "ord_in_thread": 0,
      "author": "Chris Smith",
      "published": "2016-11-26T02:00:00.000+02:00",
      "title": "Verizon takes on T-Mobile with great iPhone 7 Black Friday sale of its own",
      "text": "T-Mobile came out with a great iPhone 7 Black Friday sale earlier this week, and Sprint was quick to respond  with its own special sale. Verizon, which already announced a great Google Pixel deal the other day, is now back with an iPhone 7 offer to take on its rivals. DEAL ALERT: The best Black Friday sale of the year is now live \nStarting on Thanksgiving, Verizon will let buyers purchase one of the hottest smartphones of the year for $0 when bought with an installment plan. You’ll also have to trade in one of the 13 eligible phones. In addition to the iPhone 7 and iPhone 7 Plus, the Pixel, Pixel XL, Moto Z Droid, Moto Z Droid Force, Galaxy S7 Edge, and Galaxy S7 are also included in the deal.\nHowever, you’ll have to turn in one of the following devices to take advantage of the deal: iPhone 6S, iPhone 6S Plus, iPhone 7, iPhone 7 Plus, Galaxy S6, Galaxy S6 edge, Galaxy S6 edge Plus, Galaxy S7, Galaxy S7 edge, Note5, LG V20, LG G5, and Moto Droid Turbo 2.\nHere are the rest of Verizon’s Black Friday deals as listed in its press release:\nSmartphones \nGet an iPhone 7, iPhone 7 Plus, Pixel, Phone by Google, Pixel XL, Phone by Google, Moto Z Droid, Moto Z Droid Force, Samsung S7 Edge, Samsung S7 at no cost with no money down when you trade in one of 13 eligible phones.* Valid through Sunday. Get a $200 Visa prepaid card when you switch to Verizon and purchase a smartphone on device payment. Valid for up to four lines. That’s $800 back when you switch four lines. Valid through Sunday. Get our best smartphones, like Google Pixel, for only $10 per month with no-trade-in required and no money down—our lowest prices ever. Valid Thursday and Friday online and Friday in-store only. Get savings when you switch to Verizon. Save up to $200 off all Android smartphones $400 and more. Existing customers can get $100 off when they upgrade. Valid through Sunday. Tablets \nGet our lowest price ever on an iPad Mini2 32 GB. Pick one up for $99 with a new two-year agreement….without any other required iPhone purchase. Valid Thursday and Friday online and in stores Friday. Get as Ellipsis 10 for $49 with a new two-year agreement – a big screen tablet with big value. Valid Thursday and Friday online and in stores Friday. Save on iPads all weekend: get $250 off an iPad with the purchase of an iPhone. Valid through Sunday. Get the Ellipsis 8HD for just $79 or the Ellipsis 10 for only $99. Valid through Sunday. Accessories (offers valid through Friday) \nSave $100 on UE BOOM 2 (Black Friday price: $99.99) Save $50 on Beats urBeats (Black Friday price: $49.99) Save $20 on Fitbit charge 2 and get a $25 Visa prepaid card via mail-in rebate (Black Friday price: $129.99) Accessories (offers valid through Sunday) \nSave $100 on LG Tone Platinum (Black Friday weekend price: $99.99) Save $100 on Harmon Kardon Onyx Bluetooth Speaker (Black Friday weekend price: $99.99) Save $75 on Beats Solo 3 Wireless On-Ear Headphones (Black Friday weekend price: $224.99) Save $70 on UE MEGABOOM (Black Friday weekend price: $229.99) Save $40 on FitBit Charge HR (Black Friday weekend price: $89.99) Save $35 on Mophie Powerstation XL (Black Friday weekend price: $34.99) Save $50 on NestCam (Black Friday weekend price: $149.99) Save $30 on Google Home (Black Friday weekend price: $99.99) Save $30 on FitBit Alta and get a $10 Visa prepaid card via mail-in rebate (Black Friday weekend price: $99.99) Buy two cases and get a third case free (of equal or lesser value; limit one per customer.) Trending right now: \nAll the best deals you’ll find in Walmart’s big Black Friday 2016 sale, which is now live Amazon’s massive Black Friday 2016 sale is live, and these are the best deals so far Target’s Black Friday 2016 sale is now live See the original version of this article on BGR.com",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [
          {
            "name": "moto z droid",
            "sentiment": "none"
          }
        ],
        "organizations": [
          {
            "name": "verizon",
            "sentiment": "positive"
          },
          {
            "name": "sprint",
            "sentiment": "positive"
          },
          {
            "name": "t-mobile",
            "sentiment": "positive"
          },
          {
            "name": "moto z droid force",
            "sentiment": "none"
          },
          {
            "name": "google pixel",
            "sentiment": "none"
          },
          {
            "name": "fitbit charge hr",
            "sentiment": "none"
          },
          {
            "name": "harmon kardon onyx bluetooth speaker (black",
            "sentiment": "none"
          },
          {
            "name": "target’s black",
            "sentiment": "none"
          },
          {
            "name": "fitbit alta",
            "sentiment": "none"
          },
          {
            "name": "walmart",
            "sentiment": "none"
          },
          {
            "name": "lg tone platinum",
            "sentiment": "none"
          },
          {
            "name": "ellipsis",
            "sentiment": "none"
          },
          {
            "name": "ue megaboom",
            "sentiment": "none"
          },
          {
            "name": "nestcam",
            "sentiment": "none"
          },
          {
            "name": "amazon",
            "sentiment": "none"
          },
          {
            "name": "google",
            "sentiment": "none"
          },
          {
            "name": "google home",
            "sentiment": "none"
          },
          {
            "name": "lg",
            "sentiment": "none"
          },
          {
            "name": "samsung",
            "sentiment": "none"
          }
        ],
        "locations": []
      },
      "crawled": "2016-11-26T05:44:37.965+02:00"
    },
    {
      "thread": {
        "uuid": "4eabdadaa2e6899a91b994be585d2f9fd4e7cc61",
        "url": "http://omgili.com/ri/jHIAmI4hxg_qWoPCOq9ULr9b.p3ndH0t1IvF6yb56O7Rynq38ck9tYE_RYYmQlKkdiwKXV8gY.Abijlj8SDqYfGt6uB22x236UFrKP2XnZK39DGGo.HgjpRTyehLRUgxXJ0ERH9eoabZW2M7.Km8EQ--",
        "site_full": "www.prepaidphonenews.com",
        "site": "prepaidphonenews.com",
        "site_section": "http://www.prepaidphonenews.com/",
        "site_categories": [
          "business"
        ],
        "section_title": "Prepaid Phone News",
        "title": "I am not a big fan of Verizon, but this is a good ...",
        "title_full": "I am not a big fan of Verizon, but this is a good ...",
        "published": "2016-11-30T05:08:58.263+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "blogs",
        "country": "US",
        "spam_score": 0.0,
        "main_image": null,
        "performance_score": 0,
        "domain_rank": 87417,
        "social": {
          "facebook": {
            "likes": 0,
            "comments": 0,
            "shares": 0
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "4eabdadaa2e6899a91b994be585d2f9fd4e7cc61",
      "url": "http://omgili.com/ri/jHIAmI4hxg_qWoPCOq9ULr9b.p3ndH0t1IvF6yb56O7Rynq38ck9tYE_RYYmQlKkdiwKXV8gY.Abijlj8SDqYfGt6uB22x236UFrKP2XnZK39DGGo.HgjpRTyehLRUgxXJ0ERH9eoabZW2M7.Km8EQ--",
      "ord_in_thread": 0,
      "author": "Anonymous (noreply@blogger.com)",
      "published": "2016-11-30T05:08:58.263+02:00",
      "title": "I am not a big fan of Verizon, but this is a good ...",
      "text": "I am not a big fan of Verizon, but this is a good deal.",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [],
        "organizations": [
          {
            "name": "verizon",
            "sentiment": "positive"
          }
        ],
        "locations": []
      },
      "crawled": "2016-11-30T05:08:58.263+02:00"
    },
    {
      "thread": {
        "uuid": "cb936288c97d0d6477ca0940cac493424295eba6",
        "url": "http://omgili.com/ri/jHIAmI4hxg_ZZEJxw_HVLIVMnaJd1bQMlnaaNDSg36OZw3qbPZovHEc3jG7horu0WFXJhu8do9XdQoNn0fNb4GjjXISVznOIrqvIPkoR3UwqLueOIW5oh9F_oiTGFZFBIDhDB4strR56GYtRsA3XkryQSMxwZgpSQu7ZvhZJmuU-",
        "site_full": "www.prnewswire.com",
        "site": "prnewswire.com",
        "site_section": "http://rss.prnewswire.com/geography/AK/",
        "site_categories": [
          "education",
          "business"
        ],
        "section_title": "PR Newswire:",
        "title": "Verizon unveils the GizmoTab -- the ultimate learning experience for kids",
        "title_full": "Verizon unveils the GizmoTab -- the ultimate learning experience for kids",
        "published": "2016-12-01T15:00:00.000+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "news",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "https://photos.prnewswire.com/prnvar/20160527/373129LOGO",
        "performance_score": 0,
        "domain_rank": 3190,
        "social": {
          "facebook": {
            "likes": 0,
            "comments": 0,
            "shares": 0
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 1
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "cb936288c97d0d6477ca0940cac493424295eba6",
      "url": "http://omgili.com/ri/jHIAmI4hxg_ZZEJxw_HVLIVMnaJd1bQMlnaaNDSg36OZw3qbPZovHEc3jG7horu0WFXJhu8do9XdQoNn0fNb4GjjXISVznOIrqvIPkoR3UwqLueOIW5oh9F_oiTGFZFBIDhDB4strR56GYtRsA3XkryQSMxwZgpSQu7ZvhZJmuU-",
      "ord_in_thread": 0,
      "author": "Verizon",
      "published": "2016-12-01T15:00:00.000+02:00",
      "title": "Verizon unveils the GizmoTab -- the ultimate learning experience for kids",
      "text": "NEW YORK , Dec. 1,   Verizon is making kids' education more fun and exciting with the December 1 launch of GizmoTab , an exclusive, next-gen kid's tablet designed to jumpstart your child's learning experience right out of the box. Even better, activate your GizmoTab on the nation's most reliable 4G LTE network and receive unlimited access to 300 premium learning apps handpicked by educational experts, featuring recognizable brands and characters that children love, including: Crayola, DreamWorks Animation, Hasbro, The Jim Henson Company, Highlights for Children, HiT Entertainment, National Geographic, Sesame Workshop, Toca Boca and more — at no additional charge. That's a $600 value to get your kids learning as soon as they turn on GizmoTab.\n\"With the addition of the GizmoTab, Verizon has created a portfolio of family products that parents can trust and their children will enjoy for years to come,\" said Jeffrey Dietel , vice president, wireless devices, Verizon. \"Since the launch of the Verizon Gizmo product line, we spent a lot of time listening to what our customers wanted in a kid's tablet. Parents told us that they wanted trusted and relevant content that would engage their children and the ability to add their own content. The GizmoTab meets both of those needs. We've created a great tablet kids and parents will love.\"\nFun for kids; parent approved\nThe GizmoTab learning experience is built around a comprehensive content service designed specifically for kids ages 3–8. What's more, all of the apps are based on key subject areas, including English language arts, math, science, critical thinking and creativity. \nWith the GizmoTab, you can measure and display aspects of your child's progress, tailor the fun to your child's age and skill level, set time limits and reward your child with additional play time. You can download your favorite children's apps from the Google Play store and add them to your child's experience with GizmoTab. The content catalog will be updated monthly so that there's always something new for your kids to play and learn.  \nBuilt kid tough for the whole family\nUnder the hood, GizmoTab is a full-featured tablet with a powerful processor, expandable memory and adult-size version of Android OS, so your child can get more use out of it even after outgrowing the software. In fact, with its 8\" HD display, the whole family can stream movies, surf the web, game and more.\nGizmoTab comes with a removable bumper to protect against even the toughest drops, bumps and scratches. And with 5,100mAh battery and Verizon 4G LTE connectivity, you can rest assured that your child will be entertained on those long road trips.\nAdditional specs:\nQualcomm® Snapdragon™ 617 Octa Core processor Android Marshmallow OS RAM: 3GB; Flash:16GB memory; upgradeable to 128GB with microSD card (sold separately) 8MP rear camera; 5MP front camera 1080p video recording Pricing and availability\nGizmoTab is available from Verizon online and in stores Dec.1. You can purchase yours for $79.99 with new two-year activation. A standard data plan is required to access the free 300 premium learning apps. For a limited time, buy a GizmoTab and receive a gift card to one of the following: Toys R Us, Barnes & Noble, or The Gap. Add a GizmoPal 2 or a GizmoGadget and receive a $100 gift card. Additional colored bumpers and kickstands will be available to personalize your GizmoTab with your child's favorite colors. For more information about the GizmoTab visit https://www.verizonwireless.com/tablets/gizmotab/ \nVerizon Communications Inc. (NYSE, Nasdaq: VZ ), headquartered in New York City , has a diverse workforce of 162,000 and generated nearly $132 billion in 2015 revenues. Verizon operates America's most reliable wireless network, with 113.7 million retail connections nationwide. The company also provides communications and entertainment services over mobile broadband and the nation's premier all-fiber network, and delivers integrated business solutions to customers worldwide.\nVERIZON'S ONLINE NEWS CENTER: News releases, feature stories, executive biographies and media contacts are available at Verizon's online News Center at www.verizon.com/news /. News releases are also available through an RSS feed. To subscribe, visit www.verizon.com/about/rss-feeds/ . \nMedia contact: \nGeorge Koroneos \n908.559.3545\ngeorge.koroneos@verizon.com  \nTwitter: @glkcreative\nLogo - http://photos.prnewswire.com/prnh/20160527/373129LOGO  \nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/verizon-unveils-the-gizmotab--the-ultimate-learning-experience-for-kids-300371202.html \nSOURCE Verizon\nRelated Links \nhttp://www.verizon.com",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [
          {
            "name": "george koroneos",
            "sentiment": "none"
          },
          {
            "name": "gizmotab",
            "sentiment": "none"
          },
          {
            "name": "jeffrey dietel",
            "sentiment": "none"
          },
          {
            "name": "toca boca",
            "sentiment": "none"
          }
        ],
        "organizations": [
          {
            "name": "verizon",
            "sentiment": "positive"
          },
          {
            "name": "sesame workshop",
            "sentiment": "none"
          },
          {
            "name": "verizon communications inc.",
            "sentiment": "none"
          },
          {
            "name": "the jim henson company",
            "sentiment": "none"
          },
          {
            "name": "gizmotab",
            "sentiment": "none"
          },
          {
            "name": "hasbro",
            "sentiment": "none"
          },
          {
            "name": "dreamworks animation",
            "sentiment": "none"
          },
          {
            "name": "national geographic",
            "sentiment": "none"
          },
          {
            "name": "barnes & noble",
            "sentiment": "none"
          },
          {
            "name": "nyse",
            "sentiment": "none"
          },
          {
            "name": "google",
            "sentiment": "none"
          },
          {
            "name": "octa core",
            "sentiment": "none"
          },
          {
            "name": "verizon gizmo",
            "sentiment": "none"
          },
          {
            "name": "qualcomm",
            "sentiment": "none"
          }
        ],
        "locations": [
          {
            "name": "new york city",
            "sentiment": "none"
          },
          {
            "name": "america",
            "sentiment": "none"
          }
        ]
      },
      "crawled": "2016-12-01T15:14:29.305+02:00"
    },
    {
      "thread": {
        "uuid": "75bab45152c37f20fd235475904b8e9e2db24114",
        "url": "http://omgili.com/ri/8HG_hanVOKw042PJks0n5Co9Eavq_tDT.vDhYtHKKlwTlKL90LamaDkh880H_moscoqz1EkFiM34oOFeA54Pvw--",
        "site_full": "phandroid.com",
        "site": "phandroid.com",
        "site_section": "http://feeds2.feedburner.com/AndroidPhoneFans",
        "site_categories": [
          "tech"
        ],
        "section_title": "Phandroid",
        "title": "Verizon introduces the perfect tablet for kids this holiday season",
        "title_full": "Verizon introduces the perfect tablet for kids this holiday season",
        "published": "2016-12-02T18:17:59.940+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "news",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "http://phandroid.s3.amazonaws.com/wp-content/uploads/2016/12/gizmotab-1-640x246.png",
        "performance_score": 0,
        "domain_rank": 14390,
        "social": {
          "facebook": {
            "likes": 6,
            "comments": 0,
            "shares": 6
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "75bab45152c37f20fd235475904b8e9e2db24114",
      "url": "http://omgili.com/ri/8HG_hanVOKw042PJks0n5Co9Eavq_tDT.vDhYtHKKlwTlKL90LamaDkh880H_moscoqz1EkFiM34oOFeA54Pvw--",
      "ord_in_thread": 0,
      "author": "Quentyn Kennemer",
      "published": "2016-12-02T18:17:59.940+02:00",
      "title": "Verizon introduces the perfect tablet for kids this holiday season",
      "text": "Quentyn Kennemer Dec 2nd, 2016 \nVerizon has a new tablet that may be a nice gift to stick under the tree for your kids. The GizmoTab is what it’s being called. As you’d expect, this thing isn’t extraordinary, especially at a price tag of $10.41 per month for 24 months (or $249.99 full retail, and for a limited time, buying one also gets you a $100 gift card for other goodies). \nBut it’s durable, it’s playful, it’s fun, and it’s educational. Kids get games and learning apps, and parents can set up extensive parental controls that lets you control the apps that they have access to, how much time they have to learn and play, and more. And if you have multiple children, you can have separate profiles for each child. \nAs for functional specs, you’re looking at a Snapdragon 617 chipset, an 8-inch 1920 x 1200 TFT LCD display, 5,100mAh battery for up to 14.5 hours of typical battery life, 16GB of storage, a microSD slot, and an LTE chip for those who need it to stay connected when away from home. You can grab it in Midnight Blue from Verizon right here .",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [
          {
            "name": "quentyn kennemer",
            "sentiment": "positive"
          }
        ],
        "organizations": [
          {
            "name": "verizon",
            "sentiment": "positive"
          }
        ],
        "locations": []
      },
      "crawled": "2016-12-02T18:17:59.940+02:00"
    },
    {
      "thread": {
        "uuid": "a54340d8f76ad3cd2b8bd539e5ebccb2d668bb53",
        "url": "http://omgili.com/ri/rPCDLkAl21SID51pEzmpmOFjqJw.6lh0sk6nE5.EDta2sXIcCEzAoxniblhAi218ZkyyoJEVinePAMszLf91CeOo8JNTtmMgCBz0bjkCjRl3k3nusL.WHmlrlmVJGBxT",
        "site_full": "androidandme.com",
        "site": "androidandme.com",
        "site_section": "http://www.androidandme.com/feed",
        "site_categories": [
          "news",
          "tech"
        ],
        "section_title": "Android and Me",
        "title": "Verizon’s GizmoTab is a kids’ tablet with an 8-inch screen",
        "title_full": "Verizon’s GizmoTab is a kids’ tablet with an 8-inch screen",
        "published": "2016-12-02T22:41:45.199+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "blogs",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "http://androidandme.com/wp-content/uploads/2016/12/verizongizmotabtitle-1.jpg",
        "performance_score": 0,
        "domain_rank": 36337,
        "social": {
          "facebook": {
            "likes": 0,
            "comments": 0,
            "shares": 0
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "a54340d8f76ad3cd2b8bd539e5ebccb2d668bb53",
      "url": "http://omgili.com/ri/rPCDLkAl21SID51pEzmpmOFjqJw.6lh0sk6nE5.EDta2sXIcCEzAoxniblhAi218ZkyyoJEVinePAMszLf91CeOo8JNTtmMgCBz0bjkCjRl3k3nusL.WHmlrlmVJGBxT",
      "ord_in_thread": 0,
      "author": "Evan Selleck",
      "published": "2016-12-02T22:41:45.199+02:00",
      "title": "Verizon’s GizmoTab is a kids’ tablet with an 8-inch screen",
      "text": "Tweet \nVerizon has launched a brand new Anroid tablet with a focus on providing an ideal experience for kids. \nIt’s called the GizmoTab, and it’s available from both Verizon’s online store and as well as its physical stores. It retails for $249.99, but customers can pick one up for $79.99 with a two-year agreement, or $0 down followed by $10.41 per month for 24 months. \nBuyers will get an 8-inch display with a resolution of 1920×1200, an octa-core Qualcomm Snapdragon 617 processor, and 3GB of RAM. There’s 16GB of built-in storage and a microSD card slot, and GizmoTab’s battery is measured in at 5100mAh. The GizmoTab also features an 8MP camera on the back and a 5MP front-facing camera. It’s running Android 6.0.1 out of the box. \nThe tablet features up to 300 premium educational apps, and there’s also a “Parent Dashboard” which will allow parents to monitor their kids’ usage with the tablet, see progress in some apps, and even choose which apps are available to be used at all. The dashboard will also allow parents to control passwords and accounts. \nVerizon is including a special deal for GizmoTab buyers, giving them a free Toys R Us, Barnes & Noble, or The Gap gift card with purchase. Families that buy the GizmoTab and also buy the GizmoGadget or GizmoPal 2 will earn a $100 gift card. Evan is a pretty big fan of technology, from phones to video game consoles and everything in between. Tagged",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [
          {
            "name": "gizmotab",
            "sentiment": "none"
          },
          {
            "name": "evan",
            "sentiment": "none"
          }
        ],
        "organizations": [
          {
            "name": "verizon",
            "sentiment": "positive"
          },
          {
            "name": "gizmotab",
            "sentiment": "positive"
          },
          {
            "name": "tweet  verizon",
            "sentiment": "neutral"
          },
          {
            "name": "barnes & noble",
            "sentiment": "none"
          },
          {
            "name": "gizmopal",
            "sentiment": "none"
          }
        ],
        "locations": []
      },
      "crawled": "2016-12-02T22:41:45.199+02:00"
    },
    {
      "thread": {
        "uuid": "56a85ac98624f9bb43c36e7b0dbd7611285e319f",
        "url": "http://omgili.com/ri/.wHSUbtEfZQPbtVHNHUoApJGcLKmL_7F7ZnMKQOMsmA2RArwFBz4U1y41YyYhOvu",
        "site_full": "www.cnet.com",
        "site": "cnet.com",
        "site_section": "",
        "site_categories": [
          "news"
        ],
        "section_title": "",
        "title": "Verizon GizmoTab is a kids' tablet with a twist on the home screen - Video - CNET",
        "title_full": "Verizon GizmoTab is a kids' tablet with a twist on the home screen - Video - CNET",
        "published": "2016-11-30T07:00:00.000+02:00",
        "replies_count": 0,
        "participants_count": 0,
        "site_type": "news",
        "country": "US",
        "spam_score": 0.001,
        "main_image": "https://cnet4.cbsistatic.com/img/Zi6qUtpg13UtMSJ2dggb85pOaQg=/2016/11/30/c2081f0f-3216-471d-8e07-8381bab41328/flverizongizmotab.jpg",
        "performance_score": 0,
        "domain_rank": 164,
        "social": {
          "facebook": {
            "likes": 1,
            "comments": 0,
            "shares": 1
          },
          "gplus": {
            "shares": 1
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 1
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "56a85ac98624f9bb43c36e7b0dbd7611285e319f",
      "url": "http://omgili.com/ri/.wHSUbtEfZQPbtVHNHUoApJGcLKmL_7F7ZnMKQOMsmA2RArwFBz4U1y41YyYhOvu",
      "ord_in_thread": 0,
      "author": "Alfred Ng",
      "published": "2016-11-30T07:00:00.000+02:00",
      "title": "Verizon GizmoTab is a kids' tablet with a twist on the home screen - Video - CNET",
      "text": "Verizon GizmoTab is a kids' tablet with a twist on the home screen The GizmoTab is what a tablet would be like if everything was turned into a game. by Alfred Ng Your video, \"Verizon GizmoTab is a kids' tablet with a twist on the home screen\"will start after this message from our sponsors. Loading video... Verizon GizmoTab is a kids' tablet with a twist on the home screen: First Look About Video First Look: Verizon GizmoTab is a kids' tablet with a twist on the home screen 0:59 / November 30, 2016 \nThe GizmoTab is what a tablet would be like if everything was turned into a game. Share (0) linkedin Transcript [MUSIC] At first glance, it looks like a game. But this is actually the home screen of a kid's tablet. Instead of rows of app icons, Verizon's Gizmo Tab has kids navigate applications by putting them in different themed islands. This Android tablet takes a fresh approach to creating a kid friendly interface for children with a home screen that has a feel of a Sims world. The map shows eight different islands, each with a different theme for its app. Head to the school for educational games and books or warp on over to the arcade to play games. The tablet comes preloaded with more than 300 kids' apps ready to go for your children to use, all of which were approved by parenting and teaching experts. Parents can also adjust the settings. So that your kids have to learn to earn play time. And limit how long each child can use the tablet. And here's a quick tip for parents. When you're kids aren't using the gizmo tab. You can actually revert it back to a fully functional Android tablet. It's also pretty useful for when your tyke outgrows the Kiddie apps. And you wanna take off the tablet training wheels. A premium Android tablet that gives the Apple iPad... 1:16 October 23, 2016 The sleek, aluminum-clad Huawei Media Pad M3 packs Harman Kardon speakers and a fingerprint... Play video The Lenovo Yoga Book is a slim hybrid for sketch artists 2:20 October 17, 2016 Available in Windows and Android versions, the Yoga Book is great at pen input, but its... Play video Amazon's new, improved Fire HD 8 tablet is a bona fide... 2:08 September 28, 2016 Big price chop and a bump up in storage capacity, RAM and battery life, make the zippier... Play video Lenovo's Tab 3 Plus packs a built-in stand 1:12 September 2, 2016 Lenovo's newest tablet ditches the built-in projector from last time, but keeps the kickstand. Play video Huawei MediaPad M3 is a stunning 8.4-inch tablet with... 2:09 September 1, 2016 The M3 runs Android version 6.0 Marshmallow and features an 8.4-inch, 2,560x1,600-pixel... Play video The new Monster app from Osmo turns a whiteboard and... 1:29 July 28, 2016 The Osmo Creative Set for iPad includes a drawing board and markers, and works with the... Play video Asus ZenPad Z8 is the affordable and portable Verizon... 1:14 July 15, 2016 The slim 8-inch tablet costs $250 without a contract, $200 with a two-year contract or... Play video Huawei Matebook wins the west with fast fingerprint... 1:35 June 28, 2016 It looks like an iPad, it feels like an iPad, but the Matebook runs the full Windows 10... Play video How to choose your next iPad 2:18 April 12, 2016 There are at least 5 models of the iPad you can buy right now. Which one is best for you?... Play video The Samsung Galaxy TabPro S offers more for less 1:21 March 29, 2016 By including a keyboard cover and an AMOLED display, the TabPro S is the best overall... Play video ",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [
          {
            "name": "alfred ng your",
            "sentiment": "none"
          },
          {
            "name": "matebook",
            "sentiment": "none"
          },
          {
            "name": "osmo",
            "sentiment": "none"
          },
          {
            "name": "harman kardon",
            "sentiment": "none"
          }
        ],
        "organizations": [
          {
            "name": "verizon",
            "sentiment": "positive"
          },
          {
            "name": "cnet verizon",
            "sentiment": "positive"
          },
          {
            "name": "huawei",
            "sentiment": "none"
          },
          {
            "name": "verizon gizmotab",
            "sentiment": "none"
          },
          {
            "name": "samsung galaxy",
            "sentiment": "none"
          },
          {
            "name": "huawei matebook",
            "sentiment": "none"
          },
          {
            "name": "lenovo",
            "sentiment": "none"
          },
          {
            "name": "huawei media pad m3",
            "sentiment": "none"
          },
          {
            "name": "amazon",
            "sentiment": "none"
          }
        ],
        "locations": []
      },
      "crawled": "2016-12-03T09:34:52.320+02:00"
    },
    {
      "thread": {
        "uuid": "4c4dfeb857c85dcea56aaf3c594548830052ee88",
        "url": "http://omgili.com/ri/.wHSUbtEfZTFWr9cniL_6v4AJrjFIxLiknnOmT.TRQhn0qsfutFcEMxW0wkG32uTDM7F.QWIx76z13MaQLtkSJB8sH_r7U6sEJufHGEuCJcwEckeLw3QT7dkjxzhbMlOx2KZKu.QCApyPTe9zcPvLR_yNF48Un_W1psu3nP8eBnpySlIrzc8Skj5nOZIpoF.hb_1frZfxVGXVvNSs0q467oD6isCckl0IQBtPsx1T6PAJsfPeKFwxFAYPurJSz22qorX7EYw5qaXzWqgiEq9iL5sxMVu.cctjXgMXjQ6fWpmpHifTwPIXUUj6e3SYGRGQ8MX7vo443k7vBK5bI7HSg2AUkAFHc3m9nNkpxU53tsCr5I3dtk7TQ--",
        "site_full": "wiki.openstack.org",
        "site": "openstack.org",
        "site_section": "https://wiki.openstack.org/w/index.php?title=Special:RecentChanges&feed=atom",
        "site_categories": [],
        "section_title": "OpenStack  - Recent changes [en]",
        "title": "USA best 1-888-269-0130 Verizon email $$$!!!Verizon email@0@ technical support phone number Tech support Customer service support number helpline helpdesk phone number usa Verizon email Customer Care number$$!!!",
        "title_full": "USA best 1-888-269-0130 Verizon email $$$!!!Verizon email@0@ technical support phone number Tech support Customer service support number helpline helpdesk phone number usa Verizon email Customer Care number$$!!!",
        "published": "2016-12-03T12:15:42.664+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "blogs",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "",
        "performance_score": 0,
        "domain_rank": 14365,
        "social": {
          "facebook": {
            "likes": 0,
            "comments": 0,
            "shares": 0
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "4c4dfeb857c85dcea56aaf3c594548830052ee88",
      "url": "http://omgili.com/ri/.wHSUbtEfZTFWr9cniL_6v4AJrjFIxLiknnOmT.TRQhn0qsfutFcEMxW0wkG32uTDM7F.QWIx76z13MaQLtkSJB8sH_r7U6sEJufHGEuCJcwEckeLw3QT7dkjxzhbMlOx2KZKu.QCApyPTe9zcPvLR_yNF48Un_W1psu3nP8eBnpySlIrzc8Skj5nOZIpoF.hb_1frZfxVGXVvNSs0q467oD6isCckl0IQBtPsx1T6PAJsfPeKFwxFAYPurJSz22qorX7EYw5qaXzWqgiEq9iL5sxMVu.cctjXgMXjQ6fWpmpHifTwPIXUUj6e3SYGRGQ8MX7vo443k7vBK5bI7HSg2AUkAFHc3m9nNkpxU53tsCr5I3dtk7TQ--",
      "ord_in_thread": 0,
      "author": "Piyushdubey143",
      "published": "2016-12-03T12:15:42.664+02:00",
      "title": "USA best 1-888-269-0130 Verizon email $$$!!!Verizon email@0@ technical support phone number Tech support Customer service support number helpline helpdesk phone number usa Verizon email Customer Care number$$!!!",
      "text": "(Created page with \"Verizon email Tech Support Number Verizon email Customer Care Phone number Verizon email Helpline phone Number Verizon email toll free phone number Verizon email Password Reco...\") (No difference)   09:55, 3 December 2016 \nVerizon email Tech Support Number Verizon email Customer Care Phone number Verizon email Helpline phone Number Verizon email toll free phone number Verizon email Password Recovery Number Verizon email Help Desk Phone Number Verizon email Help Desk Number Verizon email Password Recovery Phone Number Verizon email toll free number Verizon email Technical Support Phone Number Verizon email Customer Care Number Verizon email Helpline Number Verizon email Customer Support Phone Number Verizon email Support Phone Number Verizon email Phone number Verizon email Customer Service Number Verizon email Technical Support Number Verizon email Customer Care \nVerizon email help desk phone number in usa \nVerizon email tech   free in usaVerizon email Tech Support Number Verizon email Customer Care Phone number Verizon email Helpline phone Number Verizon email toll free phone number Verizon email Password Recovery Number Verizon email Help Desk Phone Number Verizon email Help Desk Number Verizon email Password Recovery Phone Number Verizon email toll free number Verizon email Technical Support Phone Number Verizon email Customer Care Number Verizon email Helpline Number Verizon email Customer Support Phone Number Verizon email Support Phone Number Verizon email Phone number Verizon email Customer Service Number Verizon email Technical Support Number Verizon email Customer Care \nVerizon email help desk phone number in usa \nVerizon email tech   free in usaVerizon email Tech Support Number Verizon email Customer Care Phone number Verizon email Helpline phone Number Verizon email toll free phone number Verizon email Password Recovery Number Verizon email Help Desk Phone Number Verizon email Help Desk Number Verizon email Password Recovery Phone Number Verizon email toll free number Verizon email Technical Support Phone Number Verizon email Customer Care Number Verizon email Helpline Number Verizon email Customer Support Phone Number Verizon email Support Phone Number Verizon email Phone number Verizon email Customer Service Number Verizon email Technical Support Number Verizon email Customer Care \nUSA best 1-888-269-0130 Verizon email $$$!!!Verizon email@0@ technical   Tech support Customer service support number helpline helpdesk phone number usa Verizon email Customer Care number$$!!! \nVerizon email tech support number 1-888-269-0130 Verizon email tech support Verizon email Customer service number Verizon email   usa Verizon email Customer Care number or Phone for Service,Verizon email Customer Care number 1-888-269-0130 Verizon email tech support number,Verizon email  ,Verizon email Customer Service Number usa Verizon email customer care number,Verizon email help desk number, Verizon email   usa Verizon email Customer Support Phone Number, Verizon email Customer Support Number, Verizon email Customer Service Helpline Number, Verizon email Customer Care Number, Verizon email support team phone number, Verizon email help number-Verizon email Helpline Number; Verizon email help phone number, Verizon email Helpline Number, Verizon email Tech Support Toll free Number, Verizon email Support Telephone Number, Verizon email Tech Support Telephone number, Verizon email Tech Support contact number, Verizon email support contact number, Verizon email technical support contact number, Verizon email games  , Verizon email password recovery  . Verizon email password recovery customer   1-888-269-0130 Verizon email technical help telephone number, Verizon email technical help contact number, Verizon email technical support contact number, Verizon email contact number, Verizon email contact phone number, Verizon email contact telephone number, Verizon email 24 hour contact number, Verizon email customer support contact number, Verizon email customer service contact number, Verizon email official number, Verizon email official contact number, Verizon email 269 contact number, Verizon email toll free number, 269 number for Verizon email support, Verizon email 24/7   Verizon email GAMES  ,Verizon email GAMES  ,Verizon email GAMES help phone number, Verizon email GAMES technical support number.Verizon email GAMES support number, Verizon email GAMES phone number, Verizon email GAMES tech support number, Verizon email GAMES customer support number, Verizon email GAMES customer  , Verizon email GAMES customer service phone number, Verizon email GAMES password recovery customer service phone number, Verizon email GAMES  . Help@Call 1-888-269-0130/.Verizon email 24/7  ,Verizon email telephone number for support? call 1-888-269-0130@./Verizon email contact number, Verizon email contact phone number, Verizon email contact telephone number,,telephone number for Verizon email online support,Verizon email official support number,Verizon email official number,Verizon email password recovery official phone number,,,phone number for Verizon email password recovery support,,Verizon email 24/7  ,,Verizon email support number,Verizon email telephone number for support Talk:TollFree,California 1-888-269-0130 USaA Verizon email password recovery technical  ,1-888-269-0130 Intuit Verizon email customer service Phone Number Call,Av..1-888-269-0130.. Verizon email  , Verizon email customer service phone number 1-888-269-0130 FREE FREE FREE FREE FREE for all type help by Verizon email .s Games tech  , Intuit Verizon email .s Games Tech Support Phone Number, Verizon email .s Games Help Desk Phone Number, Verizon email .s Games tech support number, Verizon email .s Games technical  ,@@@ Verizon email .s Games phone number, Verizon email .s Games technical support number, Verizon email .s Games  , Verizon email .s Games technical support, Verizon email .s Games Customer Service Phone Number, Verizon email .s Games Customer Service Number, Verizon email .s Games Customer Support Phone Number, Verizon email .s Games Customer Support Number,@@@@ Verizon email .s Games Customer Service Helpline Number, Verizon email .s Games Customer Care Number, Verizon email .s Games support team phone number Talk:TollFree,California 1-888-269-0130 USA Verizon email password recovery technical  ,1-888-269-0130 Intuit Verizon email customer service Phone Number TollFree,California 1-888-269-0130 USA Verizon email password recovery technical  ,1-888-269-0130 Intuit Verizon email customer service Phone Number Verizon email .s Games help number-Verizon email .s Games Helpline Number; Verizon email .s Games help phone number-Verizon email .s Games Helpline Number, Verizon email .s Games Tech Support Toll free Number, Verizon email .s Games Support Telephone Number, Verizon email .s Games Tech Support Telephone number, Verizon email .s Games Tech Support contact number, Verizon email .s Games support contact number, Verizon email .s Games technical support contact number. Call, QuickCallSend SMSCall from mobileAdd to Skype You'll need Skype CreditFree via Skype Helpline Number.. 1-888-269-0130.. Verizon email tech  , Verizon email customer service phone number Call,QB customer..1-888-269-0130.. Verizon email  , Verizon email customer service phone number Call,..1-888-269-0130 Verizon email technical  .Verizon email phone number Verizon email Toll Free, Intuit@1-888-269-0130@-: Verizon email Tech Support Phone Number gamesvides online solution for all USA/CANADA clients. For any help of query call 1-888-269-0130 to get all Verizon email account solution. @@Call, 1-888-269-0130 for all type help by Verizon email tech  , Intuit Verizon email Tech Support Phone Number, Verizon email Help Desk Phone Number, Verizon email tech support number, Verizon email technical  ,@@@ Verizon email phone number, Verizon email technical support number, Verizon email  , Verizon email technical support, Verizon email Customer Service Phone Number, Verizon email Customer Service Number, Verizon email Customer Support Phone Number, Verizon email Customer Support Number,@@@@ Verizon email Customer Service Helpline Number, Verizon email Customer Care Number, Verizon email support team phone number, Verizon email help number-Verizon email Helpline Number; Verizon email help phone number-Verizon email Helpline Number, Verizon email Tech Support Toll free Number, Verizon email Support Telephone Number, Verizon email Tech Support Telephone number, Verizon email Tech Support contact number, Verizon email support contact number, Verizon email technical support contact number. Call, Verizon email tech  , Intuit Verizon email Tech Support Phone Number, Verizon email Help Desk Phone Number, Verizon email tech support number, Verizon email technical  , Verizon email phone number, Verizon email technical support number, Verizon email  . It is very popular toll free number which gamesvide by Verizon email technical support, Verizon email Customer Service Phone Number, Verizon email Customer Service Number, Verizon email Customer Support Phone Number, Verizon email Customer Support Number, Verizon email Customer Service Helpline Number, Verizon email Customer Care Number, Verizon email support team phone number. Call, Verizon email tech  , Intuit Verizon email Tech Support Phone Number, Verizon email Help Desk Phone Number, Verizon email tech support number, Verizon email technical  , Verizon email phone number, Verizon email technical support number, Verizon email  , Verizon email technical support, Verizon email Customer Service Phone Number, Verizon email Customer Service Number, Verizon email Customer Support Phone Number, Verizon email Customer Support Number, Verizon email Customer Service Helpline Number, Verizon email Customer Care Number, Verizon email support team phone number, Verizon email help number-Verizon email Helpline Number; Verizon email help phone number, Verizon email Helpline Number, Verizon email Tech Support Toll free Number, Verizon email Support Telephone Number, Verizon email Tech Support Telephone number, Verizon email Tech Support contact number, Verizon email support contact number, Verizon email technical support contact number, Verizon email games  , Verizon email password recovery  . Verizon email password recovery customer   1-888-269-0130 Verizon email technical help telephone number, Verizon email technical help contact number, Verizon email technical support contact number, Verizon email contact number, Verizon email contact phone number, Verizon email contact telephone number, Verizon email 24 hour contact number, Verizon email customer support contact number, Verizon email customer service contact number, Verizon email official number, Verizon email official contact number, Verizon email 269 contact number, Verizon email toll free number, 269 number for Verizon email support, Verizon email 24/7   Verizon email GAMES  ,Verizon email GAMES  ,Verizon email GAMES help phone number, Verizon email GAMES technical support number.Verizon email GAMES support number, Verizon email GAMES phone number, Verizon email GAMES tech support number, Verizon email GAMES customer support number, Verizon email GAMES customer  , Verizon email GAMES customer service phone number, Verizon email GAMES password recovery customer service phone number, Verizon email GAMES  . Help@Call 1-888-269-0130/.Verizon email 24/7  ,Verizon email telephone number for support? call 1-888-269-0130@./Verizon email contact number, Verizon email contact phone number, Verizon email contact telephone number,,telephone number for Verizon email online support,Verizon email official support number,Verizon email official number,Verizon email password recovery official phone number,,,phone number for Verizon email password recovery support,,Verizon email 24*7 HOURS SERVICE AVAILABLE  ,,Verizon email support number,Verizon email telephone number for support QB SUPPORT ON 1-888-269-0130 Verizon email PHONE NUMBER AND Verizon email SUPPORT PHONE like this0QuoteVerizon email tech support number 1-888-269-0130 Verizon email Customer service number Verizon email   usa Verizon email Customer Care number or Phone for Service,Verizon email Customer Care number 1-888-269-0130 Verizon email tech support number,Verizon email  ,Verizon email Customer Service Number usa Verizon email customer care number,Verizon email help desk number, Verizon email   usa Verizon email Customer Support Phone Number, Verizon email Customer Support Number, Verizon email Customer Service Helpline Number, Verizon email Customer Care Number, Verizon email support team phone number, Verizon email help number-Verizon email Helpline Number; Verizon email help phone number, Verizon email Helpline Number, Verizon email Tech Support Toll free Number, Verizon email Support Telephone Number, Verizon email Tech Support Telephone number, Verizon email Tech Support contact number, Verizon email support contact number, Verizon email technical support contact number, Verizon email games  , Verizon email password recovery  . Verizon email password recovery customer   1-888-269-0130 Verizon email technical help telephone number, Verizon email technical help contact number, Verizon email technical support contact number, Verizon email contact number, Verizon email contact phone number, Verizon email contact telephone number, Verizon email 24 hour contact number, Verizon email customer support contact number, Verizon email customer service contact number, Verizon email official number, Verizon email official contact number, Verizon email 269 contact number, Verizon email toll free number, 269 number for Verizon email support, Verizon email 24/7   Verizon email GAMES  ,Verizon email GAMES  ,Verizon email GAMES help phone number, Verizon email GAMES technical support number.Verizon email GAMES support number, Verizon email GAMES phone number, Verizon email GAMES tech support number, Verizon email GAMES customer support number, Verizon email GAMES customer  , Verizon email GAMES customer service phone number, Verizon email GAMES password recovery customer service phone number, Verizon email GAMES  . Help@Call 1-888-269-0130/.Verizon email 24/7  ,Verizon email telephone number for support? call 1-888-269-0130@./Verizon email contact number, Verizon email contact phone number, Verizon email contact telephone number,,telephone number for Verizon email online support,Verizon email official support number,Verizon email official number,Verizon email password recovery official phone number,,,phone number for Verizon email password recovery support,,Verizon email 24/7  ,,Verizon email support number,Verizon email telephone number for support Talk:TollFree,California 1-888-269-0130 USaA Verizon email password recovery technical  ,1-888-269-0130 Intuit Verizon email customer service Phone Number Call,Av..1-888-269-0130.. Verizon email  , Verizon email customer service phone number 1-888-269-0130 FREE FREE FREE FREE FREE for all type help by Verizon email .s Games tech  , Intuit Verizon email .s Games Tech Support Phone Number, Verizon email .s Games Help Desk Phone Number, Verizon email .s Games tech support number, Verizon email .s Games technical  ,@@@ Verizon email .s Games phone number, Verizon email .s Games technical support number, Verizon email .s Games  , Verizon email .s Games technical support, Verizon email .s Games Customer Service Phone Number, Verizon email .s Games Customer Service Number, Verizon email .s Games Customer Support Phone Number, Verizon email .s Games Customer Support Number,@@@@ Verizon email .s Games Customer Service Helpline Number, Verizon email .s Games Customer Care Number, Verizon email .s Games support team phone number Talk:TollFree,California 1-888-269-0130 USA Verizon email password recovery technical  ,1-888-269-0130 Intuit Verizon email customer service Phone Number TollFree,California 1-888-269-0130 USA Verizon email password recovery technical  ,1-888-269-0130 Intuit Verizon email customer service Phone Number Verizon email .s Games help number-Verizon email .s Games Helpline Number; Verizon email .s Games help phone number-Verizon email .s Games Helpline Number, Verizon email .s Games Tech Support Toll free Number, Verizon email .s Games Support Telephone Number, Verizon email .s Games Tech Support Telephone number, Verizon email .s Games Tech Support contact number, Verizon email .s Games support contact number, Verizon email .s Games technical support contact number. Call, QuickCallSend SMSCall from mobileAdd to Skype You'll need Skype CreditFree via Skype Helpline Number.. 1-888-269-0130.. Verizon email tech  , Verizon email customer service phone number Call,QB customer..1-888-269-0130.. Verizon email  , Verizon email customer service phone number Call,..1-888-269-0130 Verizon email technical  .Verizon email phone number Verizon email Toll Free, Intuit@1-888-269-0130@-: Verizon email Tech Support Phone Number gamesvides online solution for all USA/CANADA clients. For any help of query call 1-888-269-0130 to get all Verizon email account solution. @@Call, 1-888-269-0130 for all type help by Verizon email tech  , Intuit Verizon email Tech Support Phone Number, Verizon email Help Desk Phone Number, Verizon email tech support number, Verizon email technical  ,@@@ Verizon email phone number, Verizon email technical support number, Verizon email  , Verizon email technical support, Verizon email Customer Service Phone Number, Verizon email Customer Service Number, Verizon email Customer Support Phone Number, Verizon email Customer Support Number,@@@@ Verizon email Customer Service Helpline Number, Verizon email Customer Care Number, Verizon email support team phone number, Verizon email help number-Verizon email Helpline Number; Verizon email help phone number-Verizon email Helpline Number, Verizon email Tech Support Toll free Number, Verizon email Support Telephone Number, Verizon email Tech Support Telephone number, Verizon email Tech Support contact number, Verizon email support contact number, Verizon email technical support contact number. Call, Verizon email tech  , Intuit Verizon email Tech Support Phone Number, Verizon email Help Desk Phone Number, Verizon email tech support number, Verizon email technical  , Verizon email phone number, Verizon email technical support number, Verizon email  . It is very popular toll free number which gamesvide by Verizon email technical support, Verizon email Customer Service Phone Number, Verizon email Customer Service Number, Verizon email Customer Support Phone Number, Verizon email Customer Support Number, Verizon email Customer Service Helpline Number, Verizon email Customer Care Number, Verizon email support team phone number. Call, Verizon email tech  , Intuit Verizon email Tech Support Phone Number, Verizon email Help Desk Phone Number, Verizon email tech support number, Verizon email technical  , Verizon email phone number, Verizon email technical support number, Verizon email  , Verizon email technical support, Verizon email Customer Service Phone Number, Verizon email Customer Service Number, Verizon email Customer Support Phone Number, Verizon email Customer Support Number, Verizon email Customer Service Helpline Number, Verizon email Customer Care Number, Verizon email support team phone number, Verizon email help number-Verizon email Helpline Number; Verizon email help phone number, Verizon email Helpline Number, Verizon email Tech Support Toll free Number, Verizon email Support Telephone Number, Verizon email Tech Support Telephone number, Verizon email Tech Support contact number, Verizon email support contact number, Verizon email technical support contact number, Verizon email games  , Verizon email password recovery  . Verizon email password recovery customer   1-888-269-0130 Verizon email technical help telephone number, Verizon email technical help contact number, Verizon email technical support contact number, Verizon email contact number, Verizon email contact phone number, Verizon email contact telephone number, Verizon email 24 hour contact number, Verizon email customer support contact number, Verizon email customer service contact number, Verizon email official number, Verizon email official contact number, [269 contact number], Verizon email toll free number, 269 number for Verizon email support, Verizon email 24/7   Verizon email GAMES  ,Verizon email GAMES  ,Verizon email GAMES help phone number, Verizon email GAMES technical support number.Verizon email GAMES support number, Verizon email GAMES phone number, Verizon email GAMES tech support number, Verizon email GAMES customer support number, Verizon email GAMES customer  , Verizon email GAMES customer service phone number, Verizon email GAMES password recovery customer service phone number, Verizon email GAMES  . Help@Call 1-888-269-0130/.Verizon email 24/7  ,Verizon email telephone number for support? call 1-888-269-0130@./Verizon email contact number, Verizon email contact phone number, Verizon email contact telephone number,,telephone number for Verizon email online support,Verizon email official support number,Verizon email official number,Verizon email password recovery official phone number,,,phone number for Verizon email password recovery support,,Verizon email 24*7 HOURS SERVICE AVAILABLE  ,,Verizon email support number,Verizon email telephone number for support QB SUPPORT ON 1-888-269-0130 Verizon email PHONE NUMBER AND Verizon email SUPPORT PHONE like this0Quote 1.888.269.0130 Verizon email customer service number,Verizon email help desk number usa Verizon email customer care number Verizon email Customer support number Verizon email   usa Verizon email Customer Care number or Phone for Service,Verizon email Customer Service Number usa Verizon email customer care number,Verizon email help desk number, Verizon email   usa Verizon email Customer Support Phone Number, Verizon email Customer Support Number, Verizon email Customer Service Helpline Number, Verizon email Customer Care Number, Verizon email support team phone number, Verizon email help number.Verizon email Helpline Number; Verizon email help phone number, Verizon email Helpline Number, Verizon email Tech Support Toll free Number, Verizon email Support Telephone Number, Verizon email Tech Support Telephone number, Verizon email Tech Support contact number, Verizon email support contact number, Verizon email technical support contact number, Verizon email  , Verizon email payroll  . Verizon email payroll customer   1.888.269.0130 Verizon email technical help telephone number, Verizon email technical help contact number, Verizon email technical support contact number, Verizon email contact number, Verizon email contact phone number, Verizon email contact telephone number, Verizon email 24 hour contact number, Verizon email customer support contact number, Verizon email customer service contact number, Verizon email official number, Verizon email official contact number, Verizon email 269 contact number, Verizon email toll free number, 269 number for Verizon email support, Verizon email 24/7   Verizon email  ,Verizon email  ,Verizon email help phone number, Verizon email technical support number.Verizon email support number, Verizon email phone number, Verizon email tech support number, Verizon email customer support number, Verizon email customer  , Verizon email customer service phone number, Verizon email payroll customer service phone number, Verizon email  . Help@Call 1.888.269.0130/.Verizon email 24/7   \nHelp desk.support Verizon email tech support 1.888.269.0130.. Verizon email Customer service phone number Verizon email technical   usa Verizon email Customer Care number or Phone for Service \nVerizon email customer support number 1.888.269.0130 Verizon email customer service number,Verizon email help desk number usa Verizon email customer care number Verizon email Customer support number Verizon email   usa Verizon email Customer Care number or Phone for Service,Verizon email Customer Service Number usa Verizon email customer care number,Verizon email help desk number, Verizon email   usa Verizon email Customer Support Phone Number, Verizon email Customer Support Number, Verizon email Customer Service Helpline Number, Verizon email Customer Care Number, Verizon email support team phone number, Verizon email help number.Verizon email Helpline Number; Verizon email help phone number, Verizon email Helpline Number, Verizon email Tech Support Toll free Number, Verizon email Support Telephone Number, Verizon email Tech Support Telephone number, Verizon email Tech Support contact number, Verizon email support contact number, Verizon email technical support contact number, Verizon email  , Verizon email payroll  . Verizon email payroll customer   1.888.269.0130 Verizon email technical help telephone number, Verizon email technical help contact number, Verizon email technical support contact number, Verizon email contact number, Verizon email contact phone number, Verizon email contact telephone number, Verizon email 24 hour contact number, Verizon email customer support contact number, Verizon email customer service contact number, Verizon email official number, Verizon email official contact number, Verizon email 836 contact number, Verizon email toll free number, 836 number for Verizon email support, Verizon email 24/7   Verizon email  ,Verizon email  ,Verizon email help phone number, Verizon email technical support number.Verizon email support number, Verizon email phone number, Verizon email tech support number, Verizon email customer support number, Verizon email customer  , Verizon email customer service phone number, Verizon email payroll customer service phone number, Verizon email  . Help@Call 1.888.269.0130/.Verizon email 24/7  ,Verizon email telephone number for support? call 1.888.269.0130@./Verizon email contact number, Verizon email contact phone number, Verizon email contact telephone number,,telephone number for Verizon email online support,Verizon email official support number,Verizon email official number,Verizon email payroll official phone number,,,phone number for Verizon email payroll support,,Verizon email 24/7  ,,Verizon email support number,Verizon email telephone number for support Talk:TollFree,California 1.888.269.0130 USaA Verizon email payroll technical  ,1.888.269.0130 Intuit Verizon email customer service Phone Number Call,Av..1.888.269.0130.. Verizon email  , Verizon email customer service phone number 1.888.269.0130 FREE FREE FREE FREE FREE for all type help by Verizon email email.s tech  , Intuit Verizon email email.s Tech Support Phone Number, Verizon email email.s Help Desk Phone Number, Verizon email email.s tech support number, Verizon email email.s technical  ,@@@ Verizon email email.s phone number, Verizon email email.s technical support number, Verizon email email.s  , Verizon email email.s technical support, Verizon email email.s Customer Service Phone Number, Verizon email email.s Customer Service Number, Verizon email email.s Customer Support Phone Number, Verizon email email.s Customer Support Number,@@@@ Verizon email email.s Customer Service Helpline Number, Verizon email email.s Customer Care Number, Verizon email email.s support team phone number Talk:TollFree,California 1.888.269.0130 USA Verizon email payroll technical  ,1.888.269.0130 Intuit Verizon email customer service Phone Number TollFree,California 1.888.269.0130 USA Verizon email payroll technical  ,1.888.269.0130 Intuit Verizon email customer service Phone Number Verizon email email.s help number.Verizon email email.s Helpline Number; Verizon email email.s help phone number.Verizon email email.s Helpline Number, Verizon email email.s Tech Support Toll free Number, Verizon email email.s Support Telephone Number, Verizon email email.s Tech Support Telephone number, Verizon email email.s Tech Support contact number, Verizon email email.s support contact number, Verizon email email.s technical support contact number. Call, QuickCallSend SMSCall from mobileAdd to Skype You'll need Skype CreditFree via Skype Helpline Number.. 1.888.269.0130.. Verizon email tech  , Verizon email customer service phone number Call,QB customer..1.888.269.0130.. Verizon email  , Verizon email customer service phone number Call,..1.888.269.0130 Verizon email technical  .Verizon email phone number Verizon email Toll Free, Intuit@1.888.269.0130@.: Verizon email Tech Support Phone Number vides online solution for all USA/CANADA clients. For any help of query call 1.888.269.0130 to get all Verizon email account solution. @@Call, 1.888.269.0130 for all type help by Verizon email tech  , Intuit Verizon email Tech Support Phone Number, Verizon email Help Desk Phone Number, Verizon email tech support number, Verizon email technical  ,@@@ Verizon email phone number, Verizon email technical support number, Verizon email  , Verizon email technical support, Verizon email Customer Service Phone Number, Verizon email Customer Service Number, Verizon email Customer Support Phone Number, Verizon email Customer Support Number,@@@@ Verizon email Customer Service Helpline Number, Verizon email Customer Care Number, Verizon email support team phone number, Verizon email help number.Verizon email Helpline Number; Verizon email help phone number.Verizon email Helpline Number, Verizon email Tech Support Toll free Number, Verizon email Support Telephone Number, Verizon email Tech Support Telephone number, Verizon email Tech Support contact number, Verizon email support contact number, Verizon email technical support contact number. Call, Verizon email tech  , Intuit Verizon email Tech Support Phone Number, Verizon email Help Desk Phone Number, Verizon email tech support number, Verizon email technical  , Verizon email phone number, Verizon email technical support number, Verizon email  . It is very popular toll free number which vide by Verizon email technical support, Verizon email Customer Service Phone Number, Verizon email Customer Service Number, Verizon email Customer Support Phone Number, Verizon email Customer Support Number, Verizon email Customer Service Helpline Number, Verizon email Customer Care Number, Verizon email support team phone number. Call, Verizon email tech  , Intuit Verizon email Tech Support Phone Number, Verizon email Help Desk Phone Number, Verizon email tech support number, Verizon email technical  , Verizon email phone number, Verizon email technical support number, Verizon email  , Verizon email technical support, Verizon email Customer Service Phone Number, Verizon email Customer Service Number, Verizon email Customer Support Phone Number, Verizon email Customer Support Number, Verizon email Customer Service Helpline Number, Verizon email Customer Care Number, Verizon email support team phone number, Verizon email help number.Verizon email Helpline Number; Verizon email help phone number, Verizon email Helpline Number, Verizon email Tech Support Toll free Number, Verizon email Support Telephone Number, Verizon email Tech Support Telephone number, Verizon email Tech Support contact number, Verizon email support contact number, Verizon email technical support contact number, Verizon email  , Verizon email payroll  . Verizon email payroll customer   1.888.269.0130 Verizon email technical help telephone number, Verizon email technical help contact number, Verizon email technical support contact number, Verizon email contact number, Verizon email contact phone number, Verizon email contact telephone number, Verizon email 24 hour contact number, Verizon email customer support contact number, Verizon email customer service contact number, Verizon email official number, Verizon email official contact number, Verizon email 836 contact number, Verizon email toll free number, 836 number for Verizon email support, Verizon email 24/7   Verizon email  ,Verizon email  ,Verizon email help phone number, Verizon email technical support number.Verizon email support number, Verizon email phone number, Verizon email tech support number, Verizon email customer support number, Verizon email customer  , Verizon email customer service phone number, Verizon email payroll customer service phone number, Verizon email  . Help@Call 1.888.269.0130/.Verizon email 24/7  ,Verizon email telephone number for support? call 1.888.269.0130@./Verizon email contact number, Verizon email contact phone number, Verizon email contact telephone number,,telephone number for Verizon email online support,Verizon email official support number,Verizon email official number,Verizon email payroll official phone number,,,phone number for Verizon email payroll support,,Verizon email 24*7 HOURS SERVICE AVAILABLE  ,,Verizon email support number,Verizon email telephone number for support QB SUPPORT ON 1.888.269.0130 Verizon email PHONE NUMBER AND Verizon email SUPPORT PHONE like this0QuoteVerizon email help email Verizon email email support Verizon email help contact email Verizon email email help Verizon email support contact email Verizon email email support number contact Verizon email support email email Verizon email help contact Verizon email by email Verizon email email   contact Verizon email support by email Verizon email email support contact number Verizon email support email id email support Verizon email Verizon email email help contact help with Verizon email email contact Verizon email help email Verizon email support email contact email for Verizon email support Verizon email help email id Verizon email email support contact Verizon email contact support email support Verizon email email Verizon email support email address Verizon email help email address email phone number Verizon email Verizon email contact email contact SasktVerizon emailel email email Verizon email help email contact Verizon email email contact email a phone number Verizon email email to phone number Verizon email Verizon email account help help with Verizon email account Verizon email account support set up Verizon email account help Verizon email account help for Verizon email account Verizon email account support number Verizon email account help center Verizon email account sign in help help with my Verizon email account support Verizon email account log into Verizon email account help need help with Verizon email account get a Verizon email account Verizon email new account helpUSA best 1-888-269-0130 Verizon email $$$!!!Verizon email@0@ technical   Tech support Customer service support number helpline helpdesk phone number usa Verizon email Customer Care number$$!!! \nVerizon email tech support number 1-888-269-0130 Verizon email tech support Verizon email Customer service number Verizon email   usa Verizon email Customer Care number or Phone for Service,Verizon email Customer Care number 1-888-269-0130 Verizon email tech support number,Verizon email  ,Verizon email Customer Service Number usa Verizon email customer care number,Verizon email help desk number, Verizon email   usa Verizon email Customer Support Phone Number, Verizon email Customer Support Number, Verizon email Customer Service Helpline Number, Verizon email Customer Care Number, Verizon email support team phone number, Verizon email help number-Verizon email Helpline Number; Verizon email help phone number, Verizon email Helpline Number, Verizon email Tech Support Toll free Number, Verizon email Support Telephone Number, Verizon email Tech Support Telephone number, Verizon email Tech Support contact number, Verizon email support contact number, Verizon email technical support contact number, Verizon email games  , Verizon email password recovery  . Verizon email password recovery customer   1-888-269-0130 Verizon email technical help telephone number, Verizon email technical help contact number, Verizon email technical support contact number, Verizon email contact number, Verizon email contact phone number, Verizon email contact telephone number, Verizon email 24 hour contact number, Verizon email customer support contact number, Verizon email customer service contact number, Verizon email official number, Verizon email official contact number, Verizon email 269 contact number, Verizon email toll free number, 269 number for Verizon email support, Verizon email 24/7   Verizon email GAMES  ,Verizon email GAMES  ,Verizon email GAMES help phone number, Verizon email GAMES technical support number.Verizon email GAMES support number, Verizon email GAMES phone number, Verizon email GAMES tech support number, Verizon email GAMES customer support number, Verizon email GAMES customer  , Verizon email GAMES customer service phone number, Verizon email GAMES password recovery customer service phone number, Verizon email GAMES  . Help@Call 1-888-269-0130/.Verizon email 24/7  ,Verizon email telephone number for support? call 1-888-269-0130@./Verizon email contact number, Verizon email contact phone number, Verizon email contact telephone number,,telephone number for Verizon email online support,Verizon email official support number,Verizon email official number,Verizon email password recovery official phone number,,,phone number for Verizon email password recovery support,,Verizon email 24/7  ,,Verizon email support number,Verizon email telephone number for support Talk:TollFree,California 1-888-269-0130 USaA Verizon email password recovery technical  ,1-888-269-0130 Intuit Verizon email customer service Phone Number Call,Av..1-888-269-0130.. Verizon email  , Verizon email customer service phone number 1-888-269-0130 FREE FREE FREE FREE FREE for all type help by Verizon email .s Games tech  , Intuit Verizon email .s Games Tech Support Phone Number, Verizon email .s Games Help Desk Phone Number, Verizon email .s Games tech support number, Verizon email .s Games technical  ,@@@ Verizon email .s Games phone number, Verizon email .s Games technical support number, Verizon email .s Games  , Verizon email .s Games technical support, Verizon email .s Games Customer Service Phone Number, Verizon email .s Games Customer Service Number, Verizon email .s Games Customer Support Phone Number, Verizon email .s Games Customer Support Number,@@@@ Verizon email .s Games Customer Service Helpline Number, Verizon email .s Games Customer Care Number, Verizon email .s Games support team phone number Talk:TollFree,California 1-888-269-0130 USA Verizon email password recovery technical  ,1-888-269-0130 Intuit Verizon email customer service Phone Number TollFree,California 1-888-269-0130 USA Verizon email password recovery technical  ,1-888-269-0130 Intuit Verizon email customer service Phone Number Verizon email .s Games help number-Verizon email .s Games Helpline Number; Verizon email .s Games help phone number-Verizon email .s Games Helpline Number, Verizon email .s Games Tech Support Toll free Number, Verizon email .s Games Support Telephone Number, Verizon email .s Games Tech Support Telephone number, Verizon email .s Games Tech Support contact number, Verizon email .s Games support contact number, Verizon email .s Games technical support contact number. Call, QuickCallSend SMSCall from mobileAdd to Skype You'll need Skype CreditFree via Skype Helpline Number.. 1-888-269-0130.. Verizon email tech  , Verizon email customer service phone number Call,QB customer..1-888-269-0130.. Verizon email  , Verizon email customer service phone number Call,..1-888-269-0130 Verizon email technical  .Verizon email phone number Verizon email Toll Free, Intuit@1-888-269-0130@-: Verizon email Tech Support Phone Number gamesvides online solution for all USA/CANADA clients. For any help of query call 1-888-269-0130 to get all Verizon email account solution. @@Call, 1-888-269-0130 for all type help by Verizon email tech  , Intuit Verizon email Tech Support Phone Number, Verizon email Help Desk Phone Number, Verizon email tech support number, Verizon email technical  ,@@@ Verizon email phone number, Verizon email technical support number, Verizon email  , Verizon email technical support, Verizon email Customer Service Phone Number, Verizon email Customer Service Number, Verizon email Customer Support Phone Number, Verizon email Customer Support Number,@@@@ Verizon email Customer Service Helpline Number, Verizon email Customer Care Number, Verizon email support team phone number, Verizon email help number-Verizon email Helpline Number; Verizon email help phone number-Verizon email Helpline Number, Verizon email Tech Support Toll free Number, Verizon email Support Telephone Number, Verizon email Tech Support Telephone number, Verizon email Tech Support contact number, Verizon email support contact number, Verizon email technical support contact number. Call, Verizon email tech  , Intuit Verizon email Tech Support Phone Number, Verizon email Help Desk Phone Number, Verizon email tech support number, Verizon email technical  , Verizon email phone number, Verizon email technical support number, Verizon email  . It is very popular toll free number which gamesvide by Verizon email technical support, Verizon email Customer Service Phone Number, Verizon email Customer Service Number, Verizon email Customer Support Phone Number, Verizon email Customer Support Number, Verizon email Customer Service Helpline Number, Verizon email Customer Care Number, Verizon email support team phone number. Call, Verizon email tech  , Intuit Verizon email Tech Support Phone Number, Verizon email Help Desk Phone Number, Verizon email tech support number, Verizon email technical  , Verizon email phone number, Verizon email technical support number, Verizon email  , Verizon email technical support, Verizon email Customer Service Phone Number, Verizon email Customer Service Number, Verizon email Customer Support Phone Number, Verizon email Customer Support Number, Verizon email Customer Service Helpline Number, Verizon email Customer Care Number, Verizon email support team phone number, Verizon email help number-Verizon email Helpline Number; Verizon email help phone number, Verizon email Helpline Number, Verizon email Tech Support Toll free Number, Verizon email Support Telephone Number, Verizon email Tech Support Telephone number, Verizon email Tech Support contact number, Verizon email support contact number, Verizon email technical support contact number, Verizon email games  , Verizon email password recovery  . Verizon email password recovery customer   1-888-269-0130 Verizon email technical help telephone number, Verizon email technical help contact number, Verizon email technical support contact number, Verizon email contact number, Verizon email contact phone number, Verizon email contact telephone number, Verizon email 24 hour contact number, Verizon email customer support contact number, Verizon email customer service contact number, Verizon email official number, Verizon email official contact number, Verizon email 269 contact number, Verizon email toll free number, 269 number for Verizon email support, Verizon email 24/7   Verizon email GAMES  ,Verizon email GAMES  ,Verizon email GAMES help phone number, Verizon email GAMES technical support number.Verizon email GAMES support number, Verizon email GAMES phone number, Verizon email GAMES tech support number, Verizon email GAMES customer support number, Verizon email GAMES customer  , Verizon email GAMES customer service phone number, Verizon email GAMES password recovery customer service phone number, Verizon email GAMES  . Help@Call 1-888-269-0130/.Verizon email 24/7  ,Verizon email telephone number for support? call 1-888-269-0130@./Verizon email contact number, Verizon email contact phone number, Verizon email contact telephone number,,telephone number for Verizon email online support,Verizon email official support number,Verizon email official number,Verizon email password recovery official phone number,,,phone number for Verizon email password recovery support,,Verizon email 24*7 HOURS SERVICE AVAILABLE  ,,Verizon email support number,Verizon email telephone number for support QB SUPPORT ON 1-888-269-0130 Verizon email PHONE NUMBER AND Verizon email SUPPORT PHONE like this0QuoteVerizon email tech support number 1-888-269-0130 Verizon email Customer service number Verizon email   usa Verizon email Customer Care number or Phone for Service,Verizon email Customer Care number 1-888-269-0130 Verizon email tech support number,Verizon email  ,Verizon email Customer Service Number usa Verizon email customer care number,Verizon email help desk number, Verizon email   usa Verizon email Customer Support Phone Number, Verizon email Customer Support Number, Verizon email Customer Service Helpline Number, Verizon email Customer Care Number, Verizon email support team phone number, Verizon email help number-Verizon email Helpline Number; Verizon email help phone number, Verizon email Helpline Number, Verizon email Tech Support Toll free Number, Verizon email Support Telephone Number, Verizon email Tech Support Telephone number, Verizon email Tech Support contact number, Verizon email support contact number, Verizon email technical support contact number, Verizon email games  , Verizon email password recovery  . Verizon email password recovery customer   1-888-269-0130 Verizon email technical help telephone number, Verizon email technical help contact number, Verizon email technical support contact number, Verizon email contact number, Verizon email contact phone number, Verizon email contact telephone number, Verizon email 24 hour contact number, Verizon email customer support contact number, Verizon email customer service contact number, Verizon email official number, Verizon email official contact number, Verizon email 269 contact number, Verizon email toll free number, 269 number for Verizon email support, Verizon email 24/7   Verizon email GAMES  ,Verizon email GAMES  ,Verizon email GAMES help phone number, Verizon email GAMES technical support number.Verizon email GAMES support number, Verizon email GAMES phone number, Verizon email GAMES tech support number, Verizon email GAMES customer support number, Verizon email GAMES customer  , Verizon email GAMES customer service phone number, Verizon email GAMES password recovery customer service phone number, Verizon email GAMES  . Help@Call 1-888-269-0130/.Verizon email 24/7  ,Verizon email telephone number for support? call 1-888-269-0130@./Verizon email contact number, Verizon email contact phone number, Verizon email contact telephone number,,telephone number for Verizon email online support,Verizon email official support number,Verizon email official number,Verizon email password recovery official phone number,,,phone number for Verizon email password recovery support,,Verizon email 24/7  ,,Verizon email support number,Verizon email telephone number for support Talk:TollFree,California 1-888-269-0130 USaA Verizon email password recovery technical  ,1-888-269-0130 Intuit Verizon email customer service Phone Number Call,Av..1-888-269-0130.. Verizon email  , Verizon email customer service phone number 1-888-269-0130 FREE FREE FREE FREE FREE for all type help by Verizon email .s Games tech  , Intuit Verizon email .s Games Tech Support Phone Number, Verizon email .s Games Help Desk Phone Number, Verizon email .s Games tech support number, Verizon email .s Games technical  ,@@@ Verizon email .s Games phone number, Verizon email .s Games technical support number, Verizon email .s Games  , Verizon email .s Games technical support, Verizon email .s Games Customer Service Phone Number, Verizon email .s Games Customer Service Number, Verizon email .s Games Customer Support Phone Number, Verizon email .s Games Customer Support Number,@@@@ Verizon email .s Games Customer Service Helpline Number, Verizon email .s Games Customer Care Number, Verizon email .s Games support team phone number Talk:TollFree,California 1-888-269-0130 USA Verizon email password recovery technical  ,1-888-269-0130 Intuit Verizon email customer service Phone Number TollFree,California 1-888-269-0130 USA Verizon email password recovery technical  ,1-888-269-0130 Intuit Verizon email customer service Phone Number Verizon email .s Games help number-Verizon email .s Games Helpline Number; Verizon email .s Games help phone number-Verizon email .s Games Helpline Number, Verizon email .s Games Tech Support Toll free Number, Verizon email .s Games Support Telephone Number, Verizon email .s Games Tech Support Telephone number, Verizon email .s Games Tech Support contact number, Verizon email .s Games support contact number, Verizon email .s Games technical support contact number. Call, QuickCallSend SMSCall from mobileAdd to Skype You'll need Skype CreditFree via Skype Helpline Number.. 1-888-269-0130.. Verizon email tech  , Verizon email customer service phone number Call,QB customer..1-888-269-0130.. Verizon email  , Verizon email customer service phone number Call,..1-888-269-0130 Verizon email technical  .Verizon email phone number Verizon email Toll Free, Intuit@1-888-269-0130@-: Verizon email Tech Support Phone Number gamesvides online solution for all USA/CANADA clients. For any help of query call 1-888-269-0130 to get all Verizon email account solution. @@Call, 1-888-269-0130 for all type help by Verizon email tech  , Intuit Verizon email Tech Support Phone Number, Verizon email Help Desk Phone Number, Verizon email tech support number, Verizon email technical  ,@@@ Verizon email phone number, Verizon email technical support number, Verizon email  , Verizon email technical support, Verizon email Customer Service Phone Number, Verizon email Customer Service Number, Verizon email Customer Support Phone Number, Verizon email Customer Support Number,@@@@ Verizon email Customer Service Helpline Number, Verizon email Customer Care Number, Verizon email support team phone number, Verizon email help number-Verizon email Helpline Number; Verizon email help phone number-Verizon email Helpline Number, Verizon email Tech Support Toll free Number, Verizon email Support Telephone Number, Verizon email Tech Support Telephone number, Verizon email Tech Support contact number, Verizon email support contact number, Verizon email technical support contact number. Call, Verizon email tech  , Intuit Verizon email Tech Support Phone Number, Verizon email Help Desk Phone Number, Verizon email tech support number, Verizon email technical  , Verizon email phone number, Verizon email technical support number, Verizon email  . It is very popular toll free number which gamesvide by Verizon email technical support, Verizon email Customer Service Phone Number, Verizon email Customer Service Number, Verizon email Customer Support Phone Number, Verizon email Customer Support Number, Verizon email Customer Service Helpline Number, Verizon email Customer Care Number, Verizon email support team phone number. Call, Verizon email tech  , Intuit Verizon email Tech Support Phone Number, Verizon email Help Desk Phone Number, Verizon email tech support number, Verizon email technical  , Verizon email phone number, Verizon email technical support number, Verizon email  , Verizon email technical support, Verizon email Customer Service Phone Number, Verizon email Customer Service Number, Verizon email Customer Support Phone Number, Verizon email Customer Support Number, Verizon email Customer Service Helpline Number, Verizon email Customer Care Number, Verizon email support team phone number, Verizon email help number-Verizon email Helpline Number; Verizon email help phone number, Verizon email Helpline Number, Verizon email Tech Support Toll free Number, Verizon email Support Telephone Number, Verizon email Tech Support Telephone number, Verizon email Tech Support contact number, Verizon email support contact number, Verizon email technical support contact number, Verizon email games  , Verizon email password recovery  . Verizon email password recovery customer   1-888-269-0130 Verizon email technical help telephone number, Verizon email technical help contact number, Verizon email technical support contact number, Verizon email contact number, Verizon email contact phone number, Verizon email contact telephone number, Verizon email 24 hour contact number, Verizon email customer support contact number, Verizon email customer service contact number, Verizon email official number, Verizon email official contact number, [269 contact number], Verizon email toll free number, 269 number for Verizon email support, Verizon email 24/7   Verizon email GAMES  ,Verizon email GAMES  ,Verizon email GAMES help phone number, Verizon email GAMES technical support number.Verizon email GAMES support number, Verizon email GAMES phone number, Verizon email GAMES tech support number, Verizon email GAMES customer support number, Verizon email GAMES customer  , Verizon email GAMES customer service phone number, Verizon email GAMES password recovery customer service phone number, Verizon email GAMES  . Help@Call 1-888-269-0130/.Verizon email 24/7  ,Verizon email telephone number for support? call 1-888-269-0130@./Verizon email contact number, Verizon email contact phone number, Verizon email contact telephone number,,telephone number for Verizon email online support,Verizon email official support number,Verizon email official number,Verizon email password recovery official phone number,,,phone number for Verizon email password recovery support,,Verizon email 24*7 HOURS SERVICE AVAILABLE  ,,Verizon email support number,Verizon email telephone number for support QB SUPPORT ON 1-888-269-0130 Verizon email PHONE NUMBER AND Verizon email SUPPORT PHONE like this0Quote 1.888.269.0130 Verizon email customer service number,Verizon email help desk number usa Verizon email customer care number Verizon email Customer support number Verizon email   usa Verizon email Customer Care number or Phone for Service,Verizon email Customer Service Number usa Verizon email customer care number,Verizon email help desk number, Verizon email   usa Verizon email Customer Support Phone Number, Verizon email Customer Support Number, Verizon email Customer Service Helpline Number, Verizon email Customer Care Number, Verizon email support team phone number, Verizon email help number.Verizon email Helpline Number; Verizon email help phone number, Verizon email Helpline Number, Verizon email Tech Support Toll free Number, Verizon email Support Telephone Number, Verizon email Tech Support Telephone number, Verizon email Tech Support contact number, Verizon email support contact number, Verizon email technical support contact number, Verizon email  , Verizon email payroll  . Verizon email payroll customer   1.888.269.0130 Verizon email technical help telephone number, Verizon email technical help contact number, Verizon email technical support contact number, Verizon email contact number, Verizon email contact phone number, Verizon email contact telephone number, Verizon email 24 hour contact number, Verizon email customer support contact number, Verizon email customer service contact number, Verizon email official number, Verizon email official contact number, Verizon email 269 contact number, Verizon email toll free number, 269 number for Verizon email support, Verizon email 24/7   Verizon email  ,Verizon email  ,Verizon email help phone number, Verizon email technical support number.Verizon email support number, Verizon email phone number, Verizon email tech support number, Verizon email customer support number, Verizon email customer  , Verizon email customer service phone number, Verizon email payroll customer service phone number, Verizon email  . Help@Call 1.888.269.0130/.Verizon email 24/7   \nHelp desk.support Verizon email tech support 1.888.269.0130.. Verizon email Customer service phone number Verizon email technical   usa Verizon email Customer Care number or Phone for Service \nVerizon email customer support number 1.888.269.0130 Verizon email customer service number,Verizon email help desk number usa Verizon email customer care number Verizon email Customer support number Verizon email   usa Verizon email Customer Care number or Phone for Service,Verizon email Customer Service Number usa Verizon email customer care number,Verizon email help desk number, Verizon email   usa Verizon email Customer Support Phone Number, Verizon email Customer Support Number, Verizon email Customer Service Helpline Number, Verizon email Customer Care Number, Verizon email support team phone number, Verizon email help number.Verizon email Helpline Number; Verizon email help phone number, Verizon email Helpline Number, Verizon email Tech Support Toll free Number, Verizon email Support Telephone Number, Verizon email Tech Support Telephone number, Verizon email Tech Support contact number, Verizon email support contact number, Verizon email technical support contact number, Verizon email  , Verizon email payroll  . Verizon email payroll customer   1.888.269.0130 Verizon email technical help telephone number, Verizon email technical help contact number, Verizon email technical support contact number, Verizon email contact number, Verizon email contact phone number, Verizon email contact telephone number, Verizon email 24 hour contact number, Verizon email customer support contact number, Verizon email customer service contact number, Verizon email official number, Verizon email official contact number, Verizon email 836 contact number, Verizon email toll free number, 836 number for Verizon email support, Verizon email 24/7   Verizon email  ,Verizon email  ,Verizon email help phone number, Verizon email technical support number.Verizon email support number, Verizon email phone number, Verizon email tech support number, Verizon email customer support number, Verizon email customer  , Verizon email customer service phone number, Verizon email payroll customer service phone number, Verizon email  . Help@Call 1.888.269.0130/.Verizon email 24/7  ,Verizon email telephone number for support? call 1.888.269.0130@./Verizon email contact number, Verizon email contact phone number, Verizon email contact telephone number,,telephone number for Verizon email online support,Verizon email official support number,Verizon email official number,Verizon email payroll official phone number,,,phone number for Verizon email payroll support,,Verizon email 24/7  ,,Verizon email support number,Verizon email telephone number for support Talk:TollFree,California 1.888.269.0130 USaA Verizon email payroll technical  ,1.888.269.0130 Intuit Verizon email customer service Phone Number Call,Av..1.888.269.0130.. Verizon email  , Verizon email customer service phone number 1.888.269.0130 FREE FREE FREE FREE FREE for all type help by Verizon email email.s tech  , Intuit Verizon email email.s Tech Support Phone Number, Verizon email email.s Help Desk Phone Number, Verizon email email.s tech support number, Verizon email email.s technical  ,@@@ Verizon email email.s phone number, Verizon email email.s technical support number, Verizon email email.s  , Verizon email email.s technical support, Verizon email email.s Customer Service Phone Number, Verizon email email.s Customer Service Number, Verizon email email.s Customer Support Phone Number, Verizon email email.s Customer Support Number,@@@@ Verizon email email.s Customer Service Helpline Number, Verizon email email.s Customer Care Number, Verizon email email.s support team phone number Talk:TollFree,California 1.888.269.0130 USA Verizon email payroll technical  ,1.888.269.0130 Intuit Verizon email customer service Phone Number TollFree,California 1.888.269.0130 USA Verizon email payroll technical  ,1.888.269.0130 Intuit Verizon email customer service Phone Number Verizon email email.s help number.Verizon email email.s Helpline Number; Verizon email email.s help phone number.Verizon email email.s Helpline Number, Verizon email email.s Tech Support Toll free Number, Verizon email email.s Support Telephone Number, Verizon email email.s Tech Support Telephone number, Verizon email email.s Tech Support contact number, Verizon email email.s support contact number, Verizon email email.s technical support contact number. Call, QuickCallSend SMSCall from mobileAdd to Skype You'll need Skype CreditFree via Skype Helpline Number.. 1.888.269.0130.. Verizon email tech  , Verizon email customer service phone number Call,QB customer..1.888.269.0130.. Verizon email  , Verizon email customer service phone number Call,..1.888.269.0130 Verizon email technical  .Verizon email phone number Verizon email Toll Free, Intuit@1.888.269.0130@.: Verizon email Tech Support Phone Number vides online solution for all USA/CANADA clients. For any help of query call 1.888.269.0130 to get all Verizon email account solution. @@Call, 1.888.269.0130 for all type help by Verizon email tech  , Intuit Verizon email Tech Support Phone Number, Verizon email Help Desk Phone Number, Verizon email tech support number, Verizon email technical  ,@@@ Verizon email phone number, Verizon email technical support number, Verizon email  , Verizon email technical support, Verizon email Customer Service Phone Number, Verizon email Customer Service Number, Verizon email Customer Support Phone Number, Verizon email Customer Support Number,@@@@ Verizon email Customer Service Helpline Number, Verizon email Customer Care Number, Verizon email support team phone number, Verizon email help number.Verizon email Helpline Number; Verizon email help phone number.Verizon email Helpline Number, Verizon email Tech Support Toll free Number, Verizon email Support Telephone Number, Verizon email Tech Support Telephone number, Verizon email Tech Support contact number, Verizon email support contact number, Verizon email technical support contact number. Call, Verizon email tech  , Intuit Verizon email Tech Support Phone Number, Verizon email Help Desk Phone Number, Verizon email tech support number, Verizon email technical  , Verizon email phone number, Verizon email technical support number, Verizon email  . It is very popular toll free number which vide by Verizon email technical support, Verizon email Customer Service Phone Number, Verizon email Customer Service Number, Verizon email Customer Support Phone Number, Verizon email Customer Support Number, Verizon email Customer Service Helpline Number, Verizon email Customer Care Number, Verizon email support team phone number. Call, Verizon email tech  , Intuit Verizon email Tech Support Phone Number, Verizon email Help Desk Phone Number, Verizon email tech support number, Verizon email technical  , Verizon email phone number, Verizon email technical support number, Verizon email  , Verizon email technical support, Verizon email Customer Service Phone Number, Verizon email Customer Service Number, Verizon email Customer Support Phone Number, Verizon email Customer Support Number, Verizon email Customer Service Helpline Number, Verizon email Customer Care Number, Verizon email support team phone number, Verizon email help number.Verizon email Helpline Number; Verizon email help phone number, Verizon email Helpline Number, Verizon email Tech Support Toll free Number, Verizon email Support Telephone Number, Verizon email Tech Support Telephone number, Verizon email Tech Support contact number, Verizon email support contact number, Verizon email technical support contact number, Verizon email  , Verizon email payroll  . Verizon email payroll customer   1.888.269.0130 Verizon email technical help telephone number, Verizon email technical help contact number, Verizon email technical support contact number, Verizon email contact number, Verizon email contact phone number, Verizon email contact telephone number, Verizon email 24 hour contact number, Verizon email customer support contact number, Verizon email customer service contact number, Verizon email official number, Verizon email official contact number, Verizon email 836 contact number, Verizon email toll free number, 836 number for Verizon email support, Verizon email 24/7   Verizon email  ,Verizon email  ,Verizon email help phone number, Verizon email technical support number.Verizon email support number, Verizon email phone number, Verizon email tech support number, Verizon email customer support number, Verizon email customer  , Verizon email customer service phone number, Verizon email payroll customer service phone number, Verizon email  . Help@Call 1.888.269.0130/.Verizon email 24/7  ,Verizon email telephone number for support? call 1.888.269.0130@./Verizon email contact number, Verizon email contact phone number, Verizon email contact telephone number,,telephone number for Verizon email online support,Verizon email official support number,Verizon email official number,Verizon email payroll official phone number,,,phone number for Verizon email payroll support,,Verizon email 24*7 HOURS SERVICE AVAILABLE  ,,Verizon email support number,Verizon email telephone number for support QB SUPPORT ON 1.888.269.0130 Verizon email PHONE NUMBER AND Verizon email SUPPORT PHONE like this0QuoteVerizon email help email Verizon email email support Verizon email help contact email Verizon email email help Verizon email support contact email Verizon email email support number contact Verizon email support email email Verizon email help contact Verizon email by email Verizon email email   contact Verizon email support by email Verizon email email support contact number Verizon email support email id email support Verizon email Verizon email email help contact help with Verizon email email contact Verizon email help email Verizon email support email contact email for Verizon email support Verizon email help email id Verizon email email support contact Verizon email contact support email support Verizon email email Verizon email support email address Verizon email help email address email phone number Verizon email Verizon email contact email contact SasktVerizon emailel email email Verizon email help email contact Verizon email email contact email a phone number Verizon email email to phone number Verizon email Verizon email account help help with Verizon email account Verizon email account support set up Verizon email account help Verizon email account help for Verizon email account Verizon email account support number Verizon email account help center Verizon email account sign in help help with my Verizon email account support Verizon email account log into Verizon email account help need help with Verizon email account get a Verizon email account Verizon email new account help \nVerizon email help desk phone number in usa \nVerizon email tech   free in usa",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [
          {
            "name": "veriz",
            "sentiment": "positive"
          }
        ],
        "organizations": [
          {
            "name": "verizon",
            "sentiment": "positive"
          },
          {
            "name": "help desk phone number verizon",
            "sentiment": "none"
          },
          {
            "name": "customer service number verizon",
            "sentiment": "none"
          },
          {
            "name": "usaa verizon",
            "sentiment": "none"
          },
          {
            "name": "skype",
            "sentiment": "none"
          },
          {
            "name": "customer care",
            "sentiment": "none"
          },
          {
            "name": "intuit verizon",
            "sentiment": "none"
          },
          {
            "name": "customer service",
            "sentiment": "none"
          },
          {
            "name": "phone for service  verizon",
            "sentiment": "none"
          },
          {
            "name": "customer service phone number",
            "sentiment": "none"
          },
          {
            "name": "usa verizon",
            "sentiment": "none"
          },
          {
            "name": "customer care number verizon",
            "sentiment": "none"
          },
          {
            "name": "customer care  usa",
            "sentiment": "none"
          },
          {
            "name": "customer support phone number verizon",
            "sentiment": "none"
          },
          {
            "name": "customer service number usa verizon",
            "sentiment": "none"
          },
          {
            "name": "skype helpline number",
            "sentiment": "none"
          },
          {
            "name": "phone for service",
            "sentiment": "none"
          },
          {
            "name": "customer care  verizon",
            "sentiment": "none"
          }
        ],
        "locations": [
          {
            "name": "usa",
            "sentiment": "none"
          },
          {
            "name": "california",
            "sentiment": "none"
          }
        ]
      },
      "crawled": "2016-12-03T12:15:42.664+02:00"
    },
    {
      "thread": {
        "uuid": "a27e5702578a1263781b6b80470eaf1e096e8dd4",
        "url": "http://omgili.com/ri/3Ebkq4DFLEvhTLpNwcXT47LXU1UzywxrjM1nw5zzBcgr1Qezd.h74db3fmn7JWRA",
        "site_full": "omaha.craigslist.org",
        "site": "craigslist.org",
        "site_section": "http://omaha.craigslist.org/search/sss?format=rss",
        "site_categories": [],
        "section_title": "craigslist omaha | for sale search",
        "title": "iPhone 6 128GB space grey (Omaha) $350",
        "title_full": "iPhone 6 128GB space grey (Omaha) $350",
        "published": "2016-12-04T08:31:54.074+02:00",
        "replies_count": 0,
        "participants_count": 0,
        "site_type": "blogs",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "https://images.craigslist.org/00d0d_cIbswJI3Q0C_600x450.jpg",
        "performance_score": 0,
        "domain_rank": 71,
        "social": {
          "facebook": {
            "likes": 0,
            "comments": 0,
            "shares": 0
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "a27e5702578a1263781b6b80470eaf1e096e8dd4",
      "url": "http://omgili.com/ri/3Ebkq4DFLEvhTLpNwcXT47LXU1UzywxrjM1nw5zzBcgr1Qezd.h74db3fmn7JWRA",
      "ord_in_thread": 0,
      "author": "",
      "published": "2016-12-04T08:31:54.074+02:00",
      "title": "iPhone 6 128GB space grey (Omaha) $350",
      "text": "  This is iPhone 6 128GB Space Grey Has had screen cover. On it whole time perfect condition Verizon phone but can use on different carriers unlocked 350OBO do NOT contact me with unsolicited services or offers post id: 5865391080",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [],
        "organizations": [
          {
            "name": "verizon",
            "sentiment": "positive"
          }
        ],
        "locations": [
          {
            "name": "omaha",
            "sentiment": "none"
          }
        ]
      },
      "crawled": "2016-12-04T08:31:54.074+02:00"
    },
    {
      "thread": {
        "uuid": "1595f6461e7d5974543f2f17ef9aae7404522820",
        "url": "http://omgili.com/ri/_0JOtn.4SCqb2fOxsoDj4KOC6wnpYD0i3umGeEKNU3msVDoKo3BvkwiTv5NUJ9DgFsMaAPOYITYUpfZx53I.8GUx4WvH8PPEj8_s4BW3aKE9eQhnstMHK97lnkyHHYXFaRODs75tXcX9h5APOBgjJ4QZ4ix6pMiA_JXFR1gfNzDnc0z5Y.tSgLp.P6eWzZLZUXflpTB4pnpm1SbwBUjh82YlgpTq1TqtXo3VLd6lQs7hFxiRFzv5oqPfp3dU3X.gCpo6FmebLhE-",
        "site_full": "bostonherald.com",
        "site": "bostonherald.com",
        "site_section": "http://bostonherald.com/business/technology",
        "site_categories": [
          "news"
        ],
        "section_title": "Technology | Boston Herald",
        "title": "Verizon service set to come online within weeks",
        "title_full": "Verizon service set to come online within weeks | Boston Herald",
        "published": "2016-12-04T15:47:00.000+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "news",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "http://www.bostonherald.com/sites/default/files/styles/gallery/public/media/ap/2016/12/03/f203cf774ce648b5bf953fb5dbf95b36.jpg?itok=aQtK0lYQ",
        "performance_score": 0,
        "domain_rank": 8876,
        "social": {
          "facebook": {
            "likes": 0,
            "comments": 0,
            "shares": 0
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "1595f6461e7d5974543f2f17ef9aae7404522820",
      "url": "http://omgili.com/ri/_0JOtn.4SCqb2fOxsoDj4KOC6wnpYD0i3umGeEKNU3msVDoKo3BvkwiTv5NUJ9DgFsMaAPOYITYUpfZx53I.8GUx4WvH8PPEj8_s4BW3aKE9eQhnstMHK97lnkyHHYXFaRODs75tXcX9h5APOBgjJ4QZ4ix6pMiA_JXFR1gfNzDnc0z5Y.tSgLp.P6eWzZLZUXflpTB4pnpm1SbwBUjh82YlgpTq1TqtXo3VLd6lQs7hFxiRFzv5oqPfp3dU3X.gCpo6FmebLhE-",
      "ord_in_thread": 0,
      "author": "Jordan Graham",
      "published": "2016-12-04T15:47:00.000+02:00",
      "title": "Verizon service set to come online within weeks",
      "text": "Verizon service set to come online within weeks Jordan Graham Sunday, December 04, 2016 Credit: The Associated Press Verizon comments The first Boston customer accounts for Verizon’s high speed FiOS internet service could come online in the next few weeks, the company says, as the city prepares to grant a crucial license to the cable and communications giant.\n“We are planning to begin offering FiOS in parts of our very first service area later this month,” said Michael Murphy, a spokesman for Verizon. “We estimate that by year’s end Fios services will be available to approximately 25,000 premises in Dorchester, the Dudley Square Innovation District of Roxbury, Roslindale and West Roxbury.”\nVerizon said earlier this year it would spend $300 million over six years to install high-speed fiber optic lines throughout the city, beginning with Dudley Square, parts of Dorchester and West Roxbury.\nBoston has no authority to oversee internet service in the city, but does have the power to regulate cable television providers, which Verizon aims to offer as well.\nA draft cable license — a requirement to offer cable television — is expected to be approved soon, clearing the way for Verizon to begin selling and marketing FiOS.\n“My expectation is we will make a decision quite quickly, as soon as next week,” said Jascha Franklin-Hodge, chief information officer for Boston. “We anticipate being able to reach an agreement on a final agreement in the near term.”\nThe license only grants Verizon the ability to serve certain neighborhoods, but can be expanded. The license says Verizon must offer service to anyone who wants it, with some exceptions experts said are relatively standard.\nOne thing the license does not include is requirements for Verizon’s workforce, including mandating union labor, which advocates pushed for — and got — in license negotiations between Verizon and Philadelphia last year. But Myles Calvey, business manager for IBEW Local 2222, which represents Boston’s Verizon workers, said those provisions weren’t necessary because Local 2222’s contract says Verizon must use union workers and cannot hire non-union contractors.\nCalvey said the FiOS installation has brought some much-needed work for the union.\n“This has been a resurrection for us, we had been dying on the vine, no one was taking copper wires,” Calvey said, referring to copper lines historically used for phone and slower internet connections. “Nobody was getting landlines anymore, this brought new work and good work.”\nVerizon also said it would also fund a mobile hotspot lending program through the Boston Public Library and work with city officials on “smart city” projects. Neither of those are included in the license, but a BPL spokeswoman said the hotspot lending program is in development.",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [
          {
            "name": "michael murphy",
            "sentiment": "none"
          },
          {
            "name": "calvey",
            "sentiment": "none"
          },
          {
            "name": "jascha franklin-hodge",
            "sentiment": "none"
          },
          {
            "name": "myles calvey",
            "sentiment": "none"
          }
        ],
        "organizations": [
          {
            "name": "verizon",
            "sentiment": "positive"
          },
          {
            "name": "associated press verizon",
            "sentiment": "none"
          },
          {
            "name": "bpl",
            "sentiment": "none"
          },
          {
            "name": "boston public library",
            "sentiment": "none"
          },
          {
            "name": "ibew local 2222",
            "sentiment": "none"
          }
        ],
        "locations": [
          {
            "name": "jordan graham",
            "sentiment": "none"
          },
          {
            "name": "roslindale",
            "sentiment": "none"
          },
          {
            "name": "dudley square innovation district of roxbury",
            "sentiment": "none"
          },
          {
            "name": "philadelphia",
            "sentiment": "none"
          },
          {
            "name": "west roxbury",
            "sentiment": "none"
          },
          {
            "name": "dorchester",
            "sentiment": "none"
          },
          {
            "name": "boston",
            "sentiment": "none"
          },
          {
            "name": "dudley square",
            "sentiment": "none"
          }
        ]
      },
      "crawled": "2016-12-04T18:23:52.445+02:00"
    },
    {
      "thread": {
        "uuid": "6777b2f8e66066cdbda88a9d85dfeffeb1ed3e34",
        "url": "http://omgili.com/ri/jHIAmI4hxg.aX6RsjGyewdSgFYxio7I4I9eJJYVAsROmkm9ITpCkUX05n51uuWXEHJDijv1.3oKDfZtJzLhp6nPNcnMSTiRs",
        "site_full": "www.androidguys.com",
        "site": "androidguys.com",
        "site_section": "http://www.androidguys.com/feed",
        "site_categories": [
          "news",
          "entertainment",
          "tech"
        ],
        "section_title": "AndroidGuys",
        "title": "The best deals on phones and accessories through Verizon",
        "title_full": "The best deals on phones and accessories through Verizon",
        "published": "2016-12-04T20:00:32.614+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "news",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "http://www.androidguys.com/wp-content/uploads/2016/08/verizon_faster_network.png",
        "performance_score": 0,
        "domain_rank": 38006,
        "social": {
          "facebook": {
            "likes": 0,
            "comments": 0,
            "shares": 0
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "6777b2f8e66066cdbda88a9d85dfeffeb1ed3e34",
      "url": "http://omgili.com/ri/jHIAmI4hxg.aX6RsjGyewdSgFYxio7I4I9eJJYVAsROmkm9ITpCkUX05n51uuWXEHJDijv1.3oKDfZtJzLhp6nPNcnMSTiRs",
      "ord_in_thread": 0,
      "author": "AndroidGuys",
      "published": "2016-12-04T20:00:32.614+02:00",
      "title": "The best deals on phones and accessories through Verizon",
      "text": "By AndroidGuys \nTime to purchase a new smartphone? Is this an upgrade from an existing device? We want to help you out either way. \nTo save you money, we’ve gathered up all of the promotions we could find from Verizon . Regardless of where you’re thinking of going for service, or what phone you are looking to pick up, you owe it to yourself to check below. \nWhat follows is a mix of phone, rate plan, and accessory promotions worth checking out. It might not be an exhaustive list, but it’s a good collection of what’s currently offered through Verizon . \nAlthough we’ve listed known expiration dates, we have no idea how long some of these other deals will last.",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [],
        "organizations": [
          {
            "name": "verizon",
            "sentiment": "positive"
          },
          {
            "name": "androidguys  time",
            "sentiment": "neutral"
          }
        ],
        "locations": []
      },
      "crawled": "2016-12-04T20:00:32.614+02:00"
    },
    {
      "thread": {
        "uuid": "caaa31538717f81959be034837564ff8675eb2aa",
        "url": "http://omgili.com/ri/2wGaacqxApvQboY7on5a1l9L3GcBODsgg0QtL0JzN42dstbhyvXj.vUh0ZQBk_AH.83HD2GYXx4.SwYM05j1r7TrEjk8lrY_N9n86.CbM0cN8YUGXThg4L6dlXrcNAf2P3v1uKka39ZntjZAFNGhxseXbpZaMWqXqM.cYI5l7cOTfvvGZ3A206B8fAtken..TTmdompk5MGk7EctGqQDAI1aJPIO7eQa",
        "site_full": "markets.financialcontent.com",
        "site": "financialcontent.com",
        "site_section": "http://finance.dailyherald.com/dailyherald/action/rssfeed?ChannelID=3197",
        "site_categories": [
          "finance",
          "business"
        ],
        "section_title": "PR Newswire",
        "title": "Verizon customers can connect with friends and family in Indonesia for free following massive earthquake",
        "title_full": "Verizon customers can connect with friends and family in Indonesia for free following massive earthquake",
        "published": "2016-12-07T20:33:02.345+02:00",
        "replies_count": 0,
        "participants_count": 0,
        "site_type": "blogs",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "",
        "performance_score": 0,
        "domain_rank": 86243,
        "social": {
          "facebook": {
            "likes": 0,
            "comments": 0,
            "shares": 0
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "caaa31538717f81959be034837564ff8675eb2aa",
      "url": "http://omgili.com/ri/2wGaacqxApvQboY7on5a1l9L3GcBODsgg0QtL0JzN42dstbhyvXj.vUh0ZQBk_AH.83HD2GYXx4.SwYM05j1r7TrEjk8lrY_N9n86.CbM0cN8YUGXThg4L6dlXrcNAf2P3v1uKka39ZntjZAFNGhxseXbpZaMWqXqM.cYI5l7cOTfvvGZ3A206B8fAtken..TTmdompk5MGk7EctGqQDAI1aJPIO7eQa",
      "ord_in_thread": 0,
      "author": "",
      "published": "2016-12-07T20:33:02.345+02:00",
      "title": "Verizon customers can connect with friends and family in Indonesia for free following massive earthquake",
      "text": "December 07, 2016 at 12:01 PM EST Verizon customers can connect with friends and family in Indonesia for free following massive earthquake \nNEW YORK , Dec. 7, 2016 /PRNewswire/ -- More than 160,000 Verizon employees worldwide want to support our friends and family in Indonesia who have been impacted by the massive 6.4 earthquake. Verizon is offering free wireless and wireline calling from the U.S. to Indonesia to connect with family and friends. Home wireline telephone customers will incur no charges to Indonesia from their U.S. landlines from December 7 through 9, 2016 (applicable taxes and surcharges will apply). Wireless users will incur no charges for texts or international long distance calls originating from the U.S. to Indonesia on December 7 through 9, 2016 (applicable taxes and surcharges will apply). \nVerizon Communications Inc. (NYSE, Nasdaq: VZ), headquartered in New York City , has a diverse workforce of 162,000 and generated nearly $132 billion in 2015 revenues. Verizon operates America's most reliable wireless network, with 113.7 million retail connections nationwide. The company also provides communications and entertainment services over mobile broadband and the nation's premier all-fiber network, and delivers integrated business solutions to customers worldwide. \nVerizon's Online News Center: News releases, feature stories, executive biographies and media contacts are available at Verizon's online News Center at www.verizon.com/news /. News releases are also available through an RSS feed. To subscribe, visit www.verizon.com/about/rss-feeds/ . \nMedia contact:",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [],
        "organizations": [
          {
            "name": "verizon",
            "sentiment": "positive"
          },
          {
            "name": "verizon communications inc.",
            "sentiment": "none"
          },
          {
            "name": "news center",
            "sentiment": "none"
          },
          {
            "name": "nyse",
            "sentiment": "none"
          }
        ],
        "locations": [
          {
            "name": "indonesia",
            "sentiment": "none"
          },
          {
            "name": "new york city",
            "sentiment": "none"
          },
          {
            "name": "america",
            "sentiment": "none"
          },
          {
            "name": "u.s.",
            "sentiment": "none"
          },
          {
            "name": "new york",
            "sentiment": "none"
          }
        ]
      },
      "crawled": "2016-12-07T20:33:02.345+02:00"
    },
    {
      "thread": {
        "uuid": "b4668240a98d5351e4a823efd246833fe51aff36",
        "url": "http://omgili.com/ri/WOapK6QZrmlkmFo.VTf5JyFK9oFbJ4FzZIC8.wcm1Q52uq0F1lBJpA9WQr_reSBUSOGmykyGG1OlUQrIbz2vCAaD.mpiTBphcZtJA_yzVAXEnABnSRFreokMu6KMcPM4kqV9LNiAIDQ-",
        "site_full": "readwrite.com",
        "site": "readwrite.com",
        "site_section": "http://readwrite.com/rss.xml",
        "site_categories": [
          "tech",
          "education",
          "business"
        ],
        "section_title": "ReadWrite",
        "title": "Lots of smart city deal action with Libelium, Verizon as space heats up",
        "title_full": "Lots of smart city deal action with Libelium, Verizon as space heats up",
        "published": "2016-12-08T00:49:50.793+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "blogs",
        "country": "US",
        "spam_score": 0.0,
        "main_image": "http://15809-presscdn-0-93.pagely.netdna-cdn.com/wp-content/uploads/iStock-488817450-e1481147930111.jpg",
        "performance_score": 0,
        "domain_rank": 16436,
        "social": {
          "facebook": {
            "likes": 0,
            "comments": 0,
            "shares": 0
          },
          "gplus": {
            "shares": 0
          },
          "pinterest": {
            "shares": 0
          },
          "linkedin": {
            "shares": 0
          },
          "stumbledupon": {
            "shares": 0
          },
          "vk": {
            "shares": 0
          }
        }
      },
      "uuid": "b4668240a98d5351e4a823efd246833fe51aff36",
      "url": "http://omgili.com/ri/WOapK6QZrmlkmFo.VTf5JyFK9oFbJ4FzZIC8.wcm1Q52uq0F1lBJpA9WQr_reSBUSOGmykyGG1OlUQrIbz2vCAaD.mpiTBphcZtJA_yzVAXEnABnSRFreokMu6KMcPM4kqV9LNiAIDQ-",
      "ord_in_thread": 0,
      "author": "Donal Power",
      "published": "2016-12-08T00:49:50.793+02:00",
      "title": "Lots of smart city deal action with Libelium, Verizon as space heats up",
      "text": "Lots of smart city deal action with Libelium, Verizon as space heats up Posted on Donal Power http://www.criticalvc.com/ Contributing Writer \nSmart city technology saw developments on two fronts this past week as Verizon boosted its Internet of Things (IoT) strategy through the LQD WiFi acquisition and Spain’s Libelium launhced a new platform for smart city sensors. \nTechCrunch reported that U.S.-based wireless giant Verizon acquired LQD WiFi to further its IoT strategy in the smart city arena. Terms of the deal were not disclosed but to date LQD had only raised $1.73 million in funding. \nLQD develops outdoor display equipment that house sensors which collect weather, crowd and other data. The interactive displays also provide WiFi connectivity as well as community information and emergency alerts. \nLQD’s primary product is a kiosk-like structure called Palo that seeks to engage citizens. The interactive array is in competition with the similar LinkNYC public terminal which suffered embarrassing headlines after its misuse for pornography and blaring music. \n“LQD’s Palo technology hubs capture Verizon’s vision of delivering citizen engagement experiences by connecting people with their communities while providing critical security, transportation and wayfinding solutions as well as Wi-Fi capabilities,” said Verizon senior vice president Mike Lanman. \nVerizon has made three other acquisitions this year to beef up its emerging IoT business. The IoT strategy is seen as syncing up with Verizon’s parallel acquisition program that is adding capabilities from consumer-focused media concerns. Libelium debuts new platform \nMeanwhile, Spain’s Libelium launched its new IoT Sensor Platform for Smart Cities at the Smart City Expo in Barcelona. \nThe platform is designed to provide increased accuracy for air quality and sound sensors, which is in response for market demands for higher precision. \nThe company said in a release that its enhanced sensor design on its new platform seeks to help smart cities of the future address two of the most important environmental risk factors. In particular the platform will accommodate sensor monitoring through highly accurate air pollution sensors and traffic monitoring microphones. \n“The accuracy of these sensors and the fact of being wireless communicated with any Cloud platform in real time make them the perfect complement to extend the capillarity of these services in Smart Cities,” said Libelium Chief Technology Officer David Gascón.",
      "highlightText": "",
      "highlightTitle": "",
      "language": "english",
      "external_links": [],
      "entities": {
        "persons": [
          {
            "name": "donal power",
            "sentiment": "positive"
          },
          {
            "name": "david gascón",
            "sentiment": "none"
          },
          {
            "name": "mike lanman",
            "sentiment": "none"
          }
        ],
        "organizations": [
          {
            "name": "verizon",
            "sentiment": "positive"
          }
        ],
        "locations": [
          {
            "name": "palo",
            "sentiment": "none"
          },
          {
            "name": "smart city expo",
            "sentiment": "none"
          },
          {
            "name": "spain",
            "sentiment": "none"
          },
          {
            "name": "barcelona",
            "sentiment": "none"
          }
        ]
      },
      "crawled": "2016-12-08T00:49:50.793+02:00"
    }
  ],
  "totalResults": 29,
  "moreResultsAvailable": 0,
  "next": "/search?token=c6052904-f312-436b-a6d8-d915084ac866&format=json&ts=1481150990793&q=language%3A%28english%29+thread.country%3AUS+organization.positive%3A%22Verizon%22",
  "requestsLeft": 977
}
